
Функция ПространствоИмен()
	Возврат	"http://collant.ru/ExchangeTSD1";
КонецФункции //ПространствоИмен()

Функция URIПространстваИменСервиса()
	Возврат "http://collant.ru/wsExchangeTSD";
КонецФункции

Функция _ТипОбъекта(Объект,МетаОбъект="") Экспорт
	ТипОбъекта=ТипЗнч(Объект);
	
	Если ТипОбъекта=Тип("Строка") ИЛИ ТипОбъекта=Тип("Дата") ИЛИ ТипОбъекта=Тип("Число") ИЛИ ТипОбъекта=Тип("Булево") Тогда
		Возврат ""+ТипОбъекта;	
	КонецЕсли; 
	
	Если ТипОбъекта=Тип("ОбъектМетаданных") Тогда
		МетаОбъект=Объект;
	ИначеЕсли ТипОбъекта=Тип("Тип") Тогда
		МетаОбъект=Метаданные.НайтиПоТипу(Объект);			
	Иначе
		МетаОбъект=Метаданные.НайтиПоТипу(ТипОбъекта);	
	КонецЕсли;	
	
	Если МетаОбъект<>Неопределено Тогда
		ПолноеИмя=МетаОбъект.ПолноеИмя();
		Поз=Найти(ПолноеИмя,".");
		Если Поз<>0 Тогда
			Возврат Лев(ПолноеИмя,Поз-1);		
		Иначе
			Возврат "ПокаНеопределенный";		
		КонецЕсли;		
	Иначе
		Если ТипОбъекта=Тип("УдалениеОбъекта") Тогда
			Возврат "Удаление";
		ИначеЕсли ТипОбъекта=Тип("Структура")  Тогда
			Возврат "Структура";		
		ИначеЕсли ТипОбъекта=Тип("Соответствие")  Тогда
			Возврат "Соответствие";		
		ИначеЕсли ТипОбъекта=Тип("СписокЗначений")  Тогда
			Возврат "СписокЗначений";		
		ИначеЕсли ТипОбъекта=Тип("ТаблицаЗначений") Тогда
			Возврат "ТаблицаЗначений";
		ИначеЕсли ТипОбъекта=Тип("Тип") Тогда
			Возврат ""+Объект;
		Иначе			
			Возврат ""+ТипОбъекта;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции // ТипОбъекта()

Функция СоздатьНашуФабрикуХДТО()
	ЧтениеXML = Новый ЧтениеXML;    
	ЧтениеXML.УстановитьСтроку(ПолучитьОбщийМакет("СхемаОбменаXDTO").ПолучитьТекст());   
	
	ПостроительDOM	= Новый ПостроительDOM;
	ДокументДом		= ПостроительDOM.Прочитать(ЧтениеXML);   
	ЧтениеXML.Закрыть();
	
	ПостроительСхем = Новый ПостроительСхемXML;
	Схема 			= ПостроительСхем.СоздатьСхемуXML(ДокументДом);	
	
	НаборСхем	= Новый НаборСхемXML;	
	НаборСхем.Добавить(Схема);
	
	НаборСхемТекКонф	= ФабрикаXDTO.ЭкспортСхемыXML("http://v8.1c.ru/8.1/data/enterprise/current-config");	
	Для Каждого Схема Из НаборСхемТекКонф Цикл
		НаборСхем.Добавить(Схема);	
	КонецЦикла;	
	
	Возврат Новый ФабрикаXDTO(НаборСхем);
КонецФункции //СоздатьФабрикуХДТО()

Функция СформироватьПакетОбмена(УзелОбмена, ДопПараметры = Неопределено) Экспорт	
	
	Фабрика = СоздатьНашуФабрикуХДТО();
	
	ЗаписьXML = Новый ЗаписьXML;	
	
	ЗаписьXML.УстановитьСтроку("UTF-8");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();	

	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();	
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);	
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", ПространствоИмен());
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");	
	
	// Кельманов А.В. - HELP-7256 - 2025.09.30 {
	//ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Изменения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаданиеНабора.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ЛистМаркировки.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ЛистСборкиКомплектовЧЗ.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ЛистНабора.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ЗаданиеНаАгрегацию.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Документ.ЛистПереукладки.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Единицы.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Цвета.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Размеры.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.ФизическиеЛица.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.ТипыКоробов.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.Склады.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.ШтрихКоды.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Изменения.Ссылка
	               |ИЗ
	               |	Справочник.ПринтерыЭтикеток.Изменения КАК Изменения
	               |ГДЕ
	               |	Изменения.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	Запрос.УстановитьПараметр("НомерСообщения", ЗаписьСообщения.НомерСообщения);
	
	ВыборкаИзменений = Запрос.Выполнить().Выбрать();
	// Кельманов А.В. - HELP-7256 - 2025.09.30 }
	
	// Кухарь А.Ю. 19.02.2021 начало
	//СтруктураДополнительныхДанных=новый Структура;
	ТаблицаДополнительныеРеквизитыТовары = Новый ТаблицаЗначений;
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ВидВладельца");	
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ВладелецРеквизита");	
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("КодНоменклатуры");
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ШККонтрагента");
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ШККонтрагентаДополнительный");
	
	ТаблицаДополнительныеРеквизитыШапки = Новый ТаблицаЗначений;
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ВидВладельца");	
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ВладелецРеквизита");		
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ИмяРеквизита");
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ЗначениеРеквизита");
	//ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("Объект");

	// Кухарь А.Ю. 19.02.2021 конец
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		// Кельманов А.В. - HELP-7256 - 2025.09.30 {
		//Данные = ВыборкаИзменений.Получить();	
		Данные = ВыборкаИзменений.Ссылка.ПолучитьОбъект();	
		// Кельманов А.В. - HELP-7256 - 2025.09.30 }
		
		// Кухарь А.Ю. 19.02.2021 начало
		// Заполним дополнительные свойства
		// Кухарь А.Ю.  13.09.2022 начало
		// Если данные - примитивный тип, то конфигураторная ошибка
		//если Данные.метаданные().имя="ЗаданиеНабора" тогда
		Если ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаданиеНабора") Тогда 
		// Кухарь А.Ю.  13.09.2022 конец
			
			// Кельманов А.В. - Поменял, т.к. тут объект, а не ссылка - 2025.09.16 {
			//Если Ложь Тогда Данные = Документы.ЗаданиеНабора.ПустаяСсылка(); КонецЕсли;
			Если Ложь Тогда Данные = Документы.ЗаданиеНабора.СоздатьДокумент(); КонецЕсли;
			// Кельманов А.В. - Поменял, т.к. тут объект, а не ссылка - 2025.09.16 }
			
			ВидВладельца = Данные.Метаданные().Имя;
			УИД = Строка(Данные.Ссылка.УникальныйИдентификатор());
			
			// Кельманов А.В. - Оптимизация работы - 2025.09.01 {
			//Если КонтролироватьШКПоМатрице(данные.Накладная) тогда
			//	ТЗМатриц=ПолучитьТаблицуМатриц(данные.Накладная);
			Накладная = Данные.Накладная;
			
			Если КонтролироватьШКПоМатрице(Накладная) Тогда
				
				ТЗМатриц = ПолучитьТаблицуМатриц(Накладная);		
			// Кельманов А.В. - Оптимизация работы - 2025.09.01 }
			
				Для Каждого СтрТЧ Из Данные.Товары Цикл
					
					МассМатрицы = ТЗМатриц.НайтиСтроки(Новый Структура("Номенклатура", СтрТЧ.Номенклатура));
					
					Если МассМатрицы.Количество() > 0 Тогда
						
						СтрокаМатрицы = МассМатрицы.Получить(0);
						СтрДопРеквизитов = ТаблицаДополнительныеРеквизитыТовары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрДопРеквизитов, СтрокаМатрицы);
						СтрДопРеквизитов.ВидВладельца = ВидВладельца;
						СтрДопРеквизитов.ВладелецРеквизита = УИД;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;			

			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "НомерНакладной";
			// Кельманов А.В. - Оптимизация работы - 2025.09.01 {
			//СтрокаДопРеквизитов.ЗначениеРеквизита=данные.Накладная.Номер;
			СтрокаДопРеквизитов.ЗначениеРеквизита = Накладная.Номер;
			// Кельманов А.В. - Оптимизация работы - 2025.09.01 }
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			// Кельманов А.В. - HELP-4834 - 2025.09.01 {
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "КонтрагентСтрокой";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(Накладная.Контрагент);
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "ОрганизацияСтрокой";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(Накладная.Организация);
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			// Кельманов А.В. - HELP-4834 - 2025.09.01 }
			
			// Кельманов А.В. - HELP-5128 - 2025.10.03 {
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "ГруппыТоваровВНакладной";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Накладная.ГруппыТоваров;
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "КомментарийВНакладной";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Накладная.Комментарий;
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "ТипШКАгрегацииКонтрагента";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(ПолучитьРеквизитШапки(Накладная.Контрагент, "ТипШКАгрегации", "Справочник"));
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			// Кельманов А.В. - HELP-5128 - 2025.10.03 }
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "КодТСД";
			СтрокаДопРеквизитов.ЗначениеРеквизита = "1234"; //Для теста
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			Если ДопПараметры <> Неопределено Тогда
				
				СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
				СтрокаДопРеквизитов.ИмяРеквизита = "ШтрихКодСпецификации";
				СтрокаДопРеквизитов.ЗначениеРеквизита = ДопПараметры.ШтрихКодСпецификации; 
				СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
				СтрокаДопРеквизитов.ВладелецРеквизита = УИД;
				
			КонецЕсли;
			
		// Кельманов А.В. - SNL-120 - 2026.04.08 {
		ИначеЕсли ДопПараметры <> Неопределено И ДопПараметры.Свойство("ДополнительныеДанныеДляFBS") 
			И ДопПараметры.ДополнительныеДанныеДляFBS = Истина
			И ТипЗнч(Данные) = Тип("ДокументОбъект.ПолныеДанныеЗаданияНабора") Тогда 
			
			Если Ложь Тогда Данные = Документы.ПолныеДанныеЗаданияНабора.СоздатьДокумент(); КонецЕсли;

			ВидВладельца = Данные.Метаданные().Имя;
			УИД = Строка(Данные.Ссылка.УникальныйИдентификатор());

			Накладная = Данные.Накладная;
						
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 {
			РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, 
			"Номер, Организация, Контрагент, ОтгрузкаЗаказовПоЮрЛицу", "Документ");
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 }
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "НомерНакладной";
			
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 {
			//СтрокаДопРеквизитов.ЗначениеРеквизита = Накладная.Номер;
			СтрокаДопРеквизитов.ЗначениеРеквизита = РеквизитыНакладной.Номер;
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 }
			
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "УИДНакладной";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(Накладная.УникальныйИдентификатор());
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "ОрганизацияСтрокой";
			
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 {
			//СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(Накладная.Организация);
			СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(РеквизитыНакладной.Организация);
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 }
			
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			// Кельманов А.В. - Изменение 0000000224 - 2026.07.08 {

			// Кельманов А.В. - Оптимизация работы - 2026.07.14 {
			//Если Накладная.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-4991") И Накладная.ОтгрузкаЗаказовПоЮрЛицу Тогда
			Если РеквизитыНакладной.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-4991") 
				И РеквизитыНакладной.ОтгрузкаЗаказовПоЮрЛицу Тогда
			// Кельманов А.В. - Оптимизация работы - 2026.07.14 }
				
				СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
				СтрокаДопРеквизитов.ИмяРеквизита = "ОповещениеДляПользователя";
				
				СтрокаДопРеквизитов.ЗначениеРеквизита 
				= "Заказ юр.лица - финальная этикетка будет выводиться после перевода РНК в конечное состояние и отправки в ЧЗ марок";
				
				СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
				СтрокаДопРеквизитов.ВладелецРеквизита = УИД;
				
			КонецЕсли;
			// Кельманов А.В. - Изменение 0000000224 - 2026.07.08 }

		ИначеЕсли ДопПараметры <> Неопределено И ДопПараметры.Свойство("ДополнительныеДанныеДляFBS") 
			И ДопПараметры.ДополнительныеДанныеДляFBS = Истина
			И ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаданиеНаСборкуКомплектовЧЗ") Тогда 
			
			Если Ложь Тогда Данные = Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьДокумент(); КонецЕсли;

			ВидВладельца = Данные.Метаданные().Имя;
			УИД = Строка(Данные.Ссылка.УникальныйИдентификатор());

			Накладная = Данные.ДокОснование;
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "НомерНакладной";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Накладная.Номер;
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
			СтрокаДопРеквизитов = ТаблицаДополнительныеРеквизитыШапки.Добавить();
			СтрокаДопРеквизитов.ИмяРеквизита = "УИДНакладной";
			СтрокаДопРеквизитов.ЗначениеРеквизита = Строка(Накладная.УникальныйИдентификатор());
			СтрокаДопРеквизитов.ВидВладельца = ВидВладельца;
			СтрокаДопРеквизитов.ВладелецРеквизита = УИД;	
			
		// Кельманов А.В. - SNL-120 - 2026.04.08 }
		
		// Кельманов А.В. - HELP-7662 - 2025.11.07 {
		ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ЛистПереукладки") Тогда
		
			Накладная = Данные.ДокОснование;
			
			Если Накладная.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-1593") Тогда
				
				ВидВладельца = Данные.Метаданные().Имя;
				УИД = Строка(Данные.Ссылка.УникальныйИдентификатор());
				
				СтруктураДанныхНакладной = Новый Структура("Номенклатура,ПунктДоставки,Договор,Дата,Контрагент,ПостояннаяАкция"); 
				ЗаполнитьЗначенияСвойств(СтруктураДанныхНакладной, Накладная);
				
				Товары = Накладная.Товары.Выгрузить();
				
				СтруктураДанныхНакладной.Номенклатура = Товары.ВыгрузитьКолонку("Номенклатура");
				
				ТаблицаМатриц1 = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанныхНакладной);
				
				Если Накладная.ОтгрузкаКомплектов Тогда
					
					Комплектующие = Накладная.Комплектующие.Выгрузить();
					
					СтруктураДанныхНакладной.Номенклатура = Комплектующие.ВыгрузитьКолонку("Номенклатура");
					
					ТаблицаМатриц2 = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанныхНакладной);
					
					Запрос = Новый Запрос;
					
					Запрос.Текст = "ВЫБРАТЬ
					|	ТаблицаМатриц1.Номенклатура КАК Номенклатура,
					|	ТаблицаМатриц1.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка
					|ПОМЕСТИТЬ ВТ_МатрицаТовары
					|ИЗ
					|	&ТаблицаМатриц1 КАК ТаблицаМатриц1
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТаблицаМатриц2.Номенклатура КАК Номенклатура,
					|	ТаблицаМатриц2.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка
					|ПОМЕСТИТЬ ВТ_МатрицаКомплектующие
					|ИЗ
					|	&ТаблицаМатриц2 КАК ТаблицаМатриц2
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Комплектующие.Номенклатура КАК Номенклатура,
					|	Комплектующие.Продукция КАК Продукция
					|ПОМЕСТИТЬ ВТ_Комплектующие
					|ИЗ
					|	&Комплектующие КАК Комплектующие
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЛистПереукладкиТовары.Номенклатура КАК Номенклатура,
					|	ВТ_МатрицаКомплектующие.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка
					|ПОМЕСТИТЬ ВТ_ПромежуточныйИтог
					|ИЗ
					|	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатрицаКомплектующие КАК ВТ_МатрицаКомплектующие
					|		ПО ЛистПереукладкиТовары.Номенклатура = ВТ_МатрицаКомплектующие.Номенклатура
					|ГДЕ
					|	ЛистПереукладкиТовары.Ссылка = &ЛП
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ПромежуточныйИтог.Номенклатура КАК Номенклатура,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА ВТ_ПромежуточныйИтог.ШККонтрагентаКоробка <> """"
					|					И НЕ ВТ_ПромежуточныйИтог.ШККонтрагентаКоробка ЕСТЬ NULL
					|				ТОГДА ВТ_ПромежуточныйИтог.ШККонтрагентаКоробка
					|			КОГДА ВТ_МатрицаТовары.ШККонтрагентаКоробка <> """"
					|					И НЕ ВТ_МатрицаТовары.ШККонтрагентаКоробка ЕСТЬ NULL
					|				ТОГДА ВТ_МатрицаТовары.ШККонтрагентаКоробка
					|			ИНАЧЕ """"
					|		КОНЕЦ) КАК ШККонтрагентаКоробка
					|ИЗ
					|	ВТ_ПромежуточныйИтог КАК ВТ_ПромежуточныйИтог
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
					|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатрицаТовары КАК ВТ_МатрицаТовары
					|			ПО ВТ_Комплектующие.Продукция = ВТ_МатрицаТовары.Номенклатура
					|		ПО ВТ_ПромежуточныйИтог.Номенклатура = ВТ_Комплектующие.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_ПромежуточныйИтог.Номенклатура";
					
					Запрос.УстановитьПараметр("ЛП", Данные.Ссылка);
					Запрос.УстановитьПараметр("ТаблицаМатриц1", ТаблицаМатриц1);
					Запрос.УстановитьПараметр("ТаблицаМатриц2", ТаблицаМатриц2);
					Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
					
					ТЗ_Матриц = Запрос.Выполнить().Выгрузить();
					
				Иначе
					
					Запрос = Новый Запрос;
					
					Запрос.Текст = "ВЫБРАТЬ
					|	ТаблицаМатриц1.Номенклатура КАК Номенклатура,
					|	ТаблицаМатриц1.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка
					|ПОМЕСТИТЬ ВТ_МатрицаТовары
					|ИЗ
					|	&ТаблицаМатриц1 КАК ТаблицаМатриц1
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЛистПереукладкиТовары.Номенклатура КАК Номенклатура,
					|	МАКСИМУМ(ВТ_МатрицаТовары.ШККонтрагентаКоробка) КАК ШККонтрагентаКоробка
					|ИЗ
					|	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатрицаТовары КАК ВТ_МатрицаТовары
					|		ПО ЛистПереукладкиТовары.Номенклатура = ВТ_МатрицаТовары.Номенклатура
					|ГДЕ
					|	ЛистПереукладкиТовары.Ссылка = &ЛП
					|
					|СГРУППИРОВАТЬ ПО
					|	ЛистПереукладкиТовары.Номенклатура";
					
					Запрос.УстановитьПараметр("ЛП", Данные.Ссылка);
					Запрос.УстановитьПараметр("ТаблицаМатриц1", ТаблицаМатриц1);
					
					ТЗ_Матриц = Запрос.Выполнить().Выгрузить();
					
				КонецЕсли;	
				
				ТаблицаДополнительныеРеквизитыТовары.Колонки.Удалить("ШККонтрагента");
				ТаблицаДополнительныеРеквизитыТовары.Колонки.Удалить("ШККонтрагентаДополнительный");
				ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ШККонтрагентаКоробка");
				
				Для Каждого СтрТЧ Из Данные.Товары Цикл
					
					МассМатрицы = ТЗ_Матриц.НайтиСтроки(Новый Структура("Номенклатура", СтрТЧ.Номенклатура));
					
					Если МассМатрицы.Количество() > 0 Тогда
						
						СтрокаМатрицы = МассМатрицы.Получить(0);
						СтрДопРеквизитов = ТаблицаДополнительныеРеквизитыТовары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрДопРеквизитов, СтрокаМатрицы);
						СтрДопРеквизитов.КодНоменклатуры = СтрТЧ.Номенклатура.Код;
						СтрДопРеквизитов.ВидВладельца = ВидВладельца;
						СтрДопРеквизитов.ВладелецРеквизита = УИД;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;	
		// Кельманов А.В. - HELP-7662 - 2025.11.07 } 
		
		КонецЕсли;		
		// Кухарь А.Ю. 19.02.2021 конец

		// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных.		
		Если Не НуженПереносДанных(Данные, УзелОбмена) Тогда			
			// Получаем значение с возможным удалением данных.		
			УдалениеДанных(Данные);			
		КонецЕсли;		
		
		// Записываем данные в сообщение		
		ЗаписатьДанные(ЗаписьXML, Фабрика, Данные);
		
	КонецЦикла;	

	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблицаДополнительныеРеквизитыШапки");   
	
	Для Каждого СтрТЗ Из ТаблицаДополнительныеРеквизитыШапки Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТаблицы");
		
		Для Каждого Колонка Из ТаблицаДополнительныеРеквизитыШапки.Колонки Цикл
			ЗаписьXML.ЗаписатьАтрибут(Колонка.Имя, СтрТЗ[Колонка.Имя]);
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("ТаблицаДополнительныеРеквизитыТовары");
	
	Для Каждого СтрТЗ Из ТаблицаДополнительныеРеквизитыТовары Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаТаблицы");
		
		Для Каждого Колонка Из ТаблицаДополнительныеРеквизитыТовары.Колонки Цикл
			ЗаписьXML.ЗаписатьАтрибут(Колонка.Имя, СтрТЗ[Колонка.Имя]);
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	// Кухарь А.Ю. 19.02.2021 конец

	ЗаписьСообщения.ЗакончитьЗапись();	

	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));	
	
КонецФункции

Функция НуженПереносДанных(Данные, УзелОбмена) Экспорт	
	Перенос = Истина;	
	Если 		ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаданиеНабора") Тогда
		
	ИначеЕсли 	ТипЗнч(Данные) = Тип("СправочникОбъект.Пользователи") Тогда
		
	ИначеЕсли 	ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") Тогда
		
	КонецЕсли;
	
	Возврат Перенос;	
КонецФункции

Процедура УдалениеДанных(Данные) Экспорт
	// Получаем объект описания метаданного, соответствующий данным.	
	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		// Перенос удаления объекта для объектных.		
		Данные = Новый УдалениеОбъекта(Данные.Ссылка);
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		// Очищаем данные.
		Данные.Очистить();
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаписатьДанные(ЗаписьXML, Фабрика, Данные) Экспорт	
	мТипОбъекта=_ТипОбъекта(Данные);
	Если мТипОбъекта = "Справочник" Тогда
		ЗаписатьСправочник(ЗаписьXML,Фабрика,Данные);
	ИначеЕсли мТипОбъекта = "Документ" Тогда		
		ЗаписатьДокумент(ЗаписьXML,Фабрика,Данные);	
	КонецЕсли	
КонецПроцедуры

Процедура ЗаписатьСправочник(ЗаписьXML,Фабрика,Объект)
	Если Объект=Неопределено Тогда Возврат КонецЕсли;
	
	//ЗаписатьВЛог("Отладка",""+Объект.Код+" "+Объект,"Информация");
	//ЗаписатьВЛог("Отладка",""+ТипЗнч(Объект)+" "+Объект,"Информация");
	//Кухарь 14.08.19 начало	
	МетаОбъект=Объект.Метаданные();
	МетаОбъектСтрока=МетаОбъект.имя;
	СтрокаИсключаемыхПараметровЭлемент=Неопределено;
	СтрокаИсключаемыхПараметровГруппа=Неопределено;
	СтрокаЗаполняемыхПараметровЭлемент=Неопределено;
	СтрокаЗаполняемыхПараметровГруппа=Неопределено;
	СтрокаЗаполняемыхПараметровГруппа="Ссылка,Код,Наименование,ЭтоГруппа,ПометкаУдаления,Родитель";
	если МетаОбъектСтрока="Номенклатура" тогда
		// Кельманов А.В. - ASU-1746 - 2025.02.19 {
		//СтрокаЗаполняемыхПараметровГруппа=СтрокаЗаполняемыхПараметровГруппа+",ШтукВКоробке,ШтукВКоробочке";
		
		// Кельманов А.В. - HELP-3228 - 2025.03.12 {
		//СтрокаЗаполняемыхПараметровГруппа=СтрокаЗаполняемыхПараметровГруппа+",ШтукВКоробке,ШтукВКоробочке,КодПроизводителя";
		СтрокаЗаполняемыхПараметровГруппа=СтрокаЗаполняемыхПараметровГруппа+",ШтукВКоробке,ШтукВКоробочке,КодПроизводителя,ВидНоменклатуры";
		// Кельманов А.В. - HELP-3228 - 2025.03.12 }
		
		// Кельманов А.В. - ASU-1746 - 2025.02.19 }
		СтрокаИсключаемыхПараметровЭлемент="ШтукВКоробке,ШтукВКоробочке";
	ИначеЕсли МетаОбъектСтрока="ФизическиеЛица" тогда
		СтрокаИсключаемыхПараметровГруппа="ШтрихКод";		
	КонецЕсли;
	//Кухарь 14.08.19 конец
	
	
	ТипXDTO	= Фабрика.Тип(ПространствоИмен(),"СправочникОбъект."+МетаОбъект.Имя);
	Если ТипXDTO=Неопределено Тогда
		Сообщить("Не найден тип XDTO: "+МетаОбъект.Имя);
		Возврат;	
	КонецЕсли; 
	
	ЭлементXDTO	= Фабрика.Создать(ТипXDTO);		
	//Кухарь 14.08.19 начало	
	//Если Объект.ЭтоГруппа Тогда
	//	ЗаполнитьЗначенияСвойств(ЭлементXDTO,Объект,"Ссылка,Код,Наименование,ЭтоГруппа,ПометкаУдаления,Родитель");
	//Иначе
	//	ЗаполнитьЗначенияСвойств(ЭлементXDTO,Объект,,);
	//КонецЕсли;	
	Если Объект.ЭтоГруппа Тогда
		ЗаполнитьЗначенияСвойств(ЭлементXDTO,Объект,СтрокаЗаполняемыхПараметровГруппа,СтрокаИсключаемыхПараметровГруппа);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭлементXDTO,Объект,СтрокаЗаполняемыхПараметровЭлемент,СтрокаИсключаемыхПараметровЭлемент);
	КонецЕсли;		
	//Кухарь 14.08.19 конец
	
	Фабрика.ЗаписатьXML(ЗаписьXML,ЭлементXDTO,,ПространствоИмен(),,НазначениеТипаXML.Явное);
	
	Если МетаОбъект.Иерархический И ЗначениеЗаполнено(Объект.Родитель) Тогда
		ЗаписатьСправочник(ЗаписьXML,Фабрика,Объект.Родитель.ПолучитьОбъект());	
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаписатьДокумент(ЗаписьXML,Фабрика,Объект)
	МетаОбъект=Объект.Метаданные();
	
	ОбъектXDTO	= Фабрика.Создать(Фабрика.Тип(ПространствоИмен(),"ДокументОбъект."+МетаОбъект.Имя));			
	
	ЗаполнитьЗначенияСвойств(ОбъектXDTO,Объект);	
	Для Каждого МетаТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		СвойствоXDTO=ОбъектXDTO.Свойства().Получить(МетаТЧ.Имя);
		Если СвойствоXDTO<>Неопределено Тогда					
			ТЧТчXDTO=ОбъектXDTO[МетаТЧ.Имя];
			Для Каждого СтрокаТЧ Из Объект[МетаТЧ.Имя] Цикл
				СтрокаТчXDTO	= Фабрика.Создать(Фабрика.Тип(ПространствоИмен(),"ДокументСтрокаТЧ."+МетаОбъект.Имя+"."+МетаТЧ.Имя));
				ЗаполнитьЗначенияСвойств(СтрокаТчXDTO,СтрокаТЧ);			
				ТЧТчXDTO.Добавить(СтрокаТчXDTO);					
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;		
	
	Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектXDTO,,,,НазначениеТипаXML.Явное);	
КонецПроцедуры


// Кельманов А.В. - ASU-1695 - 2025.01.22 {
//// Кухарь А.Ю.  06.08.2022 начало
//// Функция ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена, ДопПараметры=Неопределено,ТекстОшибки="") Экспорт
//Функция ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена, ДопПараметры = Неопределено, ТекстОшибки = "", ТекстОповещения = "") Экспорт
//// Кухарь А.Ю.  06.08.2022 конец
Функция ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена, ДопПараметры = Неопределено, ТекстОшибки = "", ТекстОповещения = "", МассивОбъектовСОшибками = Неопределено) Экспорт
	
	ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("ОбменСТСД.ПринятьПакетОбмена");	
	
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());	
	
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();	
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	// Кухарь А.Ю.  03.09.2025 начало
	// Блокируется план обмена. Но если совсем чтение не начинать, то кривая XML
	//Отправитель = ЧтениеСообщения.Отправитель; 
	//ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);          
	ЧтениеСообщения.ПрерватьЧтение();
	Отправитель = УзелОбмена;            
	ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель);
	// Кухарь А.Ю.  03.09.2025 конец

	Фабрика = СоздатьНашуФабрикуХДТО();

	ЗНБ = Неопределено; 
	КоличествоЗагружаемыхОбъектов = 0;
	
	// Кухарь А.Ю.  30.06.2025 начало 
	//НачатьТранзакцию();
	если ТипЗнч(ДопПараметры) = тип("Структура") 
		и ДопПараметры.Свойство("ВидВыгрузки") 
		и ДопПараметры.ВидВыгрузки = "ЛистыСАгрегациями" тогда 
		НужнаТранзакция = ложь;    
		ПроверятьЗНБ = ложь;
	иначе     
		НужнаТранзакция = Истина; 
		ПроверятьЗНБ = Истина;
	КонецЕсли;
	
	если НужнаТранзакция тогда 
		НачатьТранзакцию();
	КонецЕсли;	
	// Кухарь А.Ю.  30.06.2025 конец

	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл	
		
		Данные = ПрочитатьДанные(ЧтениеXML, Фабрика);

		Если Данные = Неопределено Тогда 
			Продолжить; 
		КонецЕсли;
		
		Если ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаданиеНабора") Тогда
			
			ЗНБ = Данные.Ссылка;
			
			Продолжить;
			
		КонецЕсли;		 

		Если Не ПринятьИзменения(Отправитель, Данные, ТекстОшибки) Тогда 
			Продолжить; 
		КонецЕсли;

		Данные.ОбменДанными.Отправитель = Отправитель;
		Данные.ОбменДанными.Загрузка = Истина;    
		
		если ТипЗнч(Данные)=Тип("ДокументОбъект.ЛистПереукладки") или
			ТипЗнч(Данные)=Тип("ДокументОбъект.ЛистНабора")
			тогда      
			Данные.УзелТСД = УзелОбмена;
		КонецЕсли;

		// Кельманов А.В. - SNL-187 - 2026.04.21 {
		Если ТипЗнч(Данные) = Тип("ДокументОбъект.ЛистПереукладки")
			И ТипЗнч(ДопПараметры) = Тип("Структура") 
			И ДопПараметры.Свойство("ДанныеТекущаяБригада") Тогда
			
			МассивТекущаяБригада = Десериализовать(Десериализовать(ДопПараметры.ДанныеТекущаяБригада).Получить());
			
			Данные.Бригада.Очистить();
			
			Если МассивТекущаяБригада <> Неопределено Тогда
				
				Для Каждого Сотрудник Из МассивТекущаяБригада Цикл
					
					СтрБригада = Данные.Бригада.Добавить();
					
					СтрБригада.Сотрудник = Сотрудник;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЕсли;
		// Кельманов А.В. - SNL-187 - 2026.04.21 }
		
		Попытка  
			// Кухарь А.Ю.  03.07.2025 начало
			// Данные.Записать();				 			
			если ТипЗнч(Данные)=Тип("ДокументОбъект.ЛистПереукладки") тогда   
				Данные.ПростоЗаписать();	
			иначе		
				Данные.Записать();			
			КонецЕсли;		
			// Кухарь А.Ю.  03.07.2025 конец
			
		Исключение
			
			Инфо = ИнформацияОбОшибке();
			ТекстОшибки = ТекстОшибки + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(Инфо);
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			Возврат Истина;
			
		КонецПопытки;	

		КоличествоЗагружаемыхОбъектов = КоличествоЗагружаемыхОбъектов + 1;
		
	КонецЦикла;	

	// Кельманов А.В. - HELP-7030 - 2025.09.16 {
	//Если КоличествоЗагружаемыхОбъектов > 0 Тогда
    //
	//	Если ЗначениеЗаполнено(ЗНБ)  Тогда
	//		// Кельманов А.В. - ASU-1695 - 2025.01.22 {
	//		СтатусыКодовПроверены = Документы.ЗаданиеНабора.ПроверитьСтатусыКодовЧЗВЛН(ЗНБ, ТекстОшибки, МассивОбъектовСОшибками);
	//		
	//		Если Не СтатусыКодовПроверены Тогда
	//			
	//			ОтменитьТранзакцию();
	//			
	//		КонецЕсли;
	//		
	//		НетДублейКодовСУчетомВложенных = Документы.ЗаданиеНабора.ПроверитьДублиКодовЧЗВЛН_СУчетомВложенных(ЗНБ, ТекстОшибки, МассивОбъектовСОшибками);
	//		
	//		Если Не НетДублейКодовСУчетомВложенных Тогда
	//			
	//			ОтменитьТранзакцию();
	//			
	//		КонецЕсли;
	//		
	//		РезультатПроверкиУспех = Документы.ЗаданиеНабора.КонтрольКорректностиСканированияЧЗВЛЗ_ПоВсемЛН(ЗНБ, ТекстОшибки, МассивОбъектовСОшибками);
	//		
	//		Если Не РезультатПроверкиУспех Тогда
	//			
	//			ОтменитьТранзакцию();
	//			
	//		КонецЕсли;
    //
	//		Если ТранзакцияАктивна() Тогда
	//			ЗафиксироватьТранзакцию();
	//		КонецЕсли;	
    //
	//		Документы.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ, ТекстОшибки, ТекстОповещения);
    //
	//	Иначе
	//		
	//		// Кухарь А.Ю.  30.06.2025 начало
	//		// Пустая задача   
	//		//			ЗаписатьВЛог("Отладка", "Не определился ЗНБ", "Важное");
	//		//ОтменитьТранзакцию();		
	//		если ПроверятьЗНБ тогда
	//			ЗаписатьВЛог("Отладка", "Не определился ЗНБ", "Важное");
	//			ОтменитьТранзакцию();
	//		КонецЕсли;	
	//		// Кухарь А.Ю.  30.06.2025 конец					
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//// Кухарь А.Ю. 07.04.2022 конец
	Если ЗначениеЗаполнено(ЗНБ)  Тогда
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;	
		
		ЛНУжеВыгружались = ОбщегоНазначения_ПИ.ЗНБУжеЗагружен(ЗНБ);
		
		
		Если ЛНУжеВыгружались Тогда
			
			ТекстОшибки = "ЗНБ уже выгружался из ТСД в 1С.";
			
		Иначе	
			
			// Кельманов А.В. - SNL-169 - 2026.03.18 {
			//РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(ЗНБ, "СостояниеНакладной", "Документ");
			РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(ЗНБ, "СостояниеНакладной, Накладная", "Документ");
			// Кельманов А.В. - SNL-169 - 2026.03.18 }
												
			СостояниеЗНБ = РеквизитыШапкиЗНБ.СостояниеНакладной;
			
			Если СостояниеЗНБ <> Перечисления.СостоянияНакладной.ВНаборе И СостояниеЗНБ <> Перечисления.СостоянияНакладной.ОжиданиеСканирования  
				И СостояниеЗНБ <> Перечисления.СостоянияНакладной.Сканирование Тогда
				
				ТекстОшибки = "Состояние ЗНБ: " + СостояниеЗНБ + ". Нельзя выгружать ЗНБ в базу склада.";
				
			Иначе
				
				// Кельманов А.В. - HELP-9378 - 2026.04.07 {
				Наборщик = Неопределено;
				
				Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ШКСотрудника") Тогда
					
					Наборщик = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ШтрихКод", ДопПараметры.ШКСотрудника);
					
				КонецЕсли;
				// Кельманов А.В. - HELP-9378 - 2026.04.07 }
				
				// Кельманов А.В. - SNL-169 - 2026.03.18 {
				// если нужно ЧАСТИЧНО ЗАВЕРШИТЬ ЗНБ
				Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ШКЗоныХранения") Тогда
					
					//Тимофеев Ю.А. 30.03.2026 Частичное завершение ЗНБ  NL-86 
					
					// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
					//Если ADRESS.ПолучитьРасхожденияЛистовНабораИЗНБ(ЗНБ) Тогда
					ТекстОшибкиПриЧастичномЗавершении = "";
					
					Если ADRESS.ПолучитьРасхожденияЛистовНабораИЗНБ(ЗНБ, ТекстОшибкиПриЧастичномЗавершении) Тогда 
					// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
						
						//сохраним крайнее место хранения собранного товара в регистр
						
						ЗонаХранения = Справочники.ЗоныХранения.НайтиПоРеквизиту("ШтрихКод", ДопПараметры.ШКЗоныХранения);
						
						Если ЗначениеЗаполнено(ЗонаХранения) Тогда
							
							ЗаписатьЗначениеВРеквизитыДокументов(ЗонаХранения, РеквизитыШапкиЗНБ.Накладная, "ЗонаХранения");
							
						Иначе
							
							ЗаписатьЗначениеВРеквизитыДокументов(ДопПараметры.ШКЗоныХранения, РеквизитыШапкиЗНБ.Накладная, "ЗонаХранения");
							
						КонецЕсли;

						// Кельманов А.В. - HELP-9378 - 2026.04.07 {
						//Документы.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ, ТекстОшибки, ТекстОповещения);
						Документы.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ, ТекстОшибки, ТекстОповещения, Наборщик);
						// Кельманов А.В. - HELP-9378 - 2026.04.07 }
						
					Иначе	
						
						ТекстОшибки = "ЗНБ частично завершить не удалось. Продолжите набор";
						
						// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
						Если ЗначениеЗаполнено(ТекстОшибкиПриЧастичномЗавершении) Тогда
							
							ТекстОшибки = ТекстОшибки + Символы.ПС + "Комментарий: " + ТекстОшибкиПриЧастичномЗавершении;
							
						КонецЕсли;
						// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
						
					КонецЕсли;
					
				Иначе
					
					// Кельманов А.В. - HELP-9378 - 2026.04.07 {
					//Документы.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ, ТекстОшибки, ТекстОповещения);
					Документы.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ, ТекстОшибки, ТекстОповещения, Наборщик);
					// Кельманов А.В. - HELP-9378 - 2026.04.07 }
					
				КонецЕсли;	    				
				// Кельманов А.В. - SNL-169 - 2026.03.18 }
                								
			КонецЕсли;		

		КонецЕсли;

		
	Иначе
		
		Если ПроверятьЗНБ Тогда
			
			ЗаписатьВЛог("Отладка", "Не определился ЗНБ", "Важное");
			ОтменитьТранзакцию();
			
		КонецЕсли;	
		
	КонецЕсли;
	// Кельманов А.В. - HELP-7030 - 2025.09.16 }	
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;	
	
	// Кухарь А.Ю.  03.09.2025 начало
	//ЧтениеСообщения.ЗакончитьЧтение(); 
	// Кухарь А.Ю.  03.09.2025 конец
	
	ЧтениеXML.Закрыть();	
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);	
	
	Возврат Истина;
	
КонецФункции

// Кельманов А.В. - SNL-187 - 2026.04.21
Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();  
	Возврат ТЗ;
КонецФункции

Функция ВозможностьЧтенияДанных(ЧтениеXML) Экспорт
	
	// Получаем тип данных XML, который может быть считан в данный момент.	
	ТипXML = ПолучитьXMLТип(ЧтениеXML);	
	Если ТипXML = Неопределено Тогда Возврат Ложь КонецЕсли;
	
	Если (ТипXML.ИмяТипа = "DocumentObject.ЗаданиеНабора.Вручную" И ТипXML.URIПространстваИмен = "") Тогда
		Возврат Истина;		
	КонецЕсли;	
	
	Возврат ВозможностьЧтенияXML(ЧтениеXML);	
КонецФункции

Функция ПринятьИзменения(Отправитель, Данные, Ошибки="") Экспорт	
	Прием = Истина;
	
	// Кельманов А.В. - HELP-6984 - 2025.09.11 {
	//Если ПланыОбмена.ИзменениеЗарегистрировано(Отправитель, Данные) Тогда		
	// Кельманов А.В. - HELP-6984 - 2025.09.11 }
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") ИЛИ ТипЗнч(Данные) = Тип("СправочникОбъект.Склады") Тогда			
		Прием = Ложь;			
	КонецЕсли;	
	
	// Кельманов А.В. - HELP-6984 - 2025.09.11 {
	//КонецЕсли;	
	// Кельманов А.В. - HELP-6984 - 2025.09.11 }
	
	// Кухарь А.Ю. 09.06.2021 начало
	// Запрет повторной загрузки
	если  ТипЗнч(Данные) = Тип("ДокументОбъект.ЛистНабора") тогда
		ДокОснование=Данные.ДокОснование;
		если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаданиеНабора")  тогда
			
			ЗНБ=ДокОснование;
			
			//Кухарь 19.01.2021 начало
			//ЗаписатьВЛог("Отладка","ЗНБ из док. основания "+ ЗНБ.Номер + " Дата ЛН "+Строка(данные.дата),"Информация");
			
		ИначеЕсли Данные.ЗаданияНабора.количество()>0 тогда
			ЗНБ=Данные.ЗаданияНабора.получить(0);
			
			
			//Кухарь 19.01.2021 начало
			//ЗаписатьВЛог("Отладка","ЗНБ из ТЧ ЛН "+ ЗНБ.Номер + " Дата ЛН "+Строка(данные.дата),"Информация");
			
		иначе
			ЗНБ=документы.ЗаданиеНабора.ПустаяСсылка();
			
			//Кухарь 19.01.2021 начало
			//ЗаписатьВЛог("Отладка","Пустой ЗНБ "+ ЗНБ.Номер + " Дата ЛН "+Строка(данные.дата),"Информация");
			
		КонецЕсли;
		
		
		// Кухарь А.Ю.  08.08.2023 начало
		РеквизитыДокументов=ПолучитьРеквизитыШапки(ЗНБ,"СостояниеНакладной","Документ"); 
		// Кухарь А.Ю.  08.08.2023 конец
		
		
		
		
		ЛНУжеВыгружались=ОбщегоНазначения_ПИ.ЗНБУжеЗагружен(ЗНБ);
		если ЛНУжеВыгружались тогда
			
			//Кухарь 19.01.2021 начало
			//ЗаписатьВЛог("Отладка","ЛНУжеВыгружались"+ ЗНБ.Номер,"Информация");
			
			// Кухарь А.Ю. 11.04.2022 начало
			//
			ТекстТекущейОшибки=" ЗНБ уже выгружался из ТСД в 1С.";
			если СтрНайти(Ошибки,ТекстТекущейОшибки)=0 тогда
				Ошибки=Ошибки+ТекстТекущейОшибки; 
			КонецЕсли;
			// Кухарь А.Ю. 11.04.2022 конец
			
			Прием=Ложь;
		КонецЕсли;	
		// Кухарь А.Ю. 30.07.2021 начало
		// Чтобы не грузить пустые ЛН если они вдруг появятся
		
		
		// Кухарь А.Ю.  08.08.2023 начало
		если Прием тогда
			СостояниеЗНБ=РеквизитыДокументов.СостояниеНакладной;
			если СостояниеЗНБ=Перечисления.СостоянияНакладной.ВНаборе или  СостояниеЗНБ=Перечисления.СостоянияНакладной.ОжиданиеСканирования  
				или  СостояниеЗНБ=Перечисления.СостоянияНакладной.Сканирование 
				тогда
			иначе	
				ТекстТекущейОшибки=" с ЗНБ уже начали работу без ТСД";
				если СтрНайти(Ошибки,ТекстТекущейОшибки)=0 тогда
					Ошибки=Ошибки+ТекстТекущейОшибки; 
				КонецЕсли;
				Прием=Ложь;
			КонецЕсли;		
		КонецЕсли;
		// Кухарь А.Ю.  08.08.2023 конец
		
		
		если Данные.товары.итог("Количество") = 0 тогда
			
			//Кухарь 19.01.2021 начало
			//ЗаписатьВЛог("Отладка","Пустое количество документа"+ТипЗнч(Данные)+" "+Данные,"Информация");
			Прием=Ложь;
		КонецЕсли;		 
		// Кухарь А.Ю. 30.07.2021 конец
		
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаданиеНабора") тогда
		Прием=Ложь;
	КонецЕсли;
	// Кухарь А.Ю. 09.06.2021 конец
	
	
	Возврат Прием;	
КонецФункции

Функция ПрочитатьДанные(ЧтениеXML,Фабрика) Экспорт
	ТипВид=ПолучитьТипВидОбъекта(ЧтениеXML);
	Тип=ТипВид.Тип;
	Вид=ТипВид.Вид;
	ОбъектXDTO		= Фабрика.ПрочитатьXML(ЧтениеXML);    
	
	Если Тип="СправочникОбъект" Тогда
		
		// Кухарь А.Ю. 16.02.2021 начало
		//Возврат ЗагрузитьСправочник(ОбъектXDTO,Вид);
		//Справочники в базу склада мы не будем грузить
		возврат Неопределено; 
		// Кухарь А.Ю. 16.02.2021 конец
		
	ИначеЕсли Тип="ДокументОбъект" Тогда
		Возврат ЗагрузитьДокумент(ОбъектXDTO,Вид);			
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции // ПрочитатьДанные(ЧтениеXML)

Функция ПолучитьТипВидОбъекта(ЧтениеXML)
	ТипXML		= ПолучитьXMLТип(ЧтениеXML);
	ЧастиТипа	= СтрРазделить(ТипXML.ИмяТипа,".");
	
	Если ЧастиТипа.Количество()>1 Тогда
		Тип=ЧастиТипа[0];
		Вид=ЧастиТипа[1];
	Иначе
		Тип="";Вид="";		
	КонецЕсли; 
	
	Возврат Новый Структура("Тип,Вид",Тип,Вид);
КонецФункции // ()

Функция ЗагрузитьСправочник(ОбъектXDTO,Вид)
	МетаОбъект=Метаданные.Справочники[Вид];
	Если ОбъектСуществует(ОбъектXDTO.Ссылка,"Справочник."+Вид) Тогда
		Объект=ОбъектXDTO.Ссылка.ПолучитьОбъект();
	Иначе		
		Если МетаОбъект.Иерархический И МетаОбъект.ВидИерархии=Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда					
			ЭтоГруппа=ОбъектXDTO.ЭтоГруппа;			
		Иначе
			ЭтоГруппа=Ложь;
		КонецЕсли;		
		
		Объект=?(ЭтоГруппа,Справочники[Вид].СоздатьГруппу(),Справочники[Вид].СоздатьЭлемент());		
		Объект.УстановитьСсылкуНового(ОбъектXDTO.Ссылка);
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Объект,ОбъектXDTO);
	
	Возврат Объект;
КонецФункции

Функция ЗагрузитьДокумент(ОбъектXDTO,Вид)
	МетаОбъект=Метаданные.Документы[Вид];     
	//попытка
		Если ОбъектСуществует(ОбъектXDTO.Ссылка,"Документ."+Вид) Тогда
			Объект=ОбъектXDTO.Ссылка.ПолучитьОбъект();
		Иначе		
			Объект=Документы[Вид].СоздатьДокумент();		
			Объект.УстановитьСсылкуНового(ОбъектXDTO.Ссылка);
		КонецЕсли; 
	//Исключение
	//	ошибка = ОписаниеОшибки();
	//КонецПопытки;
	ЗаполнитьЗначенияСвойств(Объект,ОбъектXDTO);
	
	Для Каждого МетаТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		СвойствоXDTO=ОбъектXDTO.Свойства().Получить(МетаТЧ.Имя);
		Если СвойствоXDTO<>Неопределено Тогда		
			ТЧТчXDTO	=ОбъектXDTO[МетаТЧ.Имя];
			Если ТЧТчXDTO<>Неопределено Тогда
				ТабЧасть=Объект[МетаТЧ.Имя];
				ТабЧасть.Очистить();
				Для Каждого СтрокаТчXDTO Из ТЧТчXDTO Цикл
					СтрокаТЧ=ТабЧасть.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТчXDTO);		
				КонецЦикла;		
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Объект;	
КонецФункции

Функция ОбъектСуществует(Ссылка,Таблица)
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 ВерсияДанных
	|
	|ИЗ "+Таблица+"
	|ГДЕ Ссылка=&Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВерсияДанных));
КонецФункции //ОбъектСуществует(Ссылка,Таблица)

Функция ПолучитьУзелЦБ()
	Выборка=ПланыОбмена.МобильныеТСД.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ЭтотУзел Тогда Возврат Выборка.Ссылка КонецЕсли;	
	КонецЦикла;
	
	Возврат ПланыОбмена.МобильныеТСД.ПустаяСсылка();
КонецФункции // ()

Функция ВыполнитьОбменДанными(ТекстОшибки) Экспорт	
	УзелЦБ	= ПолучитьУзелЦБ();	
	КодЦБ	= УзелЦБ.Код;
	
	Прокси = ПолучитьПрокси(ТекстОшибки);	
	Если Прокси = Неопределено Тогда Возврат Ложь КонецЕсли;	
	
	Узел = ПланыОбмена.МобильныеТСД.ЭтотУзел();
	
	// Инициализируем обмен с центральной базой.
	//Всё перенёс в ПолучитьДанные()
	//КодУзла = Прокси.НачатьОбмен(Узел.Код, УзелЦБ.НомерПринятого, УзелЦБ.НомерОтправленного);	
	//Если КодУзла = "" Тогда		
	//	ТекстОшибки = "Узел с кодом " + Узел.Код + " не найден!";		
	//	Возврат Ложь;	
	//КонецЕсли;	
	
	// Принимаем данные	
	ДанныеОбмена = Прокси.ПолучитьДанные(Узел.Код, УзелЦБ.НомерПринятого, УзелЦБ.НомерОтправленного);	
	ПринятьПакетОбмена(УзелЦБ, ДанныеОбмена);
	
	// Отправляем данные.	
	ДанныеОбмена = ОбменСТСД.СформироватьПакетОбмена(УзелЦБ);
	Прокси.ЗаписатьДанные(Узел.Код, ДанныеОбмена);	
	
	Возврат Истина;	
КонецФункции

Функция ПолучитьПрокси(ТекстОшибки) Экспорт		
	ТекстОшибки = "";	
	
	УзелЦБ=ПолучитьУзелЦБ();
	
	Адрес = УзелЦБ.АдресОбмена;	
	Адрес = Адрес + "/ws/wsExchangeTSD.1cws?wsdl";	
	
	Пользователь="Администратор";
	
	
	Попытка		
		Определения = Новый WSОпределения(Адрес,УзелЦБ.Пользователь,УзелЦБ.Пароль, 60);		
	Исключение
		// Сообщим пользователю о том, что не получилось получить определение сервиса.		
		ТекстОшибки = "Не удалось установить соединение с сервером. Повторите попытку позже.";		
		Возврат Неопределено;		
	КонецПопытки;	
	
	URI				 	= URIПространстваИменСервиса();	
	Прокси 				= Новый WSПрокси(Определения, URI, "ОбменСТСД", "ОбменСТСДSoap");	
	Прокси.Пользователь	= УзелЦБ.Пользователь;
	Прокси.Пароль		= УзелЦБ.Пароль;
	
	Возврат Прокси;	
КонецФункции

//Кухарь 06.08.19 начало
Функция ЗарегистрироватьЗаданиеНаНаборПоШК(Узел, ШтрихКод, Ошибки = "", СтруктураДопПараметров) Экспорт 
	
	// Кухарь А.Ю.  24.03.2023 начало
	// ЗаданиеПоШК=ПолучитьЗаданиеПоШК(ШтрихКод);
	ПолныеДанные = Неопределено;
	
	Если СтрДлина(ШтрихКод) < 15 И Лев(ШтрихКод, 1) = "*" Тогда
		
		СтруктураВозврата = ПолучитьЗаданиеИПолныеДанныеЗаданияНабораQRWB(ШтрихКод);
		
		Если СтруктураВозврата <> Неопределено Тогда
			
			ЗаданиеПоШК = СтруктураВозврата.Задание;
			ПолныеДанные = СтруктураВозврата.ПолныеДанные;
			
		Иначе
			
			ЗаданиеПоШК = Неопределено;
			
		КонецЕсли;	
		
	Иначе
		
		ЗаданиеПоШК = ПолучитьЗаданиеПоШК(ШтрихКод);
		
		//Кухарь 03.06.2024 начало
		ПолныеДанные = Документы.ПолныеДанныеЗаданияНабора.ПолучитьДокументПоЗНБ(ЗаданиеПоШК);
		//Кухарь 03.06.2024 конец
		
	КонецЕсли;
	// Кухарь А.Ю.  24.03.2023 конец
	
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 {
	Если ЗаданиеПоШК = Неопределено Тогда
		
		Ошибки = "Не найдено задание по ШК"; 
		
		Возврат Ложь;
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 }
	
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
	Накладная = ПолучитьРеквизитШапки(ЗаданиеПоШК, "Накладная", "Документ");
	
	Если НужноОбновитьНакладнуюПоЗаказу(Накладная) Тогда
		
		Ошибки = "ЗНБ изменился из-за вычерка, требуется перепечатать"; 
		
		Возврат Ложь;
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }

	// Кельманов А.В. - SNL-119 - 2026.03.22 {

	// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
	//ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(ЗаданиеПоШК.Накладная);
	ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Накладная);
	// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
	
	Если ИспользоватьЛНТолькоДляНабора Тогда
		
		ПолныеДанные = Неопределено;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-119 - 2026.03.22 }
	
	// Кельманов А.В. - HELP-8294 - 2025.12.24 {

	// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
	//ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ЗаданиеПоШК.Накладная);
	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
	
	// Кельманов А.В. - SNL-119 - 2026.03.22 {
	//Если ДопПараметрыНакладной.ОтгрузкаFBS = Истина И ПолныеДанные = Неопределено Тогда
	Если Не ИспользоватьЛНТолькоДляНабора И ДопПараметрыНакладной.ОтгрузкаFBS = Истина И ПолныеДанные = Неопределено Тогда
	// Кельманов А.В. - SNL-119 - 2026.03.22 }
		
		Ошибки = "Не создан документ Полные данные задания набора для накладной FBS!";
		
		Возврат Ложь;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-8294 - 2025.12.24 }
	
	// Кельманов А.В. - MARK-766 - 2025.01.28 {
	ЗСБЧЗ = Неопределено;
	
	ЛМ = Неопределено; // Кельманов А.В. - Оптимизация работы - 2025.04.01
	
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 {
	//Если ЗаданиеПоШК <> Неопределено И ПолныеДанные <> Неопределено Тогда
	Если ПолныеДанные <> Неопределено Тогда
		// Кельманов А.В. - Оптимизация работы - 2025.12.24 }
		
		// Кельманов А.В. - Исправление ошибки - 2025.05.29 {
		Если ЗаданиеПоШК.ТребуетсяМаркировка Тогда
			// Кельманов А.В. - Исправление ошибки - 2025.05.29 }
			
			Если ПолныеДанные.ОтгрузкаКомплектов Тогда
				
				// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
				//ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(ЗаданиеПоШК.Накладная);
				ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(Накладная);
				// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
				
				// Кельманов А.В. - HELP-4180 - 2025.05.06 {
				Если Не ЗначениеЗаполнено(ЗСБЧЗ) Тогда
					
					// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
					//СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(ЗаданиеПоШК.Накладная, , Истина);
					СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(Накладная, , Истина);
					// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
					
					Если Не СтруктураОтвета.Успех Тогда
						
						Ошибки = СтруктураОтвета.Ошибки;
						
						Возврат Ложь;
						
					Иначе
						
						// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
						//ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(ЗаданиеПоШК.Накладная);
						ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(Накладная);
						// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
						
					КонецЕсли;
					
				КонецЕсли;
				// Кельманов А.В. - HELP-4180 - 2025.05.06 }
				
				// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
				//ТекстОшибки = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ПроверитьЗСБЧЗ(ЗСБЧЗ, ЗаданиеПоШК.Накладная);
				ТекстОшибки = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ПроверитьЗСБЧЗ(ЗСБЧЗ, Накладная);
				// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
				
				Если ТекстОшибки <> "" Тогда
					
					Ошибки = ТекстОшибки;
					
					Возврат Ложь;
					
				КонецЕсли;
				
				// Кельманов А.В. - ASU-2094 - 2025.03.13 {
			Иначе
				
				ЛМ = Документы.ЗаданиеНабора.ПолучитьЛистМаркировкиДляЗНБ(ЗаданиеПоШК);		
				
				// Кельманов А.В. - Оптимизация работы - 2025.04.01 {
				Если Не ЗначениеЗаполнено(ЛМ) И Не ЗаданиеПоШК.Склад.ЭтоСкладМаркированногоТовара Тогда
					
					// Кельманов А.В. - Оптимизация работы - 2026.06.30 {
					//ТекстОшибки = Документы.ЗаданиеНабора.СоздатьЗНМ_И_ЛМ(ЗаданиеПоШК, ЗаданиеПоШК.Накладная);
					ТекстОшибки = Документы.ЗаданиеНабора.СоздатьЗНМ_И_ЛМ(ЗаданиеПоШК, Накладная);
					// Кельманов А.В. - Оптимизация работы - 2026.06.30 }
					
					Если ТекстОшибки <> "" Тогда
						
						Ошибки = ТекстОшибки;
						
						Возврат Ложь;
						
					КонецЕсли;
					
					ЛМ = Документы.ЗаданиеНабора.ПолучитьЛистМаркировкиДляЗНБ(ЗаданиеПоШК);		
					
					// Кельманов А.В. - Исправление ошибки - 2025.12.25 {
					Если Не ЗначениеЗаполнено(ЛМ) Тогда
						
						Ошибки = "Не создан документ ЛМ для маркировки штучных товаров";
						
						Возврат Ложь;
						
					КонецЕсли;
					// Кельманов А.В. - Исправление ошибки - 2025.12.25 }
					
				КонецЕсли;
				// Кельманов А.В. - Оптимизация работы - 2025.04.01 }
				
				// Кельманов А.В. - ASU-2094 - 2025.03.13 }
				
			КонецЕсли;
			
			// Кельманов А.В. - Исправление ошибки - 2025.05.29 {
		КонецЕсли;
		// Кельманов А.В. - Исправление ошибки - 2025.05.29 }
		
	КонецЕсли;
	// Кельманов А.В. - MARK-766 - 2025.01.28 }
	
	//Кухарь А.Ю.  21.10.2022 начало
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	//Кухарь А.Ю.  21.10.2022 конец
	
	Наборщик = Неопределено;
	ШКСотрудника = "";
	
	Если СтруктураДопПараметров <> Неопределено И СтруктураДопПараметров.Свойство("ШКСотрудника") Тогда
		
		ШКСотрудника = СтруктураДопПараметров.ШКСотрудника;
		Наборщик = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ШтрихКод", ШКСотрудника);
		
		// Кельманов А.В. - 0000000792 - 2026.06.05 {
		// Перенёс код ниже, чтобы при какой-либо ошибке загрузи ЗНБ не создавалась запись о занятости сотрудника
		////Тимофеев Ю.А. 31.03.2026
		////https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105
		//	
		//ОтветСТр = ADRESS.ПроверитьСтатусСотрудника(Наборщик);
		//
		//Если ОтветСТр.Результат Тогда 					
		//	Ошибки = ОтветСТр.Ответ;        					
		//	Возврат Ложь;  
		//Иначе
		//	ADRESS.ДобавитьЗанятостьСотрудника(Наборщик,ЗаданиеПоШК.Ссылка);
		//КонецЕсли;     
		//
		////Тимофеев Ю.А. 31.03.2026 	
		// Кельманов А.В. - 0000000792 - 2026.06.05 }
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наборщик) Тогда
		
		ЗаполнятьНаборщика = Истина;
		
	Иначе
		
		ЗаполнятьНаборщика = Ложь;
		
		Ошибки = "Не найден наборщик по ШК " + ШКСотрудника + " при получении ЗНБ.";
		ЗаписатьВЛог("Отладка", Ошибки, "Информация");		
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 {
	//Если ЗаданиеПоШК = Неопределено Тогда
	//	
	//	Ошибки = "Не найдено задание по ШК"; 
	//	
	//	Возврат Ложь;
	//	
	//Иначе
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 }
	
	// Кухарь А.Ю.  10.11.2022 начало
	МассивОшибок=новый Массив;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	ЗаданиеНабора.Накладная КАК Накладная,
	             |	ЗаданиеНабора.Сектор КАК Сектор,
	             |	ЗаданиеНабора.Сектор.Здание КАК Здание,
	             |	ЗаданиеНабора.ПроходнаяНакладная КАК ПроходнаяНакладная,
	             |	ЗаданиеНабора.Склад КАК Склад,
	             |	ЗаданиеНабора.СостояниеНакладной КАК СостояниеНакладной,
	             |	ЗаданиеНабора.ОтправленНаТСД КАК ОтправленНаТСД,
	             |	ЗаданиеНабора.Проведен КАК Проведен,
	             |	ЗаданиеНабора.ПоследовательныйНабор КАК ПоследовательныйНабор,
	             |	ЗаданиеНабора.ТребуетсяМаркировка КАК ТребуетсяМаркировка, 
				 //Кухарь А.Ю.  02.02.2026 начало
				 //OUT-189
				 |	ЗаданиеНабора.АдресноеХранение КАК АдресноеХранение				 
				 //Кухарь А.Ю.  02.02.2026 конец
				 
	             |ИЗ
	             |	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	             |ГДЕ
	             |	ЗаданиеНабора.Ссылка = &Ссылка";
	
	запрос.УстановитьПараметр("Ссылка",ЗаданиеПоШК);
	результат=запрос.Выполнить().Выбрать();
	
	пока результат.Следующий() цикл
		Накладная=результат.Накладная;
		Сектор=результат.Сектор;
		Здание=результат.Здание;
		ПроходнаяНакладная=результат.ПроходнаяНакладная;
		Склад=результат.Склад;
		СостояниеНакладной=результат.СостояниеНакладной;
		ОтправленНаТСД=результат.ОтправленНаТСД;
		Проведен=результат.Проведен;
		// Кухарь А.Ю.  04.11.2023 начало
		//
		ПоследовательныйНабор = результат.ПоследовательныйНабор; 
		// Кухарь А.Ю.  04.11.2023 конец
		
		// Кухарь А.Ю.  31.03.2024 начало
		ТребуетсяМаркировка=результат.ТребуетсяМаркировка;
		// Кухарь А.Ю.  31.03.2024 конец
		
		//Кухарь А.Ю. 02.02.2026 начало
		//OUT-189  
		АдресноеХранение = результат.АдресноеХранение;
		//Кухарь А.Ю. 02.02.2026 начало

	КонецЦикла;
	
	//Кухарь А.Ю. 02.02.2026 начало
	если АдресноеХранение тогда
		МассивОшибок.Добавить("У ЗНБ установлен признак адресного хранения. Правильнее его набирать через приложение для работы с адресном хранением.");   
	КонецЕсли;
	//Кухарь А.Ю. 02.02.2026 начало
	
	
	если не Проведен тогда
		МассивОшибок.Добавить("ЗНБ не проведено.");
	КонецЕсли;
	
	// Кельманов А.В. - ASU-1695 - 2025.01.14 {
	//// Кухарь А.Ю.  31.03.2024 начало
	//Если ТребуетсяМаркировка  тогда
	//	МассивОшибок.Добавить("У ЗНБ стоит признак - требуется маркировка. Набор на ТСД таких ЗНБ пока что не поддерживается");
	//КонецЕсли;
	//// Кухарь А.Ю.  31.03.2024 конец
	// Кельманов А.В. - ASU-1695 - 2025.01.14 }
	
	если СостояниеНакладной<> Перечисления.СостоянияНакладной.ОжиданиеНабора тогда
		МассивОшибок.Добавить("Нельзя загружать ЗНБ в состоянии отличном от ОН. Текущее состояние - "+Строка(СостояниеНакладной));
	КонецЕсли;
	если ОтправленНаТСД тогда
		МассивОшибок.Добавить("ЗНБ уже выгружался на ТСД.");
	КонецЕсли;
	
	если МассивОшибок.Количество()>0 тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
		Ошибки=СтрСоединить(МассивОшибок,Символы.ПС);
		ЗНБОбъект=Неопределено;
		ЗаданиеПоШК=Неопределено;			
		Возврат ложь;
	КонецЕсли;
	
	// Кельманов А.В. - HELP-8331 - 2025.12.23 {
	СписокДоступныхСостояний = ПроверитьБлокировкуВыдачейВНабор(ЗаданиеПоШК);
	
	Если СписокДоступныхСостояний <> Неопределено Тогда
		
		Если СписокДоступныхСостояний.Найти(СостояниеНакладной) = Неопределено Тогда
			МассивОшибок.Добавить("Накладная заблокирована для изменений документом: Блокировка выдачи в набор");
		ИначеЕсли СписокДоступныхСостояний.Найти(Перечисления.СостоянияНакладной.ВНаборе) = Неопределено Тогда
			МассивОшибок.Добавить("Накладную нельзя перевести в состояние ""В наборе"". Данный статус накладной запрещён документом: Блокировка выдачи в набор");
		КонецЕсли;
		
	КонецЕсли;			
	// Кельманов А.В. - HELP-8331 - 2025.12.23 }
	
	// Кельманов А.В. - HELP-9089 - 2026.04.01 {
	РезПроверки = Обработки.ПланИнвентаризации.ПроверитьЗНБОжиданиеНабора(ЗаданиеПоШК);
	
	Если Не РезПроверки.Успех Тогда
		
		МассивОшибок.Добавить("Накладная заблокирована в статусе ""Ожидание набора"" документом: Блокировка выдачи в набор. Необходимо отложить коробку до окончания ИНВ");
		МассивОшибок.Добавить("Заблокированные товары:" + Символы.ПС + СтрСоединить(РезПроверки.Ошибки, Символы.ПС));
		
	КонецЕсли;
	// Кельманов А.В. - HELP-9089 - 2026.04.01 }
	
	ТЗНеОбработанныхЛНТекущегоСотрудника = ПолучитьНеобработанныеЛНТекущегоСотрудника(Наборщик); 
	если ТЗНеОбработанныхЛНТекущегоСотрудника.количество()>0 тогда
		МассивОшибок.Добавить("У наборщика "+Наборщик+", есть необработанные ЛН:");
		для каждого СтрТЗ из ТЗНеОбработанныхЛНТекущегоСотрудника цикл
			МассивОшибок.Добавить(СтрТЗ.номер);
		КонецЦикла;
	КонецЕсли;
	
	если ПроходнаяНакладная тогда
		ТЗНеОбработанныхЛННакладной=ПолучитьНеобработанныеЛНТекущейПроходнойНакладной(Накладная,Здание);
		если ТЗНеОбработанныхЛННакладной.количество()>0 тогда
			МассивОшибок.Добавить("У накладной "+Накладная+", есть необработанные ЛН:");
			для каждого СтрТЗ из ТЗНеОбработанныхЛННакладной цикл
				МассивОшибок.Добавить(СтрТЗ.номер+", сканировщик: "+СтрТЗ.Сканировщик);		
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	если МассивОшибок.Количество()>0 тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
		Ошибки=СтрСоединить(МассивОшибок,Символы.ПС);
		ЗНБОбъект=Неопределено;
		ЗаданиеПоШК=Неопределено;			
		Возврат ложь;
	КонецЕсли;
	
	// Кухарь А.Ю.  10.11.2022 конец
	
	// Кельманов А.В. - 0000000792 - 2026.06.05 {
	ОтветСТр = ADRESS.ПроверитьСтатусСотрудника(Наборщик);
	
	Если ОтветСТр.Результат Тогда 					
		Ошибки = ОтветСТр.Ответ;        					
		Возврат Ложь;  
	Иначе
		ADRESS.ДобавитьЗанятостьСотрудника(Наборщик, ЗаданиеПоШК.Ссылка);
	КонецЕсли;     
	// Кельманов А.В. - 0000000792 - 2026.06.05 }
		
	// Кельманов А.В. - ASU-2094 - 2025.03.12 {
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Склад);
	// Кельманов А.В. - ASU-2094 - 2025.03.12 }
	
	// Кухарь А.Ю. 27.10.2021 начало
	ТекДата=ТекущаяДата();
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Дата,
	|			Склад = &склад
	|				И Номенклатура В (&Номенклатура)) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&Дата,
	|				Склад = &Склад
	|					И Номенклатура В (&Номенклатура)) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНабораТовары.Количество - ЕСТЬNULL(Остатки.Количество, 0) КАК КоличествоПослеСписания
	|ПОМЕСТИТЬ ЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ЗаданиеНабораТовары.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	ЗаданиеНабораТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНБ.Номенклатура.Наименование КАК Номенклатура,
	|	ЗНБ.КоличествоПослеСписания КАК Недостача
	|ИЗ
	|	ЗНБ КАК ЗНБ
	|ГДЕ
	|	ЗНБ.КоличествоПослеСписания > 0";
	запрос.УстановитьПараметр("Ссылка",ЗаданиеПоШК);
	запрос.УстановитьПараметр("Номенклатура",ЗаданиеПоШК.товары.выгрузитьколонку("Номенклатура"));
	запрос.УстановитьПараметр("Дата",ТекДата);
	
	// Кухарь А.Ю. 30.03.2022 начало
	//запрос.УстановитьПараметр("Склад",ПараметрыСеанса.ЭтотУзел.Подразделение.ОсновнойСклад);
	если склад.ВидСклада=Перечисления.ВидСклада.Виртуальный тогда
		Склад=Склад.ФизическийСклад;	
	КонецЕсли;
	запрос.УстановитьПараметр("Склад",Склад);
	// Кухарь А.Ю. 30.03.2022 конец
	
	результат=запрос.Выполнить().Выбрать();
	
	// Кухарь А.Ю.  10.11.2022 начало
	//ОшибкиСписания="";
	если результат.Количество()>0 тогда
		МассивОшибок.Добавить("Недостаточно номенклатуры на остатках.");
	КонецЕсли;
	// Кухарь А.Ю.  10.11.2022 конец
	
	пока результат.следующий() цикл
		// Кухарь А.Ю.  10.11.2022 начало
		// 			ОшибкиСписания=ОшибкиСписания+результат.Номенклатура+" не хватает "+результат.Недостача+" шт. ";
		МассивОшибок.Добавить(""+результат.Номенклатура+" не хватает "+результат.Недостача+" шт. ");
		// Кухарь А.Ю.  10.11.2022 конец			
	КонецЦикла;
	
	// Кухарь А.Ю.  10.11.2022 начало
	//
	//если ОшибкиСписания<>"" тогда
	//	Ошибки=Ошибки+" Недостаточно товара: "+ОшибкиСписания;
	//	Возврат ложь;
	//КонецЕсли;
	
	если МассивОшибок.Количество()>0 тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
		Ошибки=СтрСоединить(МассивОшибок,Символы.ПС);
		ЗНБОбъект=Неопределено;
		ЗаданиеПоШК=Неопределено;	
		// Кухарь А.Ю.  24.03.2023 начало
		ПолныеДанные=Неопределено; 
		// Кухарь А.Ю.  24.03.2023 конец
		
		Возврат ложь;
	КонецЕсли;
	// Кухарь А.Ю.  10.11.2022 конец
	
	///////////////////////////////////////////////////////////////////////////////////////////
	//Все проверки, можно ли грузить ЗНБ, должны быть выше
	///////////////////////////////////////////////////////////////////////////////////////////
	
	ЗНБОбъект=ЗаданиеПоШК.ПолучитьОбъект();
	
	// Кухарь А.Ю.  19.09.2024 начало
	ПланыОбмена.ЗарегистрироватьИзменения(Узел,ЗаданиеПоШК);
	// Кухарь А.Ю.  19.09.2024 конец
	
	если ложь тогда ЗНБОбъект=документы.ЗаданиеНабора.СоздатьДокумент();КонецЕсли;	
	ЗНБОбъект.ОтправленНаТСД=Истина;
	ЗНБОбъект.ОбменДанными.Загрузка = Истина;
	ЗНБОбъект.УзелТСД=Узел; 
	ЗНБОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВНаборе;
	ЗНБОбъект.Дата = ТекДата;
	ЗНБОбъект.ОбработкаПроведения(ложь,РежимПроведенияДокумента.Неоперативный);
	
	НачатьТранзакцию();
	ЗНБОбъект.Записать();		
	ПланНабора=ЗНБОбъект.ДокументОснование.ПолучитьОбъект();
	если ложь тогда ПланНабора=документы.ПланНабора.СоздатьДокумент();КонецЕсли;
	МассСтрокПН=ПланНабора.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",ЗНБОбъект.НомерЧасти));
	Для каждого СтрМасс из МассСтрокПН цикл
		СтрМасс.Состояние= Перечисления.СостоянияНакладной.ВНаборе;
		СтрМасс.НачалоНабора=ТекДата;
		если ЗаполнятьНаборщика тогда
			СтрМасс.Наборщик=Наборщик;
		КонецЕсли; 
	КонецЦикла;	
	ПланНабора.Записать();
	ЗафиксироватьТранзакцию();
	
	// Кухарь А.Ю. 17.11.2021 конец
	
	// Кухарь А.Ю. 02.05.2022 начало
	//Для проходных накладных выгрузим все ЛН, для возможности что-то в них досканировать	
	Если ПроходнаяНакладная Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛистНабора.Ссылка КАК ЛН
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|ГДЕ
		|	ЛистНабора.Дата >= &Дата
		|	И ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &Накладная
		|	И ЛистНабора.ЗаданияНабора.ЗаданиеНабора.ПроходнаяНакладная
		// Кухарь А.Ю.  04.11.2023 начало
		//   |	И ЛистНабора.Здание = &Здание";	
		|	И (ЛистНабора.Здание = &Здание или &ПоследовательныйНабор)";	 
		// Кухарь А.Ю.  04.11.2023 конец
		
		// Кухарь А.Ю. 24.05.2022 конец
		
		Запрос.УстановитьПараметр("Дата", ЗНБОбъект.Дата - 30 * 86400);
		Запрос.УстановитьПараметр("Накладная", Накладная);
		// Кухарь А.Ю.  14.11.2022 начало
		Запрос.УстановитьПараметр("Здание", Здание);
		// Кухарь А.Ю.  14.11.2022 конец
		// Кухарь А.Ю.  04.11.2023 начало
		Запрос.УстановитьПараметр("ПоследовательныйНабор", ПоследовательныйНабор);
		// Кухарь А.Ю.  04.11.2023 конец
		
		ТЗЛН = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрЛН Из ТЗЛН Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрЛН.ЛН);	
			
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистНабораТовары.Номенклатура КАК Номенклатура,
		// Кельманов А.В. - HELP-7170 - 2025.10.01 {
		|	ЛистНабораТовары.Номенклатура.Родитель КАК Родитель,
		// Кельманов А.В. - HELP-7170 - 2025.10.01 }
		|	ЛистНабораТовары.Номенклатура.ОсновнаяЕдиница КАК ОсновнаяЕдиница
		|ИЗ
		|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		|ГДЕ
		|	ЛистНабораТовары.Ссылка В(&СписокЛН)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛистНабораТовары.Номенклатура";	
		
		Запрос.УстановитьПараметр("СписокЛН", ТЗЛН.ВыгрузитьКолонку("ЛН"));
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.Номенклатура);	
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.ОсновнаяЕдиница);	
			
			// Кельманов А.В. - HELP-7170 - 2025.10.01 {
			Если ЗначениеЗаполнено(Результат.Родитель) Тогда
				
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.Родитель);
				
			КонецЕсли;
			// Кельманов А.В. - HELP-7170 - 2025.10.01 }
			
		КонецЦикла;
		
		// Кельманов А.В. - HELP-8704 - 2026.06.04 {
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		               |ИЗ
		               |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистНабораШтрихкодыУпаковок.Ссылка В(&СписокЛН)
		               |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";	
		
		Запрос.УстановитьПараметр("СписокЛН", ТЗЛН.ВыгрузитьКолонку("ЛН"));
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.ШтрихкодУпаковки);	
			
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора КАК ШтрихкодНабора
		               |ИЗ
		               |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистНабораШтрихкодыУпаковок.Ссылка В(&СписокЛН)
		               |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";	
		
		Запрос.УстановитьПараметр("СписокЛН", ТЗЛН.ВыгрузитьКолонку("ЛН"));
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.ШтрихкодНабора);	
			
		КонецЦикла;
		// Кельманов А.В. - HELP-8704 - 2026.06.04 }
		
	КонецЕсли;	
	// Кухарь А.Ю. 02.05.2022 конец
	
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЗаданиеПоШК);
	
	// Кухарь А.Ю.  24.03.2023 начало
	Если ПолныеДанные <> Неопределено Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ПолныеДанные);
		
		// Кельманов А.В. - ASU-2107 - 2025.04.10 {
		Если ЗначениеЗаполнено(ПолныеДанные.Контрагент) Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ПолныеДанные.Контрагент);
			
		КонецЕсли;
		// Кельманов А.В. - ASU-2107 - 2025.04.10 }
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура,
		// Кельманов А.В. - HELP-7170 - 2025.10.01 {
		|	ПолныеДанныеЗаданияНабораТовары.Номенклатура.Родитель КАК Родитель,
		// Кельманов А.В. - HELP-7170 - 2025.10.01 }
		|	ПолныеДанныеЗаданияНабораТовары.Номенклатура.Цвет КАК Цвет,
		|	ПолныеДанныеЗаданияНабораТовары.Номенклатура.Размер КАК Размер
		|ИЗ
		|	Документ.ПолныеДанныеЗаданияНабора.Товары КАК ПолныеДанныеЗаданияНабораТовары
		|ГДЕ
		|	ПолныеДанныеЗаданияНабораТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПолныеДанные);
		ТЗПродукции = Запрос.Выполнить().Выгрузить();		
		
		Для Каждого СтрТЗ Из ТЗПродукции Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Цвет);
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Размер);			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Номенклатура);	
			
			// Кельманов А.В. - HELP-7170 - 2025.10.01 {
			Если ЗначениеЗаполнено(СтрТЗ.Родитель) Тогда
				
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Родитель);
				
			КонецЕсли;
			// Кельманов А.В. - HELP-7170 - 2025.10.01 }
			
		КонецЦикла;
		// Кухарь А.Ю. 02.05.2022 конец
		
	КонецЕсли;
	// Кухарь А.Ю.  24.03.2023 конец
	
	// Кельманов А.В. - MARK-766 - 2025.01.28 {
	Если ЗначениеЗаполнено(ЗСБЧЗ) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЗСБЧЗ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
		|ГДЕ
		|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЗСБЧЗ);
		
		ТЗ_Коды = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр_Коды Из ТЗ_Коды Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр_Коды.ШтрихкодУпаковки);
			
		КонецЦикла;
		
	КонецЕсли;
	// Кельманов А.В. - MARK-766 - 2025.01.28 }
	
	// Кельманов А.В. - ASU-2094 - 2025.03.13 {
	Если ЗначениеЗаполнено(ЛМ) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЛМ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛистМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	Документ.ЛистМаркировки.ШтрихкодыУпаковок КАК ЛистМаркировкиШтрихкодыУпаковок
		|ГДЕ
		|	ЛистМаркировкиШтрихкодыУпаковок.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЛМ);
		
		ТЗ_Коды = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр_Коды Из ТЗ_Коды Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр_Коды.ШтрихкодУпаковки);
			
		КонецЦикла;
		
	КонецЕсли;
	// Кельманов А.В. - ASU-2094 - 2025.03.13 }
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	// Кельманов А.В. - HELP-7170 - 2025.10.01 {
	|	ЗаданиеНабораТовары.Номенклатура.Родитель КАК Родитель,
	// Кельманов А.В. - HELP-7170 - 2025.10.01 }
	|	ЗаданиеНабораТовары.Номенклатура.ОсновнаяЕдиница КАК ОсновнаяЕдиница,
	|	ЗаданиеНабораТовары.Номенклатура.Цвет КАК Цвет,
	|	ЗаданиеНабораТовары.Номенклатура.Размер КАК Размер
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|ГДЕ
	|	ЗаданиеНабораТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеПоШК);
	
	ТЗПозиций = Запрос.Выполнить().Выгрузить();		
	
	Для Каждого СтрТЗ Из ТЗПозиций Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Цвет);
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Размер);
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Номенклатура);	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.ОсновнаяЕдиница);	
		
		// Кельманов А.В. - HELP-7170 - 2025.10.01 {
		Если ЗначениеЗаполнено(СтрТЗ.Родитель) Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Родитель);
			
		КонецЕсли;
		// Кельманов А.В. - HELP-7170 - 2025.10.01 }
		
	КонецЦикла;
	
	СписокПозиций = ТЗПозиций.ВыгрузитьКолонку("Номенклатура");
	// Кухарь А.Ю. 02.05.2022 конец
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ различные
	|	ШтрихКоды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец В(&Владелец)
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|	И ПОДСТРОКА(ШтрихКоды.Наименование, 1, 7) <> ""9999999""";
	
	Запрос.УстановитьПараметр("Владелец", СписокПозиций);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.Ссылка);	
	КонецЦикла;
	
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 {
	//КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2025.12.24 }
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьЗаданиеПоШК (ШтрихКод)   
	//В тестовом варианте ищется левый документ, потом переделаю на ШК.
	НайденноеЗадание=НайтиДокПоШК(ШтрихКод);
	
	
	если не ЗначениеЗаполнено(НайденноеЗадание) или НайденноеЗадание.Метаданные().имя<>"ЗаданиеНабора" тогда
		Возврат Неопределено;
	иначе
		возврат НайденноеЗадание;
	КонецЕсли;
	
	
	
КонецФункции
//Кухарь 06.08.19 конец	

// Кельманов А.В. - ASU-2104 - 2025.03.22
// Кельманов А.В. - HELP-3850 - 2025.04.07 {
//Функция ЗарегистрироватьЛСК_ДляТСД(Узел, Ошибки = "", ДанныеДляПолученияЛСК) Экспорт
Функция ЗарегистрироватьЛСК_ДляТСД(Узел, Ошибки = "", ДанныеДляПолученияЛСК, Наборщик) Экспорт
// Кельманов А.В. - HELP-3850 - 2025.04.07 }

	ЗаданиеПоШК = Неопределено;

	СпайкаВладелец = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеДляПолученияЛСК.ЛСК) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец КАК ШтрихкодКомплектаВладелец
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК";
		
		Запрос.УстановитьПараметр("ЛСК", ДанныеДляПолученияЛСК.ЛСК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СпайкаВладелец = Выборка.ШтрихкодКомплектаВладелец;
			
		КонецЕсли;
		
	Иначе
		
		СпайкаВладелец = НайтиТоварПоШтрихКоду(ДанныеДляПолученияЛСК.ШКСпайкиЛинейный);
	
		// Кельманов А.В. - HELP-7204 - 2025.09.30 {
		Если Не ЗначениеЗаполнено(СпайкаВладелец) Тогда
			
			ЗаданиеПоШК = ПолучитьЗаданиеПоШК(ДанныеДляПолученияЛСК.ШКСпецификации);
			
			Если ЗаданиеПоШК <> Неопределено Тогда 
				
				ТЗМатриц = ПолучитьТаблицуМатриц(ЗаданиеПоШК.Накладная);		
				
				МассМатрицы = ТЗМатриц.НайтиСтроки(Новый Структура("ШККонтрагента", ДанныеДляПолученияЛСК.ШКСпайкиЛинейный));
				
				Если МассМатрицы.Количество() > 0 Тогда
					
					СтрокаМатрицы = МассМатрицы.Получить(0);
					
					СпайкаВладелец = СтрокаМатрицы.Номенклатура;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		// Кельманов А.В. - HELP-7204 - 2025.09.30 }
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпайкаВладелец) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СпайкаВладелец);
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Родитель КАК Родитель,
		               |	Номенклатура.Размер КАК Размер,
		               |	Номенклатура.Цвет КАК Цвет
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	Номенклатура.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СпайкаВладелец);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Родитель);
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Размер);
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Цвет);
		
		КонецЕсли;
		
	Иначе
		
		Ошибки = "Не найдена спайка по ШК: " + ДанныеДляПолученияЛСК.ШКСпайкиЛинейный;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ЛСК = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеДляПолученияЛСК.ЛСК) Тогда
		
		ЛСК = ДанныеДляПолученияЛСК.ЛСК;
		
	Иначе
		
		// Кельманов А.В. - HELP-7204 - 2025.09.30 {
		//ЗаданиеПоШК = ПолучитьЗаданиеПоШК(ДанныеДляПолученияЛСК.ШКСпецификации);
		Если ЗаданиеПоШК = Неопределено Тогда
			
			ЗаданиеПоШК = ПолучитьЗаданиеПоШК(ДанныеДляПолученияЛСК.ШКСпецификации);
			
		КонецЕсли;
		// Кельманов А.В. - HELP-7204 - 2025.09.30 }
		
		// Кельманов А.В. - HELP-8422 - 2026.01.03 {
		Если ЗаданиеПоШК = Неопределено Тогда
			
			Ошибки = "Не найдено задание по ШК: " + ДанныеДляПолученияЛСК.ШКСпецификации;
			
			Возврат Ложь;
			
		КонецЕсли;
		// Кельманов А.В. - HELP-8422 - 2026.01.03 }
		
		ЗСБЧЗ = Неопределено;
		
		Если ЗаданиеПоШК <> Неопределено Тогда
			
			ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(ЗаданиеПоШК.Накладная);
			
		КонецЕсли;
		
		// Кельманов А.В. - MARK-2511 - 2025.07.01 {
		//Если Не ЗначениеЗаполнено(ЗСБЧЗ) Тогда
		Если Не ЗначениеЗаполнено(ЗСБЧЗ) Или ЗСБЧЗ.ШтрихкодыУпаковок.Количество() = 0 Тогда
		// Кельманов А.В. - MARK-2511 - 2025.07.01 }
			
			// Кельманов А.В. - MARK-2511 - 2025.07.01 {
			//// Кельманов А.В. - HELP-4265 - 2025.04.17 {
			////СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(ЗаданиеПоШК.Накладная);
			//СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(ЗаданиеПоШК.Накладная, , Истина);
			//// Кельманов А.В. - HELP-4265 - 2025.04.17 }
			СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(ЗаданиеПоШК.Накладная, Истина, Истина);
			// Кельманов А.В. - MARK-2511 - 2025.07.01 }
			
			Если Не СтруктураОтвета.Успех Тогда
				
				Ошибки = СтруктураОтвета.Ошибки;
				
				Возврат Ложь;
				
			Иначе
				
				ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(ЗаданиеПоШК.Накладная);
			
			КонецЕсли;
	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗСБЧЗ) Тогда
			
			Запрос = Новый Запрос;
			
			// Кельманов А.В. - HELP-3816 - 2025.04.02 {
			//Запрос.Текст = "ВЫБРАТЬ
			//               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта
			//               |ПОМЕСТИТЬ КодыВЛСК
			//               |ИЗ
			//               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
			//               |ГДЕ
			//               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗСБЧЗ
			//               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
			//               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец = &Владелец
			//               |
			//               |СГРУППИРОВАТЬ ПО
			//               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта
			//               |;
			//               |
			//               |////////////////////////////////////////////////////////////////////////////////
			//               |ВЫБРАТЬ ПЕРВЫЕ 1
			//               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			//               |ИЗ
			//               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
			//               |		ЛЕВОЕ СОЕДИНЕНИЕ КодыВЛСК КАК КодыВЛСК
			//               |		ПО ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = КодыВЛСК.ШтрихкодКомплекта
			//               |ГДЕ
			//               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
			//               |	И ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец = &Владелец
			//               |	И КодыВЛСК.ШтрихкодКомплекта ЕСТЬ NULL";
			//
			//Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат(ДанныеДляПолученияЛСК.КоличествоСпаекДляОбработки, "ЧГ=0"));

			// Кельманов А.В. - Оптимизация работы - 2025.05.14 {
			//Запрос.Текст = "ВЫБРАТЬ
			//               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			//               |ИЗ
			//               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
			//               |ГДЕ
			//               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
			//               |	И ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец = &Владелец";
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			               |ИЗ
			               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, Номенклатура = &Владелец) КАК СтатусыКМ_ФактСрезПоследних
			               |		ПО ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
			               |ГДЕ
			               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
			               |	И СтатусыКМ_ФактСрезПоследних.Статус = &Статус";
			
			Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
			// Кельманов А.В. - Оптимизация работы - 2025.05.14 }
			
			// Кельманов А.В. - HELP-3816 - 2025.04.02 }
			
			Запрос.УстановитьПараметр("ЗСБЧЗ", ЗСБЧЗ);
			Запрос.УстановитьПараметр("Владелец", СпайкаВладелец);
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				
				// Кельманов А.В. - Оптимизация работы - 2025.06.24 {
				//ЛСКОбъект = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент();
				ЗапросПустыеЛСК = Новый Запрос;
				
				ЗапросПустыеЛСК.Текст = "ВЫБРАТЬ
				                        |	ЛистСборкиКомплектовЧЗ.Ссылка КАК ЛСК,
				                        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.НомерСтроки) КАК НомерСтроки
				                        |ИЗ
				                        |	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
				                        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
				                        |		ПО (ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = ЛистСборкиКомплектовЧЗ.Ссылка)
				                        |ГДЕ
				                        |	ЛистСборкиКомплектовЧЗ.ДокОснование = &ЗСБЧЗ
				                        |	И ЛистСборкиКомплектовЧЗ.УзелТСД = &УзелТСД
				                        |
				                        |СГРУППИРОВАТЬ ПО
				                        |	ЛистСборкиКомплектовЧЗ.Ссылка
				                        |
				                        |ИМЕЮЩИЕ
				                        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.НомерСтроки) = 0";
				
				ЗапросПустыеЛСК.УстановитьПараметр("ЗСБЧЗ", ЗСБЧЗ);
				ЗапросПустыеЛСК.УстановитьПараметр("УзелТСД", Узел);
				
				ВыборкаПустыеЛСК = ЗапросПустыеЛСК.Выполнить().Выбрать();
				
				Если ВыборкаПустыеЛСК.Следующий() Тогда
					
					ЛСКОбъект = ВыборкаПустыеЛСК.ЛСК.ПолучитьОбъект();
					
				Иначе
					
					ЛСКОбъект = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент();
					
				КонецЕсли;
				// Кельманов А.В. - Оптимизация работы - 2025.06.24 }
				
				ЛСКОбъект.Дата = ТекущаяДата();		
				
				//+++Чирков 2025.04.05
				//ЛСКОбъект.ОбработкаЗаполнения(ЗСБЧЗ, "", Истина);
				ЛСКОбъект.Заполнить(ЗСБЧЗ);
				//---Чирков 2025.04.05
				
				ЛСКОбъект.Товары.Очистить();
				ЛСКОбъект.ШтрихкодыУпаковок.Очистить();
				
				// Кельманов А.В. - HELP-3816 - 2025.04.02 {
				//Выборка = Результат.Выбрать();
				//
				//Пока Выборка.Следующий() Цикл
				//	
				//	НовСтр = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
				//	
				//	НовСтр.ШтрихкодКомплекта = Выборка.ШтрихкодУпаковки;
				//	
				//КонецЦикла;
				//
				//ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
				//
				//ЛСК = ЛСКОбъект.Ссылка;
				
				// Кельманов А.В. - HELP-3850 - 2025.04.07 {
				ЛСКОбъект.УзелТСД = Узел;
				
				Если ЗначениеЗаполнено(Наборщик) Тогда
					
					// Кельманов А.В. - ПОМЕНЯЛ ТИП НА ФИЗЛИЦО - 2025.04.17 {
					//ЗапросПользовательТСД = Новый Запрос;
					//
					//ЗапросПользовательТСД.Текст = "ВЫБРАТЬ
					//                              |	Пользователи.Ссылка КАК Пользователь
					//                              |ИЗ
					//                              |	Справочник.Пользователи КАК Пользователи
					//                              |ГДЕ
					//                              |	Пользователи.ФизЛицо = &ФизЛицо
					//                              |	И НЕ Пользователи.ПометкаУдаления";
					//
					//ЗапросПользовательТСД.УстановитьПараметр("ФизЛицо", Наборщик);
					//
					//ВыборкаПользовательТСД = ЗапросПользовательТСД.Выполнить().Выбрать();
					//
					//Если ВыборкаПользовательТСД.Следующий() Тогда
					//	
					//	ЛСКОбъект.СборщикКомплектаТСД = ВыборкаПользовательТСД.Пользователь;
					//	
					//КонецЕсли;
					ЛСКОбъект.СборщикКомплектаТСД = Наборщик;
					// Кельманов А.В. - ПОМЕНЯЛ ТИП НА ФИЗЛИЦО - 2025.04.17 }

				КонецЕсли;
				// Кельманов А.В. - HELP-3850 - 2025.04.07 }
				
				ЛСКОбъект.ДатаНачалаСканирования = ТекущаяДата(); // Кельманов А.В. - Оптимизация работы - 2025.05.07
				
				ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				ЛСК = ЛСКОбъект.Ссылка;
				
				МассивДоступныхКодовЗСБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
				
				ТаблицаДляПолученияКодов = Новый ТаблицаЗначений;
				ТаблицаДляПолученияКодов.Колонки.Добавить("Номенклатура");
				ТаблицаДляПолученияКодов.Колонки.Добавить("Количество");
				
				НовСтрПолучениеКодов = ТаблицаДляПолученияКодов.Добавить();
				НовСтрПолучениеКодов.Номенклатура = СпайкаВладелец;
				НовСтрПолучениеКодов.Количество = ДанныеДляПолученияЛСК.КоличествоСпаекДляОбработки;
				
				ДопПараметры = Новый Структура("Статус, МассивДоступныхКодов, ТипКода, Добавлять",
				Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован, МассивДоступныхКодовЗСБ, Перечисления.ТипыКодовМаркировки.Набор, Истина);
				
				РезультатПолученияКодов = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(ТаблицаДляПолученияКодов, ЛСК, ДопПараметры);		
				
				Если Не РезультатПолученияКодов.Успешно Тогда
					
					Ошибки = СтрСоединить(РезультатПолученияКодов.Ошибки, Символы.ПС);
					
					Возврат Ложь;
					
				КонецЕсли;
				
				Для Каждого СтрокаДанных Из РезультатПолученияКодов.Данные.Получить(СпайкаВладелец) Цикл
					
					НовСтр = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
					
					НовСтр.ШтрихкодКомплекта = СтрокаДанных;
					
				КонецЦикла;
				
				ЛСКОбъект.Записать(РежимЗаписиДокумента.Запись);
				// Кельманов А.В. - HELP-3816 - 2025.04.02 }
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛСК) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЛСК);
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодУпаковки
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК
		               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК
		               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ЛСК", ЛСК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.ШтрихкодУпаковки);
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛистСборкиКомплектовЧЗ.ДокОснование.ДокОснование КАК Накладная
		               |ПОМЕСТИТЬ ВТ_РНК
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗ.Ссылка = &ЛСК
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура
		               |ИЗ
		               |	ВТ_РНК КАК ВТ_РНК
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		               |		ПО ВТ_РНК.Накладная = РасходнаяНакладнаяКомплектующие.Ссылка
		               |ГДЕ
		               |	РасходнаяНакладнаяКомплектующие.Продукция = &Продукция";
		
		Запрос.УстановитьПараметр("ЛСК", ЛСК);
		Запрос.УстановитьПараметр("Продукция", СпайкаВладелец);
		
		// Кельманов А.В. - HELP-4758 - 2025.05.30 {
		//Выборка = Запрос.Выполнить().Выбрать();
		//
		//Пока Выборка.Следующий() Цикл
		//	
		//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Номенклатура);
		//	
		//КонецЦикла;
		ТЗ_Комплектующие = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрКомпл Из ТЗ_Комплектующие Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрКомпл.Номенклатура);
			
		КонецЦикла;
		
		СписокНоменклатуры = ТЗ_Комплектующие.ВыгрузитьКолонку("Номенклатура");

		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ШтрихКоды.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ШтрихКоды КАК ШтрихКоды
		               |ГДЕ
		               |	ШтрихКоды.Владелец В(&СписокНоменклатуры)
		               |	И НЕ ШтрихКоды.ПометкаУдаления
		               |	И ПОДСТРОКА(ШтрихКоды.Наименование, 1, 7) <> ""9999999""";
		
		Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Ссылка);	
			
		КонецЦикла;
		// Кельманов А.В. - HELP-4758 - 2025.05.30 }
		
	Иначе
		
		Ошибки = "Не удалось получить документ ЛСК";
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Кельманов А.В. - SNL-120 - 2026.04.08
Функция ЗарегистрироватьДанныеFBSПоНакладной(Узел, ШтрихКод, Ошибки = "", СтруктураДопПараметров) Экспорт
	
	ЗаданиеПоШК = ПолучитьЗаданиеПоШК(ШтрихКод);
		
	Если ЗаданиеПоШК = Неопределено Тогда
		
		Ошибки = "Не найдено задание по ШК"; 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Накладная = ЗаданиеПоШК.Накладная;

	ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Накладная);
	
	Если Не ИспользоватьЛНТолькоДляНабора Тогда
		
		Ошибки = "Для накладной не установлен признак ""Использовать ЛН только для набора""!"; 
		
		Возврат Ложь;
		
	КонецЕсли;

	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	
	Если Не ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		
		Ошибки = "Это не накладная FBS!";
		
		Возврат Ложь;
		
	КонецЕсли;

	Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеПереукладки Тогда
		
		Ошибки = "Состояние накладной: " + Накладная.СостояниеНакладной + ". Допустимое состояние для загрузки: ""Ожидание переукладки""";
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПолныеДанныеЗаданияНабора.Ссылка КАК ПолныеДанные
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора КАК ПолныеДанныеЗаданияНабора
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабора.Накладная = &Накладная
	               |	И ПолныеДанныеЗаданияНабора.Проведен";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	ТЗ_ПолныеДанные = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ_ПолныеДанные.Количество() = 0 Тогда
		
		Ошибки = "Для накладной не создан документ ""Полные данные задания набора""!";
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
	Если НужноОбновитьНакладнуюПоЗаказу(Накладная) Тогда
		
		ОбновитьНакладнуюПоЗаказу(Накладная);
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }
	
	Если Накладная.ОтгрузкаКомплектов Тогда
		
		ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(Накладная);
		
		Если Не ЗначениеЗаполнено(ЗСБЧЗ) Тогда
			
			СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(Накладная, , Истина);
			
			Если Не СтруктураОтвета.Успех Тогда
				
				Ошибки = СтруктураОтвета.Ошибки;
				
				Возврат Ложь;
				
			Иначе
				
				ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗСБЧЗПоОснованию(Накладная);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстОшибки = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ПроверитьЗСБЧЗ(ЗСБЧЗ, Накладная);
		
		Если ТекстОшибки <> "" Тогда
			
			Ошибки = ТекстОшибки;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Накладная.Контрагент) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Накладная.Контрагент);
		
	КонецЕсли;
	
	Для Каждого Стр Из ТЗ_ПолныеДанные Цикл
		
		// Кельманов А.В. - Изменение 0000000187 - 2026.07.08 {
		Ошибки = ПроверитьПустыеЗначенияВКолонкахПолныхДанных(Стр.ПолныеДанные);
		
		Если ЗначениеЗаполнено(Ошибки) Тогда
			
			Ошибки = "Ошибки в документе " + Стр.ПолныеДанные + ":" + Символы.ПС + Ошибки;
			
			Возврат Ложь;
			
		КонецЕсли;
		// Кельманов А.В. - Изменение 0000000187 - 2026.07.08 }
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр.ПолныеДанные);
				
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Товары КАК ПолныеДанныеЗаданияНабораТовары
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораТовары.Ссылка.Проведен
	               |	И ПолныеДанныеЗаданияНабораТовары.Ссылка.Накладная = &Накладная
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Номенклатура
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Комплектующие КАК ПолныеДанныеЗаданияНабораКомплектующие
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Проведен
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Накладная = &Накладная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	               |	ВТ_Номенклатура.Номенклатура.Родитель КАК Родитель,
	               |	ВТ_Номенклатура.Номенклатура.Цвет КАК Цвет,
	               |	ВТ_Номенклатура.Номенклатура.Размер КАК Размер
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Номенклатура.Номенклатура,
	               |	ВТ_Номенклатура.Номенклатура.Родитель,
	               |	ВТ_Номенклатура.Номенклатура.Цвет,
	               |	ВТ_Номенклатура.Номенклатура.Размер";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	ТЗПозиций = Запрос.Выполнить().Выгрузить();		
	
	Для Каждого Стр Из ТЗПозиций Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр.Цвет);
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр.Размер);
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр.Номенклатура);	
		
		Если ЗначениеЗаполнено(Стр.Родитель) Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр.Родитель);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПозиций = ТЗПозиций.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ШтрихКоды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШтрихКоды КАК ШтрихКоды
	               |ГДЕ
	               |	ШтрихКоды.Владелец В(&Владелец)
	               |	И НЕ ШтрихКоды.ПометкаУдаления
	               |	И ПОДСТРОКА(ШтрихКоды.Наименование, 1, 7) <> ""9999999""";
	
	Запрос.УстановитьПараметр("Владелец", СписокПозиций);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Ссылка);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗСБЧЗ) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЗСБЧЗ);
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
		|ГДЕ
		|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЗСБЧЗ);
		
		ТЗ_Коды = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр_Коды Из ТЗ_Коды Цикл
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Стр_Коды.ШтрихкодУпаковки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Проведен
	|	И ЗаданиеНабора.Накладная = &Накладная";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗНБОбъект = Выборка.ЗНБ.ПолучитьОбъект();
		
		ЗНБОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Переукладка;
		
		ЗНБОбъект.Записать();
		
	КонецЦикла;
	
	РНКОбъект = Накладная.ПолучитьОбъект();
	
	РНКОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Переукладка;
	
	РНКОбъект.Записать();
			
	Возврат Истина;
	
КонецФункции

// Кухарь А.Ю.  24.03.2023 начало
//
функция  ПолучитьЗаданиеИПолныеДанныеЗаданияНабораQRWB (ШтрихКод)
	СтруктураВозврата=новый Структура("Задание,ПолныеДанные");
	
	 //В тестовом варианте ищется левый документ, потом переделаю на ШК.
	 запрос=новый запрос;
	 запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	              |	ПолныеДанныеЗаданияНабора.ДокОснование КАК Задание,
	              |	ПолныеДанныеЗаданияНабора.Ссылка КАК ПолныеДанные
	              |ИЗ
	              |	Документ.ПолныеДанныеЗаданияНабора КАК ПолныеДанныеЗаданияНабора
	              |ГДЕ
	              |	ПолныеДанныеЗаданияНабора.Товары.ШтрихКодFBS = &ШтрихКодFBS
	              |	И ПолныеДанныеЗаданияНабора.Дата >= &Дата
	              |	И ПолныеДанныеЗаданияНабора.Проведен";
	 запрос.УстановитьПараметр("ШтрихКодFBS",ШтрихКод);
	 запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	 
	 результат=запрос.Выполнить().Выбрать();
	 пока результат.Следующий() цикл
		 СтруктураВозврата.Задание=результат.задание;
		 СтруктураВозврата.ПолныеДанные=результат.полныеданные;
		 Возврат СтруктураВозврата;
	 КонецЦикла;
	 
	 возврат Неопределено;
	
КонецФункции
// Кухарь А.Ю.  24.03.2023 конец



// Кухарь А.Ю. 16.02.2021 начало
Функция      НайтиДокПоШК (ШК) 
	ТекСтр=СокрЛП(ШК);
	ТекСтр=Раскодировать64Локальный(ТекСтр);
	
	Если Сред(ТекСтр,1,1)<>"*" Тогда
		Сообщить("Штрих-код: """+ШК+""" не является штрих-кодом документа !");
		Возврат "";
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекСтр)=0 Тогда
		ТекСтр=Сред(ТекСтр,2,СтрДлина(ТекСтр)-2);
		ТекСтр=СтрЗаменить(ТекСтр,"*",Символы.ПС);
		
		СЗ=Новый Структура;
		
		Для Сч=1 По СтрЧислоСтрок(ТекСтр) Цикл
			СЗ.Вставить("Пар"+Сч,СтрПолучитьСтроку(ТекСтр,Сч));					
		КонецЦикла; 		
		
		Ид  	=СЗ.Пар1;
		Номер 	=СЗ.Пар2;         
		Дт  	=СЗ.Пар3;
		Дт  	=Дата("20"+Дт,1,1);
		
		Вид=ВидПоИДДокументаЛокальный(Ид);
		Если ПустаяСтрока(Вид)=1 Тогда
			Сообщить("Не обнаружен вид документа соответствующий ИД: """+Ид+""" !","!");     
			Возврат Неопределено;
		КонецЕсли;
		
		Док=Документы[Вид].НайтиПоНомеру(Номер,Дт);
		
		Если Док<>Неопределено И НЕ Док.Пустая() Тогда
			Возврат Док;   
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Неопределено;
КонецФункции

Функция ВидПоИДДокументаЛокальный(Ид)  
	Для Каждого МетаДок Из Метаданные.Документы Цикл
		Если МетаДок.Синоним=Ид Тогда
			Возврат МетаДок.Имя;
		КонецЕсли;	    
	КонецЦикла;    
	Возврат "";
КонецФункции 


Функция Раскодировать64Локальный(НачСтр) Экспорт 
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=СокрЛП(НачСтр);
	
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		Символ=Сред(Стр,Сч,1);
		Десятичное=Найти(База,Символ)-1;		
		СтрокаБит=СтрокаБит+Сред(БинарноеЛокальный(Десятичное),3);		
	КонецЦикла;
	//КодировкаПрямая=Новый Соответствие;
	КодировкаОбратная=Новый Соответствие;
	ЗаполнитьКодировкиЛокальное(КодировкаОбратная);        
	СтрокаИсходная="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение=Лев(СтрокаБит,8);
		СтрокаИсходная	=СтрокаИсходная+СимволПоБайтовомуКодуЛокальный(ДесятичноеЛокальное(БитовоеЗначение),КодировкаОбратная);			    
		СтрокаБит		=Сред(СтрокаБит,9);
	КонецЦикла;                      
	
	Возврат СтрокаИсходная;	    
КонецФункции //Раскодировать

Функция БайтовыйКодСимволаЛокальный(Символ,КодировкаПрямая) Экспорт
	Возврат КодировкаПрямая[Символ];
КонецФункции // КодСимвола()

Функция СимволПоБайтовомуКодуЛокальный(Код,КодировкаОбратная)
	Возврат КодировкаОбратная[Код];
КонецФункции // ()

Функция БинарноеЛокальный(НачЗн)
	Зн=НачЗн;	
	Стр="";	
	Для Сч=1 по 8 Цикл
		Бит=Зн%2;
		
		Стр=""+Бит+Стр;   
		Зн=(Зн-Бит)/2;		
	КонецЦикла;     
	
	Возврат Стр;
КонецФункции //

Функция ДесятичноеЛокальное(НачЗн)
	Зн=0;
	База=128;
	
	ТекДлинна=Мин(СтрДлина(НачЗн),8);
	
	Для Сч=1 по ТекДлинна Цикл
		Зн=Зн+База*Число(Сред(НачЗн,Сч,1));					    
		База=База/2;
	КонецЦикла;
	
	Возврат Зн;
КонецФункции //Десятичное

Процедура  ЗаполнитьКодировкиЛокальное(КодировкаОбратная)
	//КодировкаПрямая=Новый Соответствие;
	
	КодировкаОбратная.Вставить(32," ");
	КодировкаОбратная.Вставить(33,"!");
	КодировкаОбратная.Вставить(34,"""");
	КодировкаОбратная.Вставить(35,"#");
	КодировкаОбратная.Вставить(36,"$");
	КодировкаОбратная.Вставить(37,"%");
	КодировкаОбратная.Вставить(38,"&");
	КодировкаОбратная.Вставить(39,"'");
	КодировкаОбратная.Вставить(40,"(");
	КодировкаОбратная.Вставить(41,")");
	КодировкаОбратная.Вставить(42,"*");
	КодировкаОбратная.Вставить(43,"+");
	КодировкаОбратная.Вставить(44,",");
	КодировкаОбратная.Вставить(45,"-");
	КодировкаОбратная.Вставить(46,".");
	КодировкаОбратная.Вставить(47,"/");
	КодировкаОбратная.Вставить(48,"0");
	КодировкаОбратная.Вставить(49,"1");
	КодировкаОбратная.Вставить(50,"2");
	КодировкаОбратная.Вставить(51,"3");
	КодировкаОбратная.Вставить(52,"4");
	КодировкаОбратная.Вставить(53,"5");
	КодировкаОбратная.Вставить(54,"6");
	КодировкаОбратная.Вставить(55,"7");
	КодировкаОбратная.Вставить(56,"8");
	КодировкаОбратная.Вставить(57,"9");
	КодировкаОбратная.Вставить(58,":");
	КодировкаОбратная.Вставить(59,";");
	КодировкаОбратная.Вставить(60,"<");
	КодировкаОбратная.Вставить(61,"=");
	КодировкаОбратная.Вставить(62,">");
	КодировкаОбратная.Вставить(63,"?");
	КодировкаОбратная.Вставить(64,"@");
	КодировкаОбратная.Вставить(65,"A");
	КодировкаОбратная.Вставить(66,"B");
	КодировкаОбратная.Вставить(67,"C");
	КодировкаОбратная.Вставить(68,"D");
	КодировкаОбратная.Вставить(69,"E");
	КодировкаОбратная.Вставить(70,"F");
	КодировкаОбратная.Вставить(71,"G");
	КодировкаОбратная.Вставить(72,"H");
	КодировкаОбратная.Вставить(73,"I");
	КодировкаОбратная.Вставить(74,"J");
	КодировкаОбратная.Вставить(75,"K");
	КодировкаОбратная.Вставить(76,"L");
	КодировкаОбратная.Вставить(77,"M");
	КодировкаОбратная.Вставить(78,"N");
	КодировкаОбратная.Вставить(79,"O");
	КодировкаОбратная.Вставить(80,"P");
	КодировкаОбратная.Вставить(81,"Q");
	КодировкаОбратная.Вставить(82,"R");
	КодировкаОбратная.Вставить(83,"S");
	КодировкаОбратная.Вставить(84,"T");
	КодировкаОбратная.Вставить(85,"U");
	КодировкаОбратная.Вставить(86,"V");
	КодировкаОбратная.Вставить(87,"W");
	КодировкаОбратная.Вставить(88,"X");
	КодировкаОбратная.Вставить(89,"Y");
	КодировкаОбратная.Вставить(90,"Z");
	КодировкаОбратная.Вставить(91,"[");
	КодировкаОбратная.Вставить(92,"\");
	КодировкаОбратная.Вставить(93,"]");
	КодировкаОбратная.Вставить(94,"^");
	КодировкаОбратная.Вставить(95,"_");
	КодировкаОбратная.Вставить(96,"`");
	КодировкаОбратная.Вставить(97,"a");
	КодировкаОбратная.Вставить(98,"b");
	КодировкаОбратная.Вставить(99,"c");
	КодировкаОбратная.Вставить(100,"d");
	КодировкаОбратная.Вставить(101,"e");
	КодировкаОбратная.Вставить(102,"f");
	КодировкаОбратная.Вставить(103,"g");
	КодировкаОбратная.Вставить(104,"h");
	КодировкаОбратная.Вставить(105,"i");
	КодировкаОбратная.Вставить(106,"j");
	КодировкаОбратная.Вставить(107,"k");
	КодировкаОбратная.Вставить(108,"l");
	КодировкаОбратная.Вставить(109,"m");
	КодировкаОбратная.Вставить(110,"n");
	КодировкаОбратная.Вставить(111,"o");
	КодировкаОбратная.Вставить(112,"p");
	КодировкаОбратная.Вставить(113,"q");
	КодировкаОбратная.Вставить(114,"r");
	КодировкаОбратная.Вставить(115,"s");
	КодировкаОбратная.Вставить(116,"t");
	КодировкаОбратная.Вставить(117,"u");
	КодировкаОбратная.Вставить(118,"v");
	КодировкаОбратная.Вставить(119,"w");
	КодировкаОбратная.Вставить(120,"x");
	КодировкаОбратная.Вставить(121,"y");
	КодировкаОбратная.Вставить(122,"z");
	КодировкаОбратная.Вставить(123,"{");
	КодировкаОбратная.Вставить(124,"|");
	КодировкаОбратная.Вставить(125,"}");
	КодировкаОбратная.Вставить(126,"~");
	КодировкаОбратная.Вставить(127,"");
	КодировкаОбратная.Вставить(128,"Ђ");
	КодировкаОбратная.Вставить(129,"Ѓ");
	КодировкаОбратная.Вставить(130,"‚");
	КодировкаОбратная.Вставить(131,"ѓ");
	КодировкаОбратная.Вставить(132,"„");
	КодировкаОбратная.Вставить(133,"…");
	КодировкаОбратная.Вставить(134,"†");
	КодировкаОбратная.Вставить(135,"‡");
	КодировкаОбратная.Вставить(136,"€");
	КодировкаОбратная.Вставить(137,"‰");
	КодировкаОбратная.Вставить(138,"Љ");
	КодировкаОбратная.Вставить(139,"‹");
	КодировкаОбратная.Вставить(140,"Њ");
	КодировкаОбратная.Вставить(141,"Ќ");
	КодировкаОбратная.Вставить(142,"Ћ");
	КодировкаОбратная.Вставить(143,"Џ");
	КодировкаОбратная.Вставить(144,"ђ");
	КодировкаОбратная.Вставить(145,"‘");
	КодировкаОбратная.Вставить(146,"’");
	КодировкаОбратная.Вставить(147,"“");
	КодировкаОбратная.Вставить(148,"”");
	КодировкаОбратная.Вставить(149,"•");
	КодировкаОбратная.Вставить(150,"–");
	КодировкаОбратная.Вставить(151,"—");
	КодировкаОбратная.Вставить(152,"");
	КодировкаОбратная.Вставить(153,"™");
	КодировкаОбратная.Вставить(154,"љ");
	КодировкаОбратная.Вставить(155,"›");
	КодировкаОбратная.Вставить(156,"њ");
	КодировкаОбратная.Вставить(157,"ќ");
	КодировкаОбратная.Вставить(158,"ћ");
	КодировкаОбратная.Вставить(159,"џ");
	КодировкаОбратная.Вставить(160," ");
	КодировкаОбратная.Вставить(161,"Ў");
	КодировкаОбратная.Вставить(162,"ў");
	КодировкаОбратная.Вставить(163,"Ј");
	КодировкаОбратная.Вставить(164,"¤");
	КодировкаОбратная.Вставить(165,"Ґ");
	КодировкаОбратная.Вставить(166,"¦");
	КодировкаОбратная.Вставить(167,"§");
	КодировкаОбратная.Вставить(168,"Ё");
	КодировкаОбратная.Вставить(169,"©");
	КодировкаОбратная.Вставить(170,"Є");
	КодировкаОбратная.Вставить(171,"«");
	КодировкаОбратная.Вставить(172,"¬");
	КодировкаОбратная.Вставить(173,"");
	КодировкаОбратная.Вставить(174,"®");
	КодировкаОбратная.Вставить(175,"Ї");
	КодировкаОбратная.Вставить(176,"°");
	КодировкаОбратная.Вставить(177,"±");
	КодировкаОбратная.Вставить(178,"І");
	КодировкаОбратная.Вставить(179,"і");
	КодировкаОбратная.Вставить(180,"ґ");
	КодировкаОбратная.Вставить(181,"µ");
	КодировкаОбратная.Вставить(182,"¶");
	КодировкаОбратная.Вставить(183,"·");
	КодировкаОбратная.Вставить(184,"ё");
	КодировкаОбратная.Вставить(185,"№");
	КодировкаОбратная.Вставить(186,"є");
	КодировкаОбратная.Вставить(187,"»");
	КодировкаОбратная.Вставить(188,"ј");
	КодировкаОбратная.Вставить(189,"Ѕ");
	КодировкаОбратная.Вставить(190,"ѕ");
	КодировкаОбратная.Вставить(191,"ї");
	КодировкаОбратная.Вставить(192,"А");
	КодировкаОбратная.Вставить(193,"Б");
	КодировкаОбратная.Вставить(194,"В");
	КодировкаОбратная.Вставить(195,"Г");
	КодировкаОбратная.Вставить(196,"Д");
	КодировкаОбратная.Вставить(197,"Е");
	КодировкаОбратная.Вставить(198,"Ж");
	КодировкаОбратная.Вставить(199,"З");
	КодировкаОбратная.Вставить(200,"И");
	КодировкаОбратная.Вставить(201,"Й");
	КодировкаОбратная.Вставить(202,"К");
	КодировкаОбратная.Вставить(203,"Л");
	КодировкаОбратная.Вставить(204,"М");
	КодировкаОбратная.Вставить(205,"Н");
	КодировкаОбратная.Вставить(206,"О");
	КодировкаОбратная.Вставить(207,"П");
	КодировкаОбратная.Вставить(208,"Р");
	КодировкаОбратная.Вставить(209,"С");
	КодировкаОбратная.Вставить(210,"Т");
	КодировкаОбратная.Вставить(211,"У");
	КодировкаОбратная.Вставить(212,"Ф");
	КодировкаОбратная.Вставить(213,"Х");
	КодировкаОбратная.Вставить(214,"Ц");
	КодировкаОбратная.Вставить(215,"Ч");
	КодировкаОбратная.Вставить(216,"Ш");
	КодировкаОбратная.Вставить(217,"Щ");
	КодировкаОбратная.Вставить(218,"Ъ");
	КодировкаОбратная.Вставить(219,"Ы");
	КодировкаОбратная.Вставить(220,"Ь");
	КодировкаОбратная.Вставить(221,"Э");
	КодировкаОбратная.Вставить(222,"Ю");
	КодировкаОбратная.Вставить(223,"Я");
	КодировкаОбратная.Вставить(224,"а");
	КодировкаОбратная.Вставить(225,"б");
	КодировкаОбратная.Вставить(226,"в");
	КодировкаОбратная.Вставить(227,"г");
	КодировкаОбратная.Вставить(228,"д");
	КодировкаОбратная.Вставить(229,"е");
	КодировкаОбратная.Вставить(230,"ж");
	КодировкаОбратная.Вставить(231,"з");
	КодировкаОбратная.Вставить(232,"и");
	КодировкаОбратная.Вставить(233,"й");
	КодировкаОбратная.Вставить(234,"к");
	КодировкаОбратная.Вставить(235,"л");
	КодировкаОбратная.Вставить(236,"м");
	КодировкаОбратная.Вставить(237,"н");
	КодировкаОбратная.Вставить(238,"о");
	КодировкаОбратная.Вставить(239,"п");
	КодировкаОбратная.Вставить(240,"р");
	КодировкаОбратная.Вставить(241,"с");
	КодировкаОбратная.Вставить(242,"т");
	КодировкаОбратная.Вставить(243,"у");
	КодировкаОбратная.Вставить(244,"ф");
	КодировкаОбратная.Вставить(245,"х");
	КодировкаОбратная.Вставить(246,"ц");
	КодировкаОбратная.Вставить(247,"ч");
	КодировкаОбратная.Вставить(248,"ш");
	КодировкаОбратная.Вставить(249,"щ");
	КодировкаОбратная.Вставить(250,"ъ");
	КодировкаОбратная.Вставить(251,"ы");
	КодировкаОбратная.Вставить(252,"ь");
	КодировкаОбратная.Вставить(253,"э");
	КодировкаОбратная.Вставить(254,"ю");
	КодировкаОбратная.Вставить(255,"я");
	
	
	
КонецПроцедуры
// Кухарь А.Ю. 16.02.2021 конец

Функция ЗарегистрироватьНачальныеДанные(Узел) Экспорт 
	
	Запрос = Новый Запрос;
	
	// Кухарь А.Ю. 28.01.2022 начало
	//Нужны только физ. лица
	//   	запрос.Текст=  "ВЫБРАТЬ
	//|	Пользователи.Ссылка КАК Ссылка,
	//|	Пользователи.ФизЛицо КАК ФизЛицо
	//|ИЗ
	//|	Справочник.Пользователи КАК Пользователи
	//|ГДЕ
	//|	НЕ Пользователи.ЭтоГруппа
	//|	И НЕ Пользователи.ПометкаУдаления
	//|	И Пользователи.ФизЛицо В ИЕРАРХИИ(&Логистика)" ;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	НЕ ФизическиеЛица.ЭтоГруппа
	|	И НЕ ФизическиеЛица.ПометкаУдаления
	// Кельманов А.В. - HELP-7119 - 2025.09.19 {
	//|	И ФизическиеЛица.Ссылка В ИЕРАРХИИ(&Логистика)";	
	|	И (ФизическиеЛица.Ссылка В ИЕРАРХИИ (&Логистика)
	// Кельманов А.В. - Оптимизация работы - 2025.12.04 {
	|			ИЛИ ФизическиеЛица.Ссылка В ИЕРАРХИИ (&СкладЧасцы)	
	// Кельманов А.В. - Оптимизация работы - 2025.12.04 }
	|			ИЛИ ФизическиеЛица.Ссылка В ИЕРАРХИИ (&Аутсорсинг))";	
	// Кельманов А.В. - HELP-7119 - 2025.09.19 }
	// Кухарь А.Ю. 28.01.2022 конец
	
	Запрос.УстановитьПараметр("Логистика", Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00850"));
	Запрос.УстановитьПараметр("Аутсорсинг", Справочники.ФизическиеЛица.НайтиПоКоду("SNL-09056"));
	Запрос.УстановитьПараметр("СкладЧасцы", Справочники.ФизическиеЛица.НайтиПоКоду("SNL-09136")); // Кельманов А.В. - Оптимизация работы - 2025.12.04
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		//ПланыОбмена.ЗарегистрироватьИзменения(Узел,результат.ссылка);
		// Кухарь А.Ю. 28.01.2022 начало
		// 		ПланыОбмена.ЗарегистрироватьИзменения(Узел,результат.ФизЛицо);		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Результат.Ссылка);				 
		// Кухарь А.Ю. 28.01.2022 конец
		
	КонецЦикла;
	
	// Кухарь А.Ю. 06.04.2022 начало
	//Выгрузка типов коробов в ТСД
	СписокКоробов=новый СписокЗначений;
	СписокКоробов.Добавить(Справочники.ТипыКоробов.СтандартныеКороба);
	СписокКоробов.Добавить(Справочники.ТипыКоробов.ПустаяСсылка());
	
	запрос.текст="ВЫБРАТЬ
	|	ТипыКоробов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыКоробов КАК ТипыКоробов
	|ГДЕ
	|	ТипыКоробов.Родитель В(&СписокТиповКоробов)
	|	И ТипыКоробов.ШтрихКод <> """"""""
	|	И ПОДСТРОКА(ТипыКоробов.ШтрихКод, 1, 1) <> """"
	|	И НЕ ТипыКоробов.ПометкаУдаления
	|	И НЕ ТипыКоробов.ЭтоГруппа";
	запрос.УстановитьПараметр("СписокТиповКоробов",СписокКоробов);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел,результат.ссылка);				 		
	КонецЦикла;
	// Кухарь А.Ю. 06.04.2022 конец
	
	
	
КонецФункции

// Кельманов А.В. - ASU-1746 - 2025.02.11
Функция ЗарегистрироватьСправочникПринтерыЭтикеток(Узел) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПринтерыЭтикеток.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПринтерыЭтикеток КАК ПринтерыЭтикеток
	               |ГДЕ
	               |	НЕ ПринтерыЭтикеток.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Кухарь А.Ю. 19.02.2021 начало
Функция КонтролироватьШКПоМатрице (Накладная)
// Кухарь А.Ю.  06.08.2022 начало
// Пока что решили не грузить ШК матриц
   возврат ложь;
// Кухарь А.Ю.  06.08.2022 конец
	
	
	ЧастьНоменклатурыПоМатрице=ложь;
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЧастьНоменклатурыПоМатрице
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""ЧастьНоменклатурыПоМатрице"""; 
	запрос.УстановитьПараметр("Документ",Накладная);
	результат=запрос.Выполнить().выбрать();
	пока результат.Следующий() цикл
		если результат.ЧастьНоменклатурыПоМатрице=истина тогда
			возврат истина;
		КонецЕсли;
	КонецЦикла;
	
	если Накладная.Контрагент.ИспользоватьНоменклатурнуюМатрицу и не  Накладная.Договор.НеИспользоватьМатрицу тогда
		возврат Истина;
	КонецЕсли;
	
	возврат ложь;
КонецФункции
// Кухарь А.Ю. 19.02.2021 конец

// Кухарь А.Ю. 24.02.2021 начало
// Дополнительный обмен данными  
Процедура ЗаполнитьДополнительныеРеквизитыОбъектовТСД (ЧтениеXML,Фабрика,ДопПараметры=Неопределено)
	ТаблицаДополнительныеРеквизитыШапки=новый ТаблицаЗначений; ////Доп. реквизиты шапки 
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ИмяРеквизита");
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ЗначениеРеквизита");	
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ВидВладельца");	
	ТаблицаДополнительныеРеквизитыШапки.Колонки.Добавить("ВладелецРеквизита");	
	
	СтрокаXML=Фабрика.ПрочитатьXML(ЧтениеXML);
	если СтрокаXML.свойства().получить("СтрокаТаблицы") <>Неопределено	тогда
		если строка(СтрокаXML.строкатаблицы)<>"СписокXDTO" тогда
			СтрТЗ=ТаблицаДополнительныеРеквизитыШапки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрокаXML.строкатаблицы);		
		иначе
			Для каждого ТекСтрока из СтрокаXML.строкатаблицы цикл
				СтрТЗ=ТаблицаДополнительныеРеквизитыШапки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТЗ,ТекСтрока);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	ТаблицаДополнительныеРеквизитыТовары=новый ТаблицаЗначений;  ////Доп. реквизиты товаров 
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("КодНоменклатуры");
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ШККонтрагента");
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ШККонтрагентаДополнительный");
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ВидВладельца");
	ТаблицаДополнительныеРеквизитыТовары.Колонки.Добавить("ВладелецРеквизита");
	
	//СтрокаXML=Фабрика.ПрочитатьXML(ЧтениеXML);	
	//если СтрокаXML.свойства().получить("СтрокаТаблицы") <>Неопределено	тогда	
	//	если строка(СтрокаXML.строкатаблицы)<>"СписокXDTO" тогда
	//			СтрТЗ=ТаблицаДополнительныеРеквизитыТовары.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрокаXML.строкатаблицы);		
	//	иначе
	//		Для каждого ТекСтрока из СтрокаXML.строкатаблицы цикл
	//			СтрТЗ=ТаблицаДополнительныеРеквизитыТовары.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрТЗ,ТекСтрока);
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	
	ТЗОбъектов=ТаблицаДополнительныеРеквизитыШапки.Скопировать(,"ВидВладельца,ВладелецРеквизита");
	ТЗОбъектов.Свернуть("ВидВладельца,ВладелецРеквизита");
	СчЛН=0;
	ЗНБ=Неопределено;
	Для каждого СтрокаОбъектов из ТЗОбъектов цикл	
		Отбор=новый Структура("ВидВладельца,ВладелецРеквизита",СтрокаОбъектов.ВидВладельца,СтрокаОбъектов.ВладелецРеквизита);	
		
		
		
		
		ДокОбъект=Документы[СтрокаОбъектов.ВидВладельца].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОбъектов.ВладелецРеквизита)).получитьобъект(); //Изменения шапки
		
		если СтрокаОбъектов.ВидВладельца="ЛистНабора" тогда 
			СчЛН=СчЛН+1;
			если ЗНБ=Неопределено тогда
				
				если    ТипЗнч(ДокОбъект) <> Тип("ДокументОбъект.ЛистНабора") тогда
					ЗаписатьВЛог("Отладка","Не верный тип. Ожидался ЛН, а был "+Строка(ТипЗнч(ДокОбъект)),"Информация");
					Продолжить;
				КонецЕсли;
				
				если ДокОбъект.ЗаданияНабора.количество()>0 тогда
					ЗНБ=ДокОбъект.ЗаданияНабора.получить(0).ЗаданиеНабора;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МассивИзменений=ТаблицаДополнительныеРеквизитыШапки.НайтиСтроки(Отбор);
		Для каждого Изменение из МассивИзменений цикл
			// Кухарь А.Ю. 24.02.2021 начало
			// Тут будет пара исключений. 
			если Изменение.ИмяРеквизита = "ТипКороба" тогда
				ТипКороба=Справочники.ТипыКоробов.НайтиПоРеквизиту("ШтрихКод",Изменение.ЗначениеРеквизита);
				если ТипКороба.Пустая() тогда
					// Кухарь А.Ю. 31.03.2022 начало
					ЗаписатьВЛог("Отладка","Не найден тип короба по ШК "+Изменение.ЗначениеРеквизита+"...."+?(ДокОбъект=Неопределено," объект= неопределено",ДокОбъект),"Информация");			
					// Кухарь А.Ю. 31.03.2022 конец
					
					ТипКороба=Справочники.ТипыКоробов.ЗаведениеВручную;
				КонецЕсли;
				
				попытка 
					ДокОбъект.ТипКороба=ТипКороба;
				Исключение
					// Кухарь А.Ю. 31.03.2022 начало
					ЗаписатьВЛог("Отладка","Не удалось записть тип короба "+Изменение.ЗначениеРеквизита+"...."+?(ДокОбъект=Неопределено," объект= неопределено",ДокОбъект),"Информация");			
					// Кухарь А.Ю. 31.03.2022 конец
					
				КонецПопытки;
				Продолжить;
			КонецЕсли;
			// Кухарь А.Ю. 24.02.2021 конец
			
			ДокОбъект[Изменение.ИмяРеквизита]=Изменение.ЗначениеРеквизита;
		КонецЦикла;
		
		//МассивИзменений=ТаблицаДополнительныеРеквизитыТовары.НайтиСтроки(Отбор);    //Изменения товаров
		//если МассивИзменений.Количество()> 0 тогда		
		//	для каждого СтрТЧ из ДокОбъект.товары цикл
		//		МассСтрокДопРеквизитовТовары=ТаблицаДополнительныеРеквизитыТовары.НайтиСтроки(новый Структура("КодНоменклатуры,ВладелецРеквизита",СтрТЧ.Номенклатура.код,СтрокаОбъектов.ВладелецРеквизита));
		//		для каждого СтрокаДопРеквизитовТовары из МассСтрокДопРеквизитовТовары цикл
		//			ЗаполнитьЗначенияСвойств(СтрТЧ,СтрокаДопРеквизитовТовары);
		//		КонецЦикла;
		//	КонецЦикла;		
		//КонецЕсли;
		ДокОбъект.записать();
	КонецЦикла;
	
	
	если СчЛН>0 тогда
		Документы.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ);
	КонецЕсли;
КонецПроцедуры
// Кухарь А.Ю. 24.02.2021 конец

// Кухарь А.Ю. 07.04.2022 начало
// Выгрузка типа короба по запросу.
Функция ЗарегистрироватьТипКоробаПоШК (Узел,ШтрихКод,Ошибки)  Экспорт 
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыКоробов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыКоробов КАК ТипыКоробов
	|ГДЕ
	|	не ТипыКоробов.ПометкаУдаления
	|	И ТипыКоробов.ШтрихКод = &ШтрихКод";
	запрос.УстановитьПараметр("ШтрихКод",ШтрихКод);
	результат=запрос.Выполнить().Выбрать();
	
	
	пока результат.Следующий() цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел,результат.ссылка);	
		возврат Истина;
	КонецЦикла;	
	
	Ошибки=Ошибки+" не найден тип короба по ШК";
	Возврат ложь;
	
КонецФункции
// Кухарь А.Ю. 07.04.2022 конец

Функция ЗаписатьЛоги(УзелОбмена, ДанныеОбмена, ДопПараметры=Неопределено,ТекстОшибки="") Экспорт
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	КодУзда=УзелОбмена.код;
	
	МассивЗаписей=СтрЗаменить(ДанныеОбмена,"##",Символы.ПС);
	для сч=1 по СтрЧислоСтрок(МассивЗаписей) цикл
		ТекСтрока=СтрПолучитьСтроку(МассивЗаписей,сч);
		МассивАтрибутов=СтрЗаменить(ТекСтрока,"#",Символы.ПС);
		если СтрЧислоСтрок(МассивАтрибутов)<>3 тогда
			Продолжить;
		КонецЕсли;
		
		Период=СтрПолучитьСтроку(МассивАтрибутов,1);
		Действие=СтрПолучитьСтроку(МассивАтрибутов,2);
		Данные=СтрПолучитьСтроку(МассивАтрибутов,3);
		
		
		СтрокаЗаписи="Узел: "+КодУзда+", Дата "+Период+", Действие "+Действие+" ,Данные "+ Данные;
		ЗаписатьВЛог("Отладка",СтрокаЗаписи,"Информация");
		
	КонецЦикла;
	если ТранзакцияАктивна() тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;	
	
	
	
	Возврат Истина;
КонецФункции

// Кухарь А.Ю.  10.11.2022 начало
//
Функция ПолучитьНеобработанныеЛНТекущегоСотрудника (Сотрудник)
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЛистНабора.Ссылка КАК ЛН,
	|	ЛистНабора.Номер КАК Номер
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.Сканировщик = &Сотрудник
	|	И ЛистНабора.Дата >= &Дата
	|	И ЛистНабора.ТребуетПроверки";
	запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()-8*3600));
	Возврат запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьНеобработанныеЛНТекущейПроходнойНакладной (Накладная,Здание)
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЛистНабора.Ссылка КАК ЛН,
	|	ЛистНабора.Номер КАК Номер,
	|	ЛистНабора.Сканировщик КАК Сканировщик
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.Дата >= &Дата
	|	И ЛистНабора.ДокОснование = &Накладная
	|	И ЛистНабора.Здание = &Здание
	|	И ЛистНабора.ТребуетПроверки";
	запрос.УстановитьПараметр("Здание",Здание);
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("Дата",ТекущаяДата()-3*24*3600);
	Возврат запрос.Выполнить().Выгрузить();
	
КонецФункции
// Кухарь А.Ю.  10.11.2022 конец                   


// Кухарь А.Ю.  22.06.2025 начало  
Функция ЗарегистрироватьДанныеЗНА (СтруктураПараметров) экспорт  
	ШтрихКод			 = СтруктураПараметров.ШтрихКод;
	КоличествоКоробок	 = СтруктураПараметров.КоличествоКоробок;
	НужныТолькоЛП		 = СтруктураПараметров.НужныТолькоЛП;
	Узел		 		 = СтруктураПараметров.Узел;   
	Сканировщик 		 = Справочники.ФизическиеЛица.ПолучитьСсылку(новый УникальныйИдентификатор(СтруктураПараметров.Сканировщик));
	УИД_ЗНА				 = СтруктураПараметров.УИД_ЗНА;

	
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
	СтруктураВозврата = новый Структура("Успех,Ошибки",ложь, новый Массив);
	если ШтрихКод <> "" тогда 
		Попытка
			ЗНА = ЗначениеИзСтрокиВнутр(ШтрихКод);
		исключение                                
			СтруктураВозврата.Ошибки.Добавить("Не удалось найти ЗНА по ШК. "+ОписаниеОшибки());
			возврат СтруктураВозврата;
		КонецПопытки;    
	иначе
		Попытка
			ЗНА = Документы.ЗаданиеНаАгрегацию.ПолучитьСсылку(новый УникальныйИдентификатор(СтруктураПараметров.УИД_ЗНА));
		исключение                                
			СтруктураВозврата.Ошибки.Добавить("Не удалось найти ЗНА по УИД. "+ОписаниеОшибки());
			возврат СтруктураВозврата;
		КонецПопытки;  
	КонецЕсли;
	
	если ТипЗнч(ЗНА) <> Тип("ДокументСсылка.ЗаданиеНаАгрегацию") тогда  
		СтруктураВозврата.Ошибки.Добавить("Не правильный тип найденного ЗНА -"+Строка(ТипЗнч(ЗНА)));	
	КонецЕсли;
	
	
	Запрос = новый запрос;    
	Запрос.УстановитьПараметр("ЗНА", ЗНА);   
	Запрос.УстановитьПараметр("Узел", Узел);  	
	Запрос.Текст="ВЫБРАТЬ
	             |	ЛистПереукладки.Ссылка КАК Ссылка,
	             |	ЛистПереукладки.Представление КАК Представление
	             |ИЗ
	             |	Документ.ЛистПереукладки КАК ЛистПереукладки
	             |ГДЕ
	             |	ЛистПереукладки.УзелТСД = &Узел
	             |	И ЛистПереукладки.ОтправленНаТСД
	             |	И НЕ ЛистПереукладки.ЗагруженИзТСД
	             |	И ЛистПереукладки.Проведен
	             |	И ЛистПереукладки.ЗаданиеНаАгрегацию = &ЗНА";
	выборка = запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл                                         
		ЗаписатьВЛог("ЗагрузкаАгрегацийТСД",СтрШаблон("Возвращение в работу листа %1, с ТСД %2, Сканировщик %3",выборка.Представление,Строка(Узел),Строка(Сканировщик)),"Информация");
		документы.ЛистПереукладки.ВернутьЛистОтЗНАВРаботу(выборка.ссылка);
	КонецЦикла;
	
	если КоличествоКоробок > 0 тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛистПереукладки.Ссылка КАК Лист,
		|	ЛистПереукладки.КодАгрегации КАК КодАгрегации
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.ЗаданиеНаАгрегацию = &ЗНА
		|	И ЛистПереукладки.Проведен
		|	И НЕ ЛистПереукладки.ОтправленНаТСД
		|	И НЕ ЛистПереукладки.ЗагруженИзТСД
		|	И ЛистПереукладки.КодАгрегации <> Значение(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)	               
		|УПОРЯДОЧИТЬ ПО
		|	ЛистПереукладки.Дата";  
		Выборка = запрос.Выполнить().Выбрать();   
		
		если Выборка.Количество() = 0 тогда  
			СтруктураВозврата.Ошибки.Добавить("Не осталось свободных листов переукладки, для выполнения агрегации");  
			возврат СтруктураВозврата;
		КонецЕсли;     
		СчУспешноЗаписанныхЛистов = 0; 
		пока Выборка.Следующий() цикл
			ЛистОбъект = Выборка.Лист.ПолучитьОбъект();
			если ложь тогда ЛистОбъект = документы.ЛистПереукладки.СоздатьДокумент();КонецЕсли;
			
			попытка
				ЛистОбъект.Заблокировать();
			Исключение 
				Продолжить;
			КонецПопытки; 
			
			если ЛистОбъект.ОтправленНаТСД тогда
				Продолжить;
			КонецЕсли;     
			
			ЛистОбъект.ОтправленНаТСД	  = Истина;
			ЛистОбъект.УзелТСД		 	  = Узел;  
			ЛистОбъект.СканировщикФизЛицо = Сканировщик;
			ЛистОбъект.ПростоЗаписать();
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЛистОбъект.Ссылка);
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЛистОбъект.КодАгрегации);   
			
			// Кельманов А.В. - HELP-6412 - 2025.10.28 {
			Для Каждого СтрШКБлочков Из ЛистОбъект.ШтрихкодыУпаковокБлочков Цикл
				
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрШКБлочков.ШтрихкодУпаковки);
				
			КонецЦикла;
			// Кельманов А.В. - HELP-6412 - 2025.10.28 }
			
			СчУспешноЗаписанныхЛистов 		= СчУспешноЗаписанныхЛистов + 1;
			если СчУспешноЗаписанныхЛистов  = КоличествоКоробок тогда
				Прервать;
			КонецЕсли;   
			
		КонецЦикла;
		
		если СчУспешноЗаписанныхЛистов = 0 тогда  
			СтруктураВозврата.Ошибки.Добавить("Не удалось получить свободных листов переукладки, для выполнения агрегации. Попробуйте чуть позже.");
			возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;   
	
	
	если не НужныТолькоЛП тогда   //если последовательно загружают 1 листы от одного и того же ЗНА, то данные из этого блока  уже есть на ТСД.  
		
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЗНА);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТЧ.Номенклатура КАК Номенклатура,
		               |	ТЧ.Номенклатура.ОсновнаяЕдиница КАК ОсновнаяЕдиница,
		               |	ТЧ.Номенклатура.Цвет КАК Цвет,
		               |	ТЧ.Номенклатура.Размер КАК Размер
		               |ИЗ
		               |	Документ.ЗаданиеНаАгрегацию.Товары КАК ТЧ
		               |ГДЕ
		               |	ТЧ.Ссылка = &ЗНА";	
	
		ТЗПозиций = Запрос.Выполнить().Выгрузить();			
		Для Каждого СтрТЗ Из ТЗПозиций Цикл
			//ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Цвет);
			//ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Размер);
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.Номенклатура);	
			//ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрТЗ.ОсновнаяЕдиница);			
		КонецЦикла;
		
		СписокПозиций = ТЗПозиций.ВыгрузитьКолонку("Номенклатура");
		запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ШтрихКоды.Ссылка КАК Ссылка
		              |ИЗ
		              |	Справочник.ШтрихКоды КАК ШтрихКоды
		              |ГДЕ
		              |	ШтрихКоды.Владелец В(&Владелец)
		              |	И НЕ ШтрихКоды.ПометкаУдаления
		              |	И ПОДСТРОКА(ШтрихКоды.Наименование, 1, 7) <> ""9999999""
		              |	И ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)";
		запрос.УстановитьПараметр("Владелец",СписокПозиций);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел,результат.ссылка);	
		КонецЦикла;	
	КонецЕсли;
	
	
		
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда  
		СтруктураВозврата.Успех = Истина;
	КонецЕсли; 
	
	
	Возврат СтруктураВозврата;
КонецФункции


Функция ПроверитьЛистПереукладкиПередВыгрузкойИзТСД (ДанныеТСД) Экспорт
	
	СтруктураВозврата = новый Структура ("Успех,Данные,Ошибки",Истина,Неопределено, новый Массив);
	
	//Лист = Документы.ЛистПереукладки.ПолучитьСсылку(новый УникальныйИдентификатор(ДанныеТСД.Лист));   
	Лист = ДанныеТСД.Лист;          
	Узел = ДанныеТСД.Узел;
	
	РеквизитыШапки = ПолучитьРеквизитыШапки(Лист,"Дата","Документ");  
	
	//МассивКодов = новый Массив;
	//для каждого СтрокаМассива из ДанныеТСД.МассивШтучныхКодов тогда   
	//	МассивКодов.Добавить(Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(новый УникальныйИдентификатор(СтрокаМассива)));
	//КонецЦикла;      
	МассивКодов = ДанныеТСД.МассивШтучныхКодов;
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	|ГДЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка <> &Ссылка
	|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки В(&ШтрихкодУпаковки)
	|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки <> &ПустойШК
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Дата >= &Дата";
	запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());	
	запрос.УстановитьПараметр("ссылка",Лист);	
	запрос.УстановитьПараметр("Дата",РеквизитыШапки.Дата-3*86400);	
	запрос.УстановитьПараметр("ШтрихкодУпаковки",МассивКодов); 
	МассивДублейКодов = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	если МассивДублейКодов.Количество()>0 тогда
		СтруктураВозврата.Ошибки.Добавить("Обнаружены дубли кодов в других листах");
	КонецЕсли;    
	СтруктураВозврата.Данные = МассивДублейКодов;
	
	УзелЛиста = Строка(ПолучитьРеквизитШапки(Лист,"УзелТСД","Документ"));
	если ВРег(УзелЛиста)<> ВРег(Узел) тогда 
		СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Выгружаемый лист, уже загружен на другом ТСД %1. Удалите этот лист на главном меню агрегации и загрузите новый.",УзелЛиста));
	КонецЕсли;   
	если СтруктураВозврата.Ошибки.количество()> 0 тогда
		СтруктураВозврата.Успех = ложь;          
	КонецЕсли;
	
	возврат СтруктураВозврата;
КонецФункции


// Кухарь А.Ю.  22.06.2025 конец 

