
Процедура ПередЗаписью(Отказ, Замещение)
	//Катаев+ 07/02/14 Регистрация записи делается из ЛН
	//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//Катаев- 07/02/14   
	// +++ {Кузнецов Сергей Владимирович [22.06.2022]
	НадоВыгружать = Ложь;
	Если ОбменДанными.Загрузка Тогда
		НадоВыгружать = Ложь;
	Иначе 
		НадоВыгружать = Истина;
	КонецЕсли;
	Если НадоВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [22.06.2022]
КонецПроцедуры
