&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого Ссылка Из ПараметрКоманды Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		ПечатьОборотная(ТабДок, Ссылка);
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.Показать();
		
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПечатьОборотная(ТабДок, Ссылка)
	Документы.ПутевойЛист.ПечатьОборотная(ТабДок, Ссылка);
КонецПроцедуры
