
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	//
	//Если НЕ ОбменДанными.Загрузка Тогда
	//	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	//	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	//	
	//	Если Отказ Тогда Возврат КонецЕсли; 	
	//КонецЕсли;		
	//
	//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	ПараметрыСеанса.ЗапущенаОбработка = Истина;
	
	Ошибка = 0;
	
	Для каждого Текстрока из  товары цикл	
		
		Набор = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей();
		Набор.Отбор.GS1.Установить(Текстрока.ШК);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Для каждого ТекТИпШК из ТипыШК цикл
				Запрос = Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	ШтрихКоды.Ссылка КАК Ссылка,
				|	ШтрихКоды.Владелец КАК Владелец,
				|	ШтрихКоды.ТипШК КАК ТипШК,
				|	ШтрихКоды.ВидШК КАК ВидШК,
				|	ШтрихКоды.Наименование КАК Наименование
				|ИЗ
				|	Справочник.ШтрихКоды КАК ШтрихКоды
				|ГДЕ
				|	ШтрихКоды.Наименование = &текшк
				|	И ШтрихКоды.ТипШК = &типШк
				|	И ШтрихКоды.ВидШК = &видШк
				|	И ШтрихКоды.Владелец = &ном";
				Запрос.УстановитьПараметр("ТекШК",Строка(Текстрока.ШК));
				Запрос.УстановитьПараметр("ТипШК",ТекТипШК.типШК);
				Запрос.УстановитьПараметр("ВидШК",Текстрока.ВидШК);
				Запрос.УстановитьПараметр("Ном",Текстрока.Номенклатура);
				
				Рез = Запрос.Выполнить().Выбрать();
				Если рез.Следующий() тогда
					Если рез.ссылка.пометкаУдаления = ложь тогда
						продолжить;
					иначе
						шкОб = рез.Ссылка.получитьОбъект();
						ШкОб.пометкаудаления = ложь;
						ШкОб.записать();
						// сам регистр пометим на использование
						Запись = Набор[0];
						Запись.документУстановки = ЭтотОбъект.Ссылка;
						Запись.номенклатура = ТекСтрока.Номенклатура;
						Запись.датаустановки = текущаяДата();
						запись.присвоен = истина;
						Запись.автор = ЭтотОбъект.Автор; 
						Набор.Записать();
						
						
						продолжить;
					КонецЕсли;
				КонецЕсли;
				
				// создадим элемент справочника ШК НОМ.
				Попытка 
					НовШК = справочники.ШтрихКоды.СоздатьЭлемент();
					НовШК.ВидШК = ТекСТрока.видшк;
					НовШк.ТипШК = ТекТИпШк.типШК;
					НовШк.форматШК = перечисления.ФорматыШК.EAN13;
					
					НовШк.Владелец = текстрока.Номенклатура;
					НовШк.Наименование = Текстрока.ШК;
					НовШК.Описание =  "GS1";
					НовШК.Записать();
				Исключение
					Ошибка = 1;
					#если клиент тогда
						сообщить("Для строки "+Текстрока.НомерСтроки+" - не записан ШК. "+Текстрока.ШК+" Ошибка записи."+ОписаниеОшибки());
						
						сообщить("Проведение отменено");
					#конецесли
					
					отказ = истина;
				конецПопытки;
			конецЦикла;
			
			
			Если не Ошибка Тогда
				// сам регистр пометим на использование
				Запись = Набор[0];
				Запись.документУстановки = ЭтотОбъект.Ссылка;
				Запись.номенклатура = ТекСтрока.Номенклатура;
				Запись.датаустановки = текущаяДата();
				запись.присвоен = истина;
				Запись.автор = ЭтотОбъект.Автор; 
				Набор.Записать();
				
				//Отработан = истина;
				
			Иначе 
				прервать;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ПараметрыСеанса.ЗапущенаОбработка = Ложь;
	Если НЕ Отказ Тогда
		
		отработан = истина;
		ЭтотОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Для каждого Текстрока из  товары цикл	
		
		Набор = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей();
		Набор.Отбор.GS1.Установить(Текстрока.ШК);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Для каждого ТекТИпШК из ТипыШК цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	ШтрихКоды.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ШтрихКоды КАК ШтрихКоды
				|ГДЕ
				|	ШтрихКоды.Наименование = &текшк
				|	И ШтрихКоды.ТипШК = &типШк
				|	И ШтрихКоды.ВидШК = &видШк
				|	И ШтрихКоды.Владелец = &ном";
				Запрос.УстановитьПараметр("ТекШК",Строка(Текстрока.ШК));
				Запрос.УстановитьПараметр("ТипШК",ТекТипШк.типШК);
				Запрос.УстановитьПараметр("ВидШК",Текстрока.ВидШК);
				Запрос.УстановитьПараметр("Ном",Текстрока.Номенклатура);
				
				Рез = Запрос.Выполнить().Выбрать();
				Если рез.Следующий() тогда
					Если рез.ссылка.пометкаУдаления = истина тогда
						продолжить;
					иначе
						шкОб = рез.Ссылка.получитьОбъект();
						ШкОб.пометкаудаления = истина;
						ШкОб.записать();
						
						Запись = Набор[0];
						Запись.документУстановки = ЭтотОбъект.Ссылка;
						Запись.номенклатура = ТекСтрока.Номенклатура;
						Запись.датаустановки = дата(1,1,1);
						запись.присвоен = ложь;
						Запись.автор = ЭтотОбъект.Автор; 
						Набор.Записать();
						
						
						
						продолжить;
					КонецЕсли;
				конецЕсли;
				
			конецЦикла;
			Ошибка = 0;
			
			Если не Ошибка Тогда
				// сам регистр пометим на использование
				Запись = Набор[0];
				Запись.документУстановки = ЭтотОбъект.Ссылка;
				Запись.номенклатура = ТекСтрока.Номенклатура;
				Запись.датаустановки = дата(1,1,1);
				запись.присвоен = ложь;
				Запись.автор = ЭтотОбъект.Автор; 
				Набор.Записать();
				
			Иначе 
				прервать;
			КонецЕсли;
			
			
			
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	
	Для каждого Текстрока из товары цикл
		
		Текстрока.ШК = "";
		
	КонецЦикла;
	
КонецПроцедуры
