  #Область ПланыОбмена


Функция ЭтотУзел(ИмяПланаОбмена="") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена=ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ПланыОбмена[ИмяПланаОбмена].ЭтотУзел();	
КонецФункции //ЭтотУзел(ИмяПланаОбмена="ОбменСТЦ")

Функция ЭтотУзелКод(ИмяПланаОбмена="") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена=ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ПолучитьРеквизитШапки(ПланыОбмена[ИмяПланаОбмена].ЭтотУзел(),"Код","ПланОбмена");	
КонецФункции //ЭтотУзелКод(ИмяПланаОбмена="")

Функция УзелПолучательФранчБаза() Экспорт
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ ПланОбмена.ФР_ОбменСФРК ГДЕ НЕ Ссылка=&ЭтотУзел И НЕ ПометкаУдаления";
	Запрос.УстановитьПараметр("ЭтотУзел",ЭтотУзел());
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	Иначе
		Результат=Неопределено;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //УзелПолучательФранчБаза()

Функция УзелЦБ(Знач ИмяПланаОбмена) Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена=ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Результат	= ПланыОбмена[ИмяПланаОбмена].ПустаяСсылка();
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Ссылка 
	|ИЗ 
	|	ПланОбмена."+ИмяПланаОбмена+" 
	|ГДЕ 
	|	ТипУзла = ЗНАЧЕНИЕ(Перечисление.ТипУзлаИБ.ИнтегральнаяИБ)
	|	И НЕ ПометкаУдаления 
	|УПОРЯДОЧИТЬ ПО Код
	|";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат=Выборка.Ссылка;			
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции //ЭтотУзел(ИмяПланаОбмена="ОбменСТЦ")

Функция УзелПодразделения(Подразделение) Экспорт
	Результат = ПланыОбмена.Основной.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	ПланОбмена.Основной	
	|ГДЕ
	|	Подразделение=&Подразделение
	|УПОРЯДОЧИТЬ ПО 
	|	ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда		
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //УзелПодразделения(Подразделение) Экспорт
 
Функция ТипТекущегоУзла(ИмяПланаОбмена="ОбменСТЦ") Экспорт 
	Возврат ЭтотУзел(ИмяПланаОбмена).ТипУзла;	
КонецФункции //ТипТекущегоУзла(ИмяПланаОбмена="ОбменСТЦ") Экспорт

Функция ИмяПланаОбменаПоУмолчанию()
	Возврат "ФР_ОбменСФРК";
КонецФункции // ()

Функция ЭтоЦентальныйУзел(ИмяПланаОбмена="ОбменСТЦ") Экспорт
	Возврат (ТипТекущегоУзла(ИмяПланаОбмена)=Перечисления.ТипУзлаИБ.ИнтегральнаяИБ);
КонецФункции //ЭтоЦентальныйУзел(ИмяПланаОбмена="ОбменСТЦ")

Функция ОбъектХодитСнизуВверх(ИмяПланаОбмена,Знач ПолноеИмяТипа) Экспорт
	Результат		= Ложь;
	
	ПолноеИмяТипа	= РаспознатьимяТипа(ПолноеИмяТипа);	
	
	СписокТИпов	= ПланыОбмена[ИмяПланаОбмена].СписокТиповСнизуВверх();	
	
	Если СписокТИпов.Получить(ПолноеИмяТипа)<>Неопределено Тогда			
		Результат = Истина;
	Иначе
		Части		= СтрокуВСтруктуру(ПолноеИмяТипа,"Тип,Вид");
		Результат	= (СписокТИпов.Получить(Части.Тип+".*")<>Неопределено);		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ОбъектХодитСнизуВверх()

Функция ОбъектХодитСверхуВниз(ИмяПланаОбмена,Знач ПолноеИмяТипа) Экспорт
	Результат		= Ложь;
	
	ПолноеИмяТипа	= РаспознатьимяТипа(ПолноеИмяТипа);	
	
	СписокТИпов		= ПланыОбмена[ИмяПланаОбмена].СписокТиповСверхуВниз();	
	
	Если СписокТипов.Получить(ПолноеИмяТипа)<>Неопределено Тогда			
		Результат = Истина;
	Иначе
		Части		= СтрокуВСтруктуру(ПолноеИмяТипа,"Тип,Вид");
		Результат	= (СписокТипов.Получить(Части.Тип+".*")<>Неопределено);		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

Функция ОбъектХодитСверхуВнизДляСтарыхУзлов(ИмяПланаОбмена,Знач ПолноеИмяТипа) Экспорт
	Результат		= Ложь;
	
	ПолноеИмяТипа	= РаспознатьимяТипа(ПолноеИмяТипа);	
	
	СписокТИпов		= ПланыОбмена[ИмяПланаОбмена].СписокТиповСверхуВнизДляСтарыхУзлов();	
	
	Если СписокТипов.Получить(ПолноеИмяТипа)<>Неопределено Тогда			
		Результат = Истина;
	Иначе
		Части		= СтрокуВСтруктуру(ПолноеИмяТипа,"Тип,Вид");
		Результат	= (СписокТипов.Получить(Части.Тип+".*")<>Неопределено);		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

Функция ОбъектХодитТудаСюда(ИмяПланаОбмена,Знач ПолноеИмяТипа) Экспорт
	Результат		= Ложь;
	
	ПолноеИмяТипа	= РаспознатьимяТипа(ПолноеИмяТипа);	
	
	СписокТИпов		= ПланыОбмена[ИмяПланаОбмена].СписокТиповТудаСюда();	
	
	Если СписокТипов.Получить(ПолноеИмяТипа)<>Неопределено Тогда			
		Результат = Истина;
	Иначе
		Части		= СтрРазделить(ПолноеИмяТипа,".");
		Результат	= (СписокТипов.Получить(Части[0]+".*")<>Неопределено);		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

Функция ЕстьСтатусыОбмена(ПолноеИмяТипа) Экспорт	
	ОТ	= ОписаниеТипа(ПолноеИмяТипа);
	Возврат Метаданные.РегистрыСведений.ФР_СтатусыОбмена.Измерения.Объект.Тип.СодержитТип(Тип(ОТ.ИмяТипаСсылка));
КонецФункции //ЕстьСтатусыОбмена()

Функция ТекущаяИБ() Экспорт
	Возврат ПолучитьРеквизитШапки(ЭтотУзел("Основной"),"ИБ","ПланОбмена");
КонецФункции // ТекущаяИБ()



#КонецОбласти


#Область РаботаСТипами

Функция РаспознатьИмяТипа(Знач ПолноеИмяТипа) Экспорт
	Если Лев(ПолноеИмяТипа,1)="{" Тогда
		ПолноеИмяТипа=ЗначениеИзСтрокиВнутр(ПолноеИмяТипа);		
	КонецЕсли; 
	Если ТипЗнч(ПолноеИмяТипа)=Тип("Тип") Тогда
		МетаОбъект	= Метаданные.НайтиПоТипу(ПолноеИмяТипа);
		Если МетаОбъект<>Неопределено Тогда
			ПолноеИмяТипа	= МетаОбъект.ПолноеИмя();
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ПолноеИмяТипа;
КонецФункции

Функция ИмяТипаПоМенеджеру(Менеджер) Экспорт
	Возврат ЗначениеИзСтрокиВнутр(Менеджер).ПустаяСсылка().Метаданные().ПолноеИмя();
КонецФункции //ИмяТипаПоМенеджеру()

Функция ЭтоСсылка(ИмяТипаСтрВнутр) Экспорт
	Тип	= ЗначениеИзСтрокиВнутр(ИмяТипаСтрВнутр);
	ОТ	= ОписаниеТипа(ИмяТипаСтрВнутр);
	
	Возврат (ЗначениеЗаполнено(ОТ.ИмяТипаСсылка) И Тип=Тип(ОТ.ИмяТипаСсылка));
КонецФункции

Функция ТипУчавствуетВОбмене(ПолноеИмя) Экспорт
	Результат	= Ложь;
	МетаОбъект	= Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	
	Если МетаОбъект<>Неопределено И Метаданные.ПланыОбмена.ФР_ОбменСФРК.Состав.Содержит(МетаОбъект) Тогда
		Результат=Истина;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ТипУчавствуетВОбмене(Тип)

Функция ЭтоСсылочныйТип(ИмяТипаСтрВнутр) Экспорт	
	МетаТипыСтр	= "
	|Справочники,Документы,ПланыВидовХарактеристик,
	|ПланыСчетов,ПланыВидовРасчета,ПланыОбмена,БизнесПроцессы,
	|Задачи";
	Возврат ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,МетаТипыСтр);
КонецФункции

Функция ЭтоДокументТип(ИмяТипаСтрВнутр) Экспорт
	МетаТипыСтр	= "Документы";
	Возврат ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,МетаТипыСтр);	
КонецФункции // () 

Функция ЭтоСправочникТип(ИмяТипаСтрВнутр) Экспорт
	МетаТипыСтр	= "Справочники";
	Возврат ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,МетаТипыСтр);	
КонецФункции //ЭтоСправочникТип(ИмяТипаСтрВнутр) Экспорт

Функция ЭтоСправочникСГруппами(ИмяТипаСтрВнутр) Экспорт
	МетаОбъект	= Метаданные.НайтиПоТипу(ЗначениеИзСтрокиВнутр(ИмяТипаСтрВнутр));
	
	Результат	= (МетаОбъект<>Неопределено 
		И МетаОбъект.Иерархический 
		И МетаОбъект.ВидИерархии=Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);	
		
	Возврат Результат;
КонецФункции //ЭтоСправочникСГруппами(ИмяТипаСтрВнутр)

Функция ЭтоПвхСГруппами(ИмяТипаСтрВнутр) Экспорт
	МетаОбъект	= Метаданные.НайтиПоТипу(ЗначениеИзСтрокиВнутр(ИмяТипаСтрВнутр));
	
	Результат	= (МетаОбъект<>Неопределено И МетаОбъект.Иерархический);	
		
	Возврат Результат;
КонецФункции //ЭтоПвхСГруппами(ИмяТипаСтрВнутр)

Функция ЭтоПланОбменаТип(ИмяТипаСтрВнутр) Экспорт
	МетаТипыСтр	= "ПланыОбмена";	
	Возврат ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,МетаТипыСтр);	
КонецФункции //ЭтоПланОбменаТип(ИмяТипаСтрВнутр) Экспорт

Функция ЭтоПланВидовХарактеристикТип(ИмяТипаСтрВнутр) Экспорт	
	Возврат ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,"ПланыВидовХарактеристик");	
КонецФункции //ЭтоПланОбменаТип(ИмяТипаСтрВнутр) Экспорт

Функция ЭтоНаборЗаписейРС(ИмяТипаСтрВнутр) Экспорт		
	МетаТипыСтр	= "РегистрыСведений";
	Возврат ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,МетаТипыСтр);	
КонецФункции

Функция ТипПринадлежитМетаТипам(ПолноеИмяТипа,МетаТипыСтр)
	Результат	= Ложь;	
	
	МетаОбъект	= Метаданные.НайтиПоПолномуИмени(РаспознатьИмяТипа(ПолноеИмяТипа));
		
	Для Каждого МетаТип Из СтрРазделить(МетаТипыСтр,",") Цикл
		Если Метаданные[СокрЛП(МетаТип)].Содержит(МетаОбъект) Тогда
			Результат=Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ТипПринадлежитМетаТипам(ИмяТипаСтрВнутр,МетаТипыСтр) 

Функция ЕстьРеквизитДокумента_(ИмяРеквизита,Знач ПолноеИмяТипа)  Экспорт
	Если ТипЗнч(ПолноеИмяТипа)=Тип("Строка") Тогда
		ПолноеИмяТипа	= РаспознатьИмяТипа(ПолноеИмяТипа);
		МетаОбъект	= Метаданные.НайтиПоПолномуИмени(ПолноеИмяТипа);
	Иначе		
		МетаОбъект	= Метаданные.НайтиПоТипу(ПолноеИмяТипа);
	КонецЕсли;
	
	Возврат ?(МетаОбъект<>Неопределено,ЕстьРеквизитДокумента(ИмяРеквизита, МетаОбъект),Ложь);
КонецФункции //ЕстьРеквизитДокумента_(ИмяРеквизита,ИмяТипаСтрВнутр)  Экспорт

Функция ИмяТаблицы(ИмяТипаСтрВнутр) Экспорт	
	Результат	= "";
	
	Если ЗначениеЗаполнено(ИмяТипаСтрВнутр) Тогда	
		МетаОбъект	= Метаданные.НайтиПоТипу(ЗначениеИзСтрокиВнутр(ИмяТипаСтрВнутр));
		МетаТипы	= "Справочники,Документы,ПланыВидовХарактеристик,
		|ПланыСчетов,ПланыВидовРасчета,ПланыОбмена,БизнесПроцессы,
		|Задачи";
		
		Для Каждого МетаТип Из СтрРазделить(МетаТипы,",") Цикл
			Если Метаданные[СокрЛП(МетаТип)].Содержит(МетаОбъект) Тогда				
				Результат	= КлассЕЧ(СокрЛП(МетаТип))+"."+МетаОбъект.Имя;
				Прервать;
			КонецЕсли; 	
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ИмяТипа(ИмяТипаСтрВнутр,Вид=Неопределено) Экспорт	
	ИмяТаблицы	= ИмяТаблицы(ИмяТипаСтрВнутр);
	Части		= СтрРазделить(ИмяТаблицы,".");
	
	КлассЕЧ		= КлассЕЧ(Части[0]);
	
	Возврат КлассЕЧ+Вид+"."+Части[1]; 	
КонецФункции

Функция ИмяТипаПоПолномуТипу(ПолныйТип,Вид=Неопределено) Экспорт		
	Части		= СтрРазделить(ПолныйТип,".");
	
	КлассЕЧ		= КлассЕЧ(Части[0]);
	
	Возврат КлассЕЧ+Вид+"."+Части[1]; 	
КонецФункции

Функция КлассМЧ(Знач КлассИмя)
	Части	= СтрРазделить(КлассИмя,".");
	
	КлассИмя=Части[0];
	
	Результат = "";
	Если СтрНайти("Документы,Документ",КлассИмя)>0 Тогда
		Результат = "Документы";	
	ИначеЕсли СтрНайти("Справочники,Справочник",КлассИмя)>0 Тогда
		Результат = "Справочники";
	ИначеЕсли СтрНайти("РегистрыСведений,РегистрСведений",КлассИмя)>0 Тогда
		Результат = "РегистрыСведений";
	ИначеЕсли СтрНайти("РегистрыНакопления,РегистрНакопления",КлассИмя)>0 Тогда
		Результат = "РегистрыНакопления";		
	ИначеЕсли СтрНайти("ПланыВидовХарактеристик,ПланВидовХарактеристик",КлассИмя)>0 Тогда
		Результат = "ПланыВидовХарактеристик";
	ИначеЕсли СтрНайти("ПланОбмена,ПланыОбмена",КлассИмя)>0 Тогда		
		Результат = "ПланыОбмена";
	ИначеЕсли СтрНайти("ПланСчетов,ПланыСчетов",КлассИмя)>0 Тогда				
		Результат = "ПланыСчетов";
	ИначеЕсли СтрНайти("ПланВидовРасчета,ПланыВидовРасчета",КлассИмя)>0 Тогда
		Результат = "ПланыВидовРасчета";
	ИначеЕсли СтрНайти("БизнесПроцесс,БизнесПроцессы",КлассИмя)>0 Тогда		
		Результат = "БизнесПроцессы";
	ИначеЕсли СтрНайти("Задачи,Задача",КлассИмя)>0 Тогда
		Результат = "Задачи";	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()  

Функция КлассЕЧ(Знач КлассИмя)
	Части	= СтрРазделить(КлассИмя,".");
	
	КлассИмя=Части[0];
	
	Результат = "";
	Если СтрНайти("Документы,Документ",КлассИмя)>0 Тогда
		Результат = "Документ";	
	ИначеЕсли СтрНайти("Справочники,Справочник",КлассИмя)>0 Тогда
		Результат = "Справочник";
	ИначеЕсли СтрНайти("РегистрыСведений,РегистрСведений",КлассИмя)>0 Тогда
		Результат = "РегистрСведений";
	ИначеЕсли СтрНайти("РегистрыНакопления,РегистрНакопления",КлассИмя)>0 Тогда
		Результат = "РегистрНакопления";		
	ИначеЕсли СтрНайти("ПланыВидовХарактеристик,ПланВидовХарактеристик",КлассИмя)>0 Тогда
		Результат = "ПланВидовХарактеристик";
	ИначеЕсли СтрНайти("ПланОбмена,ПланыОбмена",КлассИмя)>0 Тогда		
		Результат = "ПланОбмена";
	ИначеЕсли СтрНайти("ПланСчетов,ПланыСчетов",КлассИмя)>0 Тогда				
		Результат = "ПланСчетов";
	ИначеЕсли СтрНайти("ПланВидовРасчета,ПланыВидовРасчета",КлассИмя)>0 Тогда
		Результат = "ПланВидовРасчета";
	ИначеЕсли СтрНайти("БизнесПроцесс,БизнесПроцессы",КлассИмя)>0 Тогда		
		Результат = "БизнесПроцесс";
	ИначеЕсли СтрНайти("Задачи,Задача",КлассИмя)>0 Тогда
		Результат = "Задача";	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()

Функция ОписаниеТипа(Знач ПолноеИмяТипа) Экспорт
	ПолноеИмяТипа =	 РаспознатьИмяТипа(ПолноеИмяТипа);
	
	Части	= СтрРазделить(ПолноеИмяТипа,".");
	
	КлассЕЧ	= КлассЕЧ(Части[0]);
	КлассМЧ	= КлассМЧ(Части[0]);
	
	Вид				= ?(Части.Количество()>1,Части[1],"");	
	ИмяТипаСсылка   = ?(ПустаяСтрока(Вид),"",КлассЕЧ+"Ссылка."+Вид);
	ИмяТипаОбъект   = ?(ПустаяСтрока(Вид),"",КлассЕЧ+"Объект."+Вид);
	ИмеетГруппы		= Ложь;
	
	Если КлассЕЧ="Справочник" Тогда		
		МетаОбъект=Метаданные.НайтиПоПолномуИмени(ПолноеИмяТипа);
		Если МетаОбъект.Иерархический И МетаОбъект.ВидИерархии=Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			ИмеетГруппы=Истина;								
		КонецЕсли; 
	ИначеЕсли КлассЕЧ="ПланВидовХарактеристик" Тогда		
		МетаОбъект=Метаданные.НайтиПоПолномуИмени(ПолноеИмяТипа);
		Если МетаОбъект.Иерархический Тогда
			ИмеетГруппы=Истина;								
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Новый Структура("ПолноеИмя,КлассЕЧ,КлассМЧ,Тип,Вид,ИмяТипаСсылка,ИмяТипаОбъект,ИмеетГруппы",ПолноеИмяТипа,КлассЕЧ,КлассМЧ,КлассЕЧ,Вид,ИмяТипаСсылка,ИмяТипаОбъект,ИмеетГруппы);	
КонецФункции //ОписаниеТипа(Знач ПолноеИмяТипа)

Функция ПолучитьМенеджер(Знач ПолныйТип) Экспорт
	ОписаниеТипа	= ОписаниеТипа(ПолныйТип);
	Результат		= Неопределено;
	
	Попытка	
		Результат=Вычислить(ОписаниеТипа.КлассМЧ+"."+ОписаниеТипа.Вид);	
	Исключение	
	КонецПопытки;
	
	Возврат Результат;
КонецФункции //ПолучитьМенеджер()

#КонецОбласти

Функция КаталогВнешнихОтчетов() Экспорт
	Стр	= СокрЛП(Константы.КаталогВнешнихОтчетов.Получить());
	Если Прав(Стр,1)<>"\" Тогда
		Стр=Стр+"\";			
	КонецЕсли; 
	
	Возврат Стр;
КонецФункции //КаталогВнешнихОтчетов()

Функция МожноЗапускатьАвтоОбмен() Экспорт  
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	Возврат ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза();
	//Кухарь А.Ю.  31.03.2026 конец
	
	
	Возврат (ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()))=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить())));
КонецФункции // ()

Функция БукваСостоянияНакладной_(СостояниеНакладной) Экспорт
	Возврат БукваСостоянияНакладной__(СостояниеНакладной);	
КонецФункции // ()

Функция БукваСостоянияНакладной__(Состояние)
	
	Если Состояние=Перечисления.СостоянияНакладной.ВРаботе Тогда
		Возврат "";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда
		Возврат "д";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
		Возврат "Д";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Сканирование Тогда
		Возврат "С";	
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ВНаборе Тогда
		Возврат "Н";
		//крохин начало 16.02.2012
		//новое состояние
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ДопОбработка Тогда
		Возврат "ДО";
		//крохин конец 16.02.2012
		//крохин начало 21.03.2013
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ВМашине Тогда
		Возврат "М";
		//крохин конец 21.03.2013
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке ИЛИ Состояние=Перечисления.СостоянияНакладной.ГотоваКПриемке Тогда
		Возврат "Г";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Отгружена Тогда
		Возврат "О";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
		Возврат "Т";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Принята Тогда
		Возврат "П";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.КОтправкеВОфис Тогда
		Возврат "ф";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ПолученоОфисом Тогда
		Возврат "Ф";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Доставлена Тогда
		Возврат "Д";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеОплаты Тогда
		Возврат "ОО";
		//крохин начало 11.12.2013
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
		Возврат "ОН";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеСканирования Тогда
		Возврат "ОС";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки Тогда
		Возврат "ОД";
		//крохин конец 11.12.2013
		//Кухарь 18.08.14 начало
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеПереукладки Тогда
		Возврат "ОУ";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Переукладка Тогда
		Возврат "У";	
		//Кухарь 18.08.14 конец
		//кухарь 12.11.14 начало
	ИначеЕсли  Состояние=Перечисления.СостоянияНакладной.ВЗонеХранения тогда
		возврат "ЗХ"
		//кухарь 12.11.14 конец
		//Кухарь 10.12.15 начало
		//Переименовали в ПроверенаПоОстаткам
		//ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ГотоваКНабору тогда
		//возврат "ГН";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ПроверенаПоОстаткам тогда
		возврат "ПО";
		//Кухарь 16.06.16 начало
		//Кухарь 27.12.17 начало
		//Термоусадка
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки тогда
		возврат "ОТ";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Термоусадка тогда
		возврат "ТУ";
		
		//Кухарь 27.12.17 конец		
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования тогда
		возврат "ОП";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Паллетирование тогда
		возврат "ПЛ";	
		//Кухарь 16.06.16  конец
	
		//Кухарь 10.12.15 конец
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.СформированыЗаданияНабора Тогда
		Возврат "ЗН";
	// Кухарь А.Ю. 06.04.2020 начало
	// Накладная ждёт что где-то что-то руками что-то поменяют, до этих пор штатная схема смены состояний отключается.
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеКорректировки Тогда
		Возврат "ОЖ"; 
	// Кухарь А.Ю. 06.04.2020 конец
		
	Иначе
		Возврат "н/у";		
	КонецЕсли;
	
КонецФункции


Функция СтрокуВСтруктуру(Строка,СтрПоля,Разделитель=",") Экспорт
	Части	= СтрРазделить(Строка,Разделитель);
	Поля	= СтрРазделить(СтрПоля,",");
	
	Результат	= Новый Структура;
	
	Для Сч=1 По Поля.Количество()  Цикл
		Инд=Сч-1;
		Если Сч<=Части.Количество() Тогда
			Результат.Вставить(Поля[Инд],Части[Инд]);
		Иначе
			Результат.Вставить(Поля[Инд],"");			
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ()

