
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КаталогВыгрузки = ХранилищеОбщихНастроек.Загрузить("Справочник.ФР_ПакетыДанных", "КаталогВыгрузки");	
	КаталогВыгрузки = ВыборКаталога_(КаталогВыгрузки);
	
	Если ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		ХранилищеОбщихНастроек.Сохранить("Справочник.ФР_ПакетыДанных", "КаталогВыгрузки", КаталогВыгрузки);
		
		Для Каждого Пакет Из ПараметрКоманды Цикл		          
			ИмяФайла = Справочники.ФР_ПакетыДанных.ИмяФайлаВыгрузки(Пакет);  
			ИмяФайла = МаркировкаК.ПолноеИмяФайла(КаталогВыгрузки, ИмяФайла);
			
			рВыгрузки = Справочники.ФР_ПакетыДанных.ВыгрузитьПакет(Пакет);			
			рВыгрузки.Данные.Записать(ИмяФайла);
			
			Сообщить("Сформирован файл: " + ИмяФайла, СтатусСообщения.Информация);
			
			ЗаписатьВремяВыгрузки(Пакет);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВремяВыгрузки(Пакет)
	РегистрыСведений.СостояниеПакетовОбмена.ОбновитьСтатусПакета(Пакет, Новый Структура("ДатаОтправки", ТекущаяДата()));
КонецПроцедуры

&НаКлиенте
Функция ВыборКаталога_(Каталог, ПроверятьСуществование = Ложь) Экспорт
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВФ = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогВФ.Заголовок						=	"Выберите каталог";
	ДиалогВФ.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	ДиалогВФ.Каталог						= 	Каталог;
	
	Результат = "";  
	Если ДиалогВФ.Выбрать() Тогда
		Результат = ДиалогВФ.Каталог;	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ВыборКаталога_(Каталог, ПроверятьСуществование = Ложь) Экспорт

