
#Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Ихсанов Д. А. Начало 16.06.2026 Изменение 0000000019 от 21.05.2026 13:00:05: e1cib/data/Документ.Изменение?ref=89690050568f680711f154fbd6fa2dc8
// Получить поля регистра.
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция ПолучитьПоляРегистра() Экспорт
	
	// Инициализация
	МассивПолей = Новый Массив;
	
	// Получим метаданные регистра сведений
	МетаданныеРегистра = Метаданные.РегистрыСведений.МП_ДанныеЗаказовСервиса;
	
	// Обработаем получение всех измерений регистра
	Для каждого Измерение из МетаданныеРегистра.Измерения Цикл
		МассивПолей.Добавить(Измерение.Имя);
	КонецЦикла;
	
	// Обработаем получение всех ресурсов регистра
	Для каждого Ресурс из МетаданныеРегистра.Ресурсы Цикл
		МассивПолей.Добавить(Ресурс.Имя);
	КонецЦикла;
	
	// Обработаем получение всех реквизитов регистра
	Для каждого Реквизит из МетаданныеРегистра.Реквизиты Цикл
		МассивПолей.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат МассивПолей;
	
КонецФункции // ПолучитьПоляРегистра()
// Ихсанов Д. А. Конец 16.06.2026

#КонецЕсли

#КонецОбласти
