Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Движения.ОстаткиГСМ.Записывать = Истина;
	Движение = Движения.ОстаткиГСМ.ДобавитьРасход();
	
	Движение.Период 	= Дата;
	Движение.Автомобиль = Автомобиль;	
	Движение.Количество = Количество;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПутевойЛист") Тогда		
		Автомобиль 	= ДанныеЗаполнения.Автомобиль;
		кДокументу	= ДанныеЗаполнения.Ссылка;
		Количество	= ДанныеЗаполнения.ОстатокТопливаВозврат;
		Дата		= ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры
