Перем НеКонтролироватьЗапись;
//крохин начало
Перем НовоеСостояниеЗаказа;
Перем ДатаГраницы;
//крохин конец

Процедура ОбновитьДанныеЗаказа() Экспорт
	НеКонтролироватьЗапись=Истина;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись=Ложь;	
КонецПроцедуры 

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		Если Очищать Тогда
			НаборЗаписей.Очистить();		
		КонецЕсли;		
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Процедура ПересчетДопРасходовПоИнвойсу() Экспорт	
	ДопРасходыПоИнвойсу=0;
	Для Каждого СтрокаДР Из Расходы Цикл
		ДопРасходыПоИнвойсу=ДопРасходыПоИнвойсу+глПересчет(СтрокаДР.Всего,СтрокаДР.Валюта,СтрокаДР.Курс,Валюта,Курс);	
	КонецЦикла;  
	Всего=Товары.Итог("Всего");	
	
	МаксРасходы=-10000000000000;
	СтрокаМаксРасходы=Неопределено;
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		Если Всего=0 Тогда
			СтрокаТЧ.ДопРасходыПоИнвойсу=0;
		Иначе
			СтрокаТЧ.ДопРасходыПоИнвойсу=СтрокаТЧ.Всего*ДопРасходыПоИнвойсу/Всего;		
		КонецЕсли;		
		Если СтрокаТЧ.ДопРасходыПоИнвойсу>МаксРасходы Тогда
			МаксРасходы=СтрокаТЧ.ДопРасходыПоИнвойсу;		
			СтрокаМаксРасходы=СтрокаТЧ;
		КонецЕсли;		
	КонецЦикла;	
	
	Хвост=ДопРасходыПоИнвойсу-Товары.Итог("ДопРасходыПоИнвойсу");
	Если Хвост<>0 И СтрокаМаксРасходы<>Неопределено Тогда
		СтрокаМаксРасходы.ДопРасходыПоИнвойсу=СтрокаМаксРасходы.ДопРасходыПоИнвойсу+Хвост;
	КонецЕсли; 
КонецПроцедуры

Процедура РасчетПроцента(СтрокаТЧ,КоэффициентКурса)
	СуммаИнвойса=СтрокаТЧ.Всего+СтрокаТЧ.ДопРасходыПоИнвойсу;
	Если СуммаИнвойса=0 Тогда
		СтрокаТЧ.ПроцентДопРасходовМашины=0;
	Иначе
		СтрокаТЧ.ПроцентДопРасходовМашины=100*КоэффициентКурса*СтрокаТЧ.ДопРасходыПоМашине/СуммаИнвойса;
	КонецЕсли;		
КонецПроцедуры 

Процедура ПересчетДопРасходовПоМашине() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Родитель.Родитель КАК Брэнд,
	|	НомерСтроки-1 КАК НомерСтроки,
	|	Всего+ДопРасходыПоИнвойсу КАК СуммаИнвойса,	
	|	0 КАК ДопРасходыПоМашине
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Заказ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Брэнд,
	|	-1,
	|	0,	
	|	ДопРасходы КАК ДопРасходыПоМашине
	|ИЗ Документ.Машина.РаспределениеРасходов
	|ГДЕ 
	|	Ссылка=&Машина И Заказ=&Заказ
	|ИТОГИ СУММА(СуммаИнвойса),СУММА(ДопРасходыПоМашине) ПО Брэнд";
	
	Запрос.УстановитьПараметр("Заказ",Ссылка);
	Запрос.УстановитьПараметр("Машина",Машина);
	
	ВалютаМашины=Машина.Валюта;
	КурсМашины	=Машина.Курс;
	
	Если ВалютаМашины<>Валюта Тогда
		КоэффициентКурса=глПересчет(100000,ВалютаМашины,КурсМашины,Валюта,Курс)/100000;
	Иначе
		КоэффициентКурса=1;		
	КонецЕсли; 
	
	ВыборкаПоБрэндам=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Брэнд");
	Пока ВыборкаПоБрэндам.Следующий() Цикл
		СуммаИнвойсаПоБрэнду		= ВыборкаПоБрэндам.СуммаИнвойса;
		ДопРасходыПоМашине			= ВыборкаПоБрэндам.ДопРасходыПоМашине;
		ДопРасходыПоМашинеСписано   = 0;
		
		МаксРасходы					= -10000000000000;
		СтрокаМаксРасходы			= Неопределено;
		
		ВыборкаПоСтрокам=ВыборкаПоБрэндам.Выбрать();
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			Если ВыборкаПоСтрокам.НомерСтроки<0 Тогда Продолжить КонецЕсли; 
			
			СтрокаТЧ=Товары.Получить(ВыборкаПоСтрокам.НомерСтроки);
			
			Если ВыборкаПоСтрокам.СуммаИнвойса=0 Тогда
				СтрокаТЧ.ДопРасходыПоМашине=0;
			Иначе
				СтрокаТЧ.ДопРасходыПоМашине=ВыборкаПоСтрокам.СуммаИнвойса*ДопРасходыПоМашине/СуммаИнвойсаПоБрэнду;		
			КонецЕсли;
			
			Если СтрокаТЧ.ДопРасходыПоМашине>МаксРасходы Тогда
				МаксРасходы=СтрокаТЧ.ДопРасходыПоМашине;		
				СтрокаМаксРасходы=СтрокаТЧ;
			КонецЕсли;		
			
			РасчетПроцента(СтрокаТЧ,КоэффициентКурса);
			
			ДопРасходыПоМашинеСписано=ДопРасходыПоМашинеСписано+СтрокаТЧ.ДопРасходыПоМашине;
		КонецЦикла; 
		
		Хвост=ДопРасходыПоМашине-ДопРасходыПоМашинеСписано;
		Если Хвост<>0 И СтрокаМаксРасходы<>Неопределено Тогда
			СтрокаМаксРасходы.ДопРасходыПоМашине=СтрокаМаксРасходы.ДопРасходыПоМашине+Хвост;
			РасчетПроцента(СтрокаТЧ,КоэффициентКурса);
		КонецЕсли; 
	КонецЦикла;
	
	
КонецПроцедуры

Процедура РасчетРублевыхЦенСтарая() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Родитель КАК Модель,
	|	НомерСтроки-1 КАК НомерСтроки,
	|	(Всего+ДопРасходыПоИнвойсу)*&КурсЗаказа+ДопРасходыПоМашине*&КурсМашины КАК Всего,
	|	Количество КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Заказ	
	|ИТОГИ СУММА(Всего),СУММА(Количество) ПО Модель";
	
	Запрос.УстановитьПараметр("Заказ",Ссылка);
	
	Запрос.УстановитьПараметр("КурсЗаказа",?(Валюта=ПараметрыСеанса.ВалютаУпр,1,Курс));	
	Запрос.УстановитьПараметр("КурсМашины",?(Машина.Валюта=ПараметрыСеанса.ВалютаУпр,1,Машина.Курс));	
	
	ВыборкаПоМоделям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
	Пока ВыборкаПоМоделям.Следующий() Цикл
		Если ВыборкаПоМоделям.Количество=0 Тогда Продолжить КонецЕсли; 
		
		ВыборкаПоСтрокам=ВыборкаПоМоделям.Выбрать();
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			СтрокаТЧ=Товары.Получить(ВыборкаПоСтрокам.НомерСтроки);		
			
			Если ВыборкаПоСтрокам.Количество=0 Тогда
				СтрокаТЧ.РасчетнаяЦена	=0;			
			Иначе				
				СтрокаТЧ.РасчетнаяЦена	=ВыборкаПоСтрокам.Всего/ВыборкаПоСтрокам.Количество;			
			КонецЕсли; 
			
			СтрокаТЧ.РасчетнаяСумма	=СтрокаТЧ.РасчетнаяЦена*СтрокаТЧ.Количество;
			//Кухарь 23.09.19 начало		
			//ПРоцент резерва теперь на разные строчки товаров разный.
			//		Если Машина.ПроцентРезерва<>0 Тогда
			//СтрокаТЧ.РасчетнаяСумма=СтрокаТЧ.РасчетнаяСумма*(1+Машина.ПроцентРезерва/100);	
			ПроцентРезерва=Машина.ПроцентРезерва;
			МассСтрокМашины=машина.РаспределениеРасходов.НайтиСтроки(новый Структура("Заказ,Брэнд",Ссылка,ВыборкаПоМоделям.модель.родитель));
			Для каждого СтрМасс из МассСтрокМашины цикл
				Процент=СтрМасс.ПроцентРезерва;
			КонецЦикла;
			
			Если ПроцентРезерва<>0 Тогда
				СтрокаТЧ.РасчетнаяСумма=СтрокаТЧ.РасчетнаяСумма*(1+ПроцентРезерва/100);	
				//Кухарь 23.09.19 конец	
				Если СтрокаТЧ.Количество<>0 Тогда
					СтрокаТЧ.РасчетнаяЦена=СтрокаТЧ.РасчетнаяСумма/СтрокаТЧ.Количество;								
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;		
	КонецЦикла;	
КонецПроцедуры

//нечаева 23,03,15++ добавила расчет валютных цен расчетных.
Процедура РасчетРублевыхЦен() Экспорт
	Запрос=Новый Запрос;
	// добавила расчет валютных сумм расчетных. и цену расчетную валютную
	//нечаева 23,03,15+++ Нечаева
	Запрос.Текст="ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель КАК Модель,
	|	ЗаказПоставщикуТовары.НомерСтроки - 1 КАК НомерСтроки,
	|	(ЗаказПоставщикуТовары.Всего + ЗаказПоставщикуТовары.ДопРасходыПоИнвойсу) * &КурсЗаказа + ЗаказПоставщикуТовары.ДопРасходыПоМашине * &КурсМашины КАК Всего,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА (НЕ &КурсМАшины = 1)
	|				И (НЕ &КурсЗаказа = 1) и ЗаказПоставщикуТовары.Ссылка.ОтгрузкаСТранзитногоСклада = ложь
	|			ТОГДА ЗаказПоставщикуТовары.Всего + ЗаказПоставщикуТовары.ДопРасходыПоИнвойсу + ЗаказПоставщикуТовары.ДопРасходыПоМашине
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВсегоВАл
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Заказ
	|ИТОГИ
	|	СУММА(Всего),
	|	СУММА(Количество),
	|	СУММА(ВсегоВАл)
	|ПО
	|	Модель";
	
	//нечаева 23,03,15--- Нечаева	
	
	Запрос.УстановитьПараметр("Заказ",Ссылка);
	
	Запрос.УстановитьПараметр("КурсЗаказа",?(Валюта=ПараметрыСеанса.ВалютаУпр,1,Курс));	
	Запрос.УстановитьПараметр("КурсМашины",?(Машина.Валюта=ПараметрыСеанса.ВалютаУпр,1,Машина.Курс));	
	
	ВыборкаПоМоделям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
	Пока ВыборкаПоМоделям.Следующий() Цикл
		Если ВыборкаПоМоделям.Количество=0 Тогда Продолжить КонецЕсли; 
		
		ВыборкаПоСтрокам=ВыборкаПоМоделям.Выбрать();
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			СтрокаТЧ=Товары.Получить(ВыборкаПоСтрокам.НомерСтроки);		
			
			Если ВыборкаПоСтрокам.Количество=0 Тогда
				СтрокаТЧ.РасчетнаяЦена	=0;			
				СтрокаТЧ.СуммаРасчетнаяВВалюте = 0;
			Иначе				
				СтрокаТЧ.РасчетнаяЦена	=ВыборкаПоСтрокам.Всего/ВыборкаПоСтрокам.Количество;
				//нечаева 23,03,15+++ Нечаева
				СтрокаТЧ.ЦенаРасчетнаяВВалюте = Окр(ВыборкаПоСтрокам.ВсегоВал/ВыборкаПоСтрокам.Количество,2,1);
				//нечаева 23,03,15--- Нечаева
				
			КонецЕсли; 
			
			СтрокаТЧ.РасчетнаяСумма	=СтрокаТЧ.РасчетнаяЦена*СтрокаТЧ.Количество;
			//нечаева 23,03,15+++ Нечаева
			СтрокаТЧ.СуммаРасчетнаяВВалюте	=СтрокаТЧ.ЦенаРасчетнаяВВалюте*СтрокаТЧ.Количество;
			//нечаева 23,03,15--- Нечаева
			
			//Кухарь 23.09.19 начало
			//Если Машина.ПроцентРезерва<>0 Тогда
			//СтрокаТЧ.РасчетнаяСумма=СтрокаТЧ.РасчетнаяСумма*(1+Машина.ПроцентРезерва/100);
			//СтрокаТЧ.СуммаРасчетнаяВВалюте=СтрокаТЧ.СуммаРасчетнаяВВалюте*(1+Машина.ПроцентРезерва/100);					
			ПроцентРезерва=Машина.ПроцентРезерва;
			МассСтрокМашины=машина.РаспределениеРасходов.НайтиСтроки(новый Структура("Заказ,Брэнд",Ссылка,ВыборкаПоМоделям.модель.родитель));
			Для каждого СтрМасс из МассСтрокМашины цикл
				ПроцентРезерва=СтрМасс.ПроцентРезерва;
				
				если ПроцентРезерва<>0 тогда					
					СтрокаТЧ.РасчетнаяСумма=СтрокаТЧ.РасчетнаяСумма*(1+ПроцентРезерва/100);
					СтрокаТЧ.СуммаРасчетнаяВВалюте=СтрокаТЧ.СуммаРасчетнаяВВалюте*(1+ПроцентРезерва/100);			
					//Кухарь 23.09.19 конец					
					Если СтрокаТЧ.Количество<>0 Тогда
						СтрокаТЧ.РасчетнаяЦена=СтрокаТЧ.РасчетнаяСумма/СтрокаТЧ.Количество;
						//нечаева 23,03,15+++ Нечаева
						СтрокаТЧ.ЦенаРасчетнаяВВалюте = СтрокаТЧ.СуммаРасчетнаяВВалюте/СтрокаТЧ.Количество;
						//нечаева 23,03,15--- Нечаева			
					КонецЕсли; 
				КонецЕсли; 
				//Кухарь 23.09.19 начало			
			КонецЦикла;
			//Кухарь 23.09.19 конец	
		КонецЦикла;		
	КонецЦикла;	
КонецПроцедуры


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Мессерле. Для Риги блокируем запись ЗПС не по их родному складу.Также надо будет позднее когда устаканится заблокировать ЗПС и в ЦО по складу Риги (как только начнут на складе все делать сами
	//Откючено- теперь (25.10.11) блокируется форма
	
	//Если НЕ ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение и  НЕ (ОтгрузкаСТранзитногоСклада и ЗначениеЗаполнено(ТранзитныйСклад) и ТранзитныйСклад.ТипСклада=Перечисления.ТипСклада.ВнешнийСклад) и НЕ ОбменДанными.Загрузка тогда
	//	Сообщить("Входящие ЗПС (контейнеры с Китая) не могут редактироваться на складе...");Отказ=Истина;Возврат;
	//Конецесли;
	
	
	Если НЕ Машина.Пустая() И НомерМашины<>Машина.НомерМашины Тогда
		НомерМашины=Машина.НомерМашины;	
	КонецЕсли; 
	
	ЕстьИзменения		=Модифицированность();	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если НеКонтролироватьЗапись Тогда
		Иначе
			//крохин начало
			//запрещено только редактирование из формы, обработками можно менять (при проведении ПНК)
			//			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			//крохин конец
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		КонецЕсли;	
		
		//Кухарь А.Ю.  12.03.2024 начало
		//ОрганизацияДоговора=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
		//если ЭтоНовый() тогда
		//	Организация=ОрганизацияДоговора;
		//иначе
		//	если ОрганизацияДоговора<>Организация тогда
		//		СообщитьИзМодуля("Не совпадает организация документа с организацией договора! Запись запрещена");
		//		Отказ=Истина
		//	КонецЕсли;
		//КонецЕсли;
		//Кухарь А.Ю.  12.03.2024 конец
		
		
		Если Отказ Тогда Возврат КонецЕсли;
		
		//+++Чирков 2024.03.03
		Если ЕстьИзменения Тогда
			ПередЗаписью_Маркировка();		
		КонецЕсли; 
		//---Чирков 2024.03.03
	КонецЕсли;	
	
	// Кухарь А.Ю.  15.03.2024 начало
	//
	если ЭтоНовый() тогда
		Организация=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
	КонецЕсли;
	// Кухарь А.Ю.  15.03.2024 конец
	
	
	Если ЕстьИзменения Тогда 
		//Михайловский 20230322 компенс +++
		Если Товары.Итог("Компенсация") Тогда
			СуммаДокумента		= Товары.Итог("ВсегоСКомпенсацией");
		Иначе	
			СуммаДокумента		= Товары.Итог("Всего");
		КонецЕсли;
		//Михайловский 20230322 компенс ---
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ПересчетДопРасходовПоИнвойсу();
		
		СуммаДокумента		= СуммаДокумента+ДопРасходыПоИнвойсу;
		РасчетнаяСумма		= Товары.Итог("РасчетнаяСумма");
		ДопРасходыПоМашине	= Товары.Итог("ДопРасходыПоМашине");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
		
		ПроверитьСоответствиеЗаявке(ЭтотОбъект);	
		//Катаев+ 05/12/13  Делаем проверку на остаток по партии
		//Катаев+ 12/03/14 Проверку на остаток делаем только для документа в которм есть документ сонование
		//крохин начало 13.03.2014
		//при загрузке ничего не проверяем
		//Если Не ДокОснование = неопределено Тогда
		Если (ДокОснование <> неопределено) И (НЕ ОбменДанными.Загрузка) Тогда
			//крохин конец 13.03.2014	
			Запрос = Новый запрос;
			//Катаев+ 16/01/14 в запросе добавил определение количества товарав регистре Партии по регистратору 
			//запрос.Текст=
			//"ВЫБРАТЬ
			//|	ПартииОстатки.Партия КАК им7,
			//|	ПартииОстатки.Номенклатура,
			//|	ПартииОстатки.ШтВКоробе,
			//|	СУММА(ПартииОстатки.КоличествоОстаток - ВЫБОР
			//|			КОГДА (НЕ ПартииРезерв.КоличествоОстаток ЕСТЬ NULL )
			//|				ТОГДА ПартииРезерв.КоличествоОстаток
			//|			ИНАЧЕ 0
			//|		КОНЕЦ) КАК Количество
			//|ИЗ
			//|	РегистрНакопления.Партии.Остатки(&Кон, Склад = &Склад) КАК ПартииОстатки
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Партии.Остатки(&Кон, Склад = &СкладРезерв) КАК ПартииРезерв
			//|		ПО ПартииОстатки.Номенклатура = ПартииРезерв.Номенклатура
			//|			И ПартииОстатки.Партия = ПартииРезерв.Партия
			//|			И ПартииОстатки.ШтВКоробе = ПартииРезерв.ШтВКоробе
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ПартииОстатки.Партия,
			//|	ПартииОстатки.Номенклатура,
			//|	ПартииОстатки.ШтВКоробе";
			Если ЭтоНовый() Тогда
				запрос.Текст=
				"ВЫБРАТЬ
				|	ПартииОстатки.Партия КАК им7,
				|	ПартииОстатки.Номенклатура,
				|	ПартииОстатки.ШтВКоробе,
				|	СУММА(ПартииОстатки.КоличествоОстаток - ВЫБОР
				|			КОГДА (НЕ ПартииРезерв.КоличествоОстаток ЕСТЬ NULL )
				|				ТОГДА ПартииРезерв.КоличествоОстаток
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК Количество,
				|	0 КАК КоличествоПоЗПС
				|ИЗ
				|	РегистрНакопления.Партии.Остатки(&Кон, Склад = &Склад) КАК ПартииОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Партии.Остатки(&Кон, Склад = &СкладРезерв) КАК ПартииРезерв
				|		ПО ПартииОстатки.Номенклатура = ПартииРезерв.Номенклатура
				|			И ПартииОстатки.Партия = ПартииРезерв.Партия
				|			И ПартииОстатки.ШтВКоробе = ПартииРезерв.ШтВКоробе
				|
				|СГРУППИРОВАТЬ ПО
				|	ПартииОстатки.Партия,
				|	ПартииОстатки.Номенклатура,
				|	ПартииОстатки.ШтВКоробе";
			Иначе
				запрос.Текст=
				"ВЫБРАТЬ
				|	ПартииОстатки.Партия КАК им7,
				|	ПартииОстатки.Номенклатура,
				|	ПартииОстатки.ШтВКоробе,
				|	СУММА(ПартииОстатки.КоличествоОстаток - ВЫБОР
				|			КОГДА (НЕ ПартииРезерв.КоличествоОстаток ЕСТЬ NULL )
				|				ТОГДА ПартииРезерв.КоличествоОстаток
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК Количество,
				|	0 КАК КоличествоПоЗПС
				|ИЗ
				|	РегистрНакопления.Партии.Остатки(&Кон, Склад = &Склад) КАК ПартииОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Партии.Остатки(&Кон, Склад = &СкладРезерв) КАК ПартииРезерв
				|		ПО ПартииОстатки.Номенклатура = ПартииРезерв.Номенклатура
				|			И ПартииОстатки.Партия = ПартииРезерв.Партия
				|			И ПартииОстатки.ШтВКоробе = ПартииРезерв.ШтВКоробе
				|
				|СГРУППИРОВАТЬ ПО
				|	ПартииОстатки.Партия,
				|	ПартииОстатки.Номенклатура,
				|	ПартииОстатки.ШтВКоробе
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Партии.Партия,
				|	Партии.Номенклатура,
				|	Партии.ШтВКоробе,
				|	0,
				|	ВЫБОР
				|		КОГДА Партии.Регистратор.Дата >= &Дата
				|			ТОГДА Партии.Количество
				|		ИНАЧЕ 0
				|	КОНЕЦ
				|ИЗ
				|	РегистрНакопления.Партии КАК Партии
				|ГДЕ
				|	Партии.Регистратор = &Регистратор
				|	И Партии.Склад = &Склад";
				Запрос.УстановитьПараметр("Регистратор",ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("Дата",Дата);
			КонецЕсли;
			//Катаев- 16/01/14
			
			//Катаев+ 16/01/14 
			//Запрос.УстановитьПараметр("Кон",Новый граница(Дата,видграницы.Исключая));
			Запрос.УстановитьПараметр("Кон",Новый граница(Дата,видграницы.Включая));
			//Катаев- 16/01/14
			Запрос.УстановитьПараметр("Склад",ТранзитныйСклад);
			Запрос.УстановитьПараметр("СкладРезерв",ТранзитныйСклад.СкладОтгрузкиТранзитом);
			Остпартий=Запрос.Выполнить().Выгрузить();
			Остпартий.Свернуть("им7,Номенклатура,ШтВКоробе","Количество,КоличествоПоЗПС");
			//Катаев+ 22/01/14 При создании ЗПС на основании КП
			//Катаев+ 06/02/14 Доработка по сборке
			//Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
				ПоКПП = Истина;
				//Катаев+ 03/04/14
				Регистратор = ДокОснование.Ссылка;
				//Катаев- 03/04/14
			ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Если ТипЗнч(ДокОснование.ДокОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") ТОгда
					//Катаев+ 03/04/14
					Регистратор = ДокОснование.ДокОснование.Ссылка;
					//Катаев+ 03/04/14
					ПоКПП = Истина;
				Иначе
					ПоКПП = Ложь;
				КонецЕсли;
			Иначе
				ПоКПП = Ложь;
			КонецЕсли;
			Если ПоКПП Тогда
				//Катаев- 06/02/14
				//Определяем остаток по контракту
				ЗапросКП = НОвый Запрос;
				ЗапросКП.Текст =
				"ВЫБРАТЬ
				|	Партии.Партия КАК им7,
				|	Партии.Номенклатура,
				|	Партии.ШтВКоробе,
				|	СУММА(Партии.Количество) КАК Количество
				|ИЗ
				|	РегистрНакопления.Партии КАК Партии
				|ГДЕ
				|	Партии.Склад = &СкладРезерв
				|	И Партии.Регистратор = &Регистратор
				|
				|СГРУППИРОВАТЬ ПО
				|	Партии.Партия,
				|	Партии.Номенклатура,
				|	Партии.ШтВКоробе";
				//Катаев+ 03/04/14
				//ЗапросКП.УстановитьПараметр("Регистратор", ДокОснование.Ссылка);
				ЗапросКП.УстановитьПараметр("Регистратор", Регистратор);
				//Катаев- 03/04/14
				ЗапросКП.УстановитьПараметр("СкладРезерв", ТранзитныйСклад.СкладОтгрузкиТранзитом);
				ОстРезерв = ЗапросКП.Выполнить().Выгрузить();
			КонецЕсли;
			//Катаев- 22/01/14
			Для Каждого стр из ТоварыПартии Цикл
				//Катаев+ 25/04/14 Пропускаем строки без количества
				Если стр.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				//Катаев- 25/04/14
				Отбор=новый структура;
				отбор.Вставить("Им7",стр.Им7);
				отбор.Вставить("Номенклатура",стр.Номенклатура);
				отбор.Вставить("ШтВкоробе",стр.ШтукВкоробе);
				НайденныеСтроки = Остпартий.НайтиСтроки(Отбор);
				//Катаев+ 22/01/14 При создании ЗПС на основании КП
				//Катаев+ 06/02/14 Доработка по сборке
				//Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
				Если ПоКПП Тогда
					//Катаев- 06/02/14
					ОтборРезерв=новый структура;
					ОтборРезерв.Вставить("Им7",стр.Им7);
					ОтборРезерв.Вставить("Номенклатура",стр.Номенклатура);
					//Катаев+ 24/02/14
					ОтборРезерв.Вставить("ШтВкоробе",стр.ШтукВкоробе);
					//Катаев- 24/02/14
					НайденныеСтрокиРезерв = ОстРезерв.НайтиСтроки(ОтборРезерв);
					Если НайденныеСтрокиРезерв.Количество() = 0 Тогда
						ЗарезервированоПоКП = 0;
					Иначе
						ЗарезервированоПоКП = НайденныеСтрокиРезерв[0].Количество;
					КонецЕсли;
				Иначе
					ЗарезервированоПоКП = 0;
				КонецЕсли;
				//Катаев- 22/01/14
				Если НайденныеСтроки.Количество() <> 0 Тогда
					//Катаев+ 16/01/14
					//Если НайденныеСтроки[0].Количество < 0 Тогда
					Если НайденныеСтроки[0].Количество+НайденныеСтроки[0].КоличествоПоЗПС+ЗарезервированоПоКП < стр.Количество Тогда
						//Катаев- 16/01/14
						Отказ = Истина;
						Сообщить("По номенклатуре "+стр.Номенклатура+" в партии "+стр.Им7+" недостаточно товара" );
					КонецЕсли;
				Иначе
					Если стр.Количество > ЗарезервированоПоКП Тогда
						Сообщить("По номенклатуре "+стр.Номенклатура+" в партии "+стр.Им7+" недостаточно товара" );
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
				//Катаев- 16/01/14
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Катаев- 05/12/13
	КонецЕсли;	
	
//крохин начало 03.09.2015
//временно закомментировал, так как инвойсы не печатаются, а жить мешает
	////кухарь 17.05.15 начало
	////разобьём партии по производителям
	////кухарь 30.06.15 начало
	////когда меняют склад ЗПСа на виртуальный делать перераспределять ничего не будем. 
	//если Склад.ВидСклада<>Перечисления.ВидСклада.Виртуальный тогда
	////кухарь 30.06.15 конец
	//	Разобьем=РазбитьПоПроизводителям();
	//	если не Разобьем тогда
	//		Отказ=Истина;
	//	КонецЕсли;	
	////кухарь 30.06.15 начало
	////когда меняют склад ЗПСа на виртуальный делать перераспределять ничего не будем. 
	//КонецЕсли;
	////кухарь 30.06.15 конец	
	////кухарь 17.05.15 конец	
 //крохин конец 03.09.2015
	//крохин начало 16.06.2011
	

	//крохин начало 26.04.2018
	Если НЕ Контейнер.Пустая() Тогда
		КонтейнерОбъект = Контейнер.ПолучитьОбъект();
		Если КонтейнерОбъект.ЗаказПоставщику <> Ссылка Тогда
		КонтейнерОбъект.ЗаказПоставщику = Ссылка;
	    КонецЕсли;
	//крохин начало 26.04.2018
		 Если ОтгрузкаСТранзитногоСклада Тогда
			 //КП (Китай) - ЗПС (Китай) - ПНК (Рига) - КП (Рига) - ЗПС (Рига) - ПНК (Часцы)
			 КонтейнерОбъект.КоличествоМестПересчет = КоличествоМестПересчет;
			 КонтейнерОбъект.КоличествоПересчет =  КоличествоПересчет;
			 КонтейнерОбъект.ВесПересчет =  ВесПересчет;
			 КонтейнерОбъект.ОбъемПересчет = ОбъемПересчет;
			 
			 КонтейнерОбъект.КоличествоМестПолучатель = КоличествоМестПолучатель;
			 КонтейнерОбъект.КоличествоПолучатель = КоличествоПолучатель;
			 КонтейнерОбъект.ВесПолучатель = ВесПолучатель;
			 КонтейнерОбъект.ОбъемПолучатель = ОбъемПолучатель;
		 Иначе
			 //КП - ЗПС - ПНК (Часцы)
			 КонтейнерОбъект.КоличествоМестПересчет = КоличествоМестПересчет;
			 КонтейнерОбъект.КоличествоПересчет =  КоличествоПересчет;
			 КонтейнерОбъект.ВесПересчет =  ВесПересчет;
			 КонтейнерОбъект.ОбъемПересчет = ОбъемПересчет;
			 
			 КонтейнерОбъект.КоличествоМестПолучатель = КоличествоМестПолучатель;
			 КонтейнерОбъект.КоличествоПолучатель = КоличествоПолучатель;
			 КонтейнерОбъект.ВесПолучатель = ВесПолучатель;
			 КонтейнерОбъект.ОбъемПолучатель = ОбъемПолучатель;

		 КонецЕсли;
	 
	 //крохин конец 26.04.2018
	    КонтейнерОбъект.Записать();
	КонецЕсли;
	//крохин конец 26.04.2018


	
	//регистрация изменений для Риги
	//10,07,12 Мессерле А.В. 
	Если Не ОбменДанными.Загрузка тогда 
		//10,07,12 Мессерле А.В. 
		ЕстьИзменения		=Модифицированность();	
		НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
		Если НужноВыгружать Тогда
			УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		КонецЕсли;
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		Если ЕстьИзменения Тогда
		
			ДатаИзменения = ТекущаяДатаСеанса(); 	
		
		КонецЕсли;
		//--Данилова Е.В. 13.03.2026 
	КонецЕсли;
	
	
	//Мессерле 28.05.12
	Если (Значениезаполнено(докОснование) и ТипЗнч(докоснование)=Тип("ДокументСсылка.ЗаказПоставщику")) Тогда 
		Если ДокОснование.дата>Дата тогда
			дата=докоснование.дата+10;		
			// Андреев И.Д. 05.09.2024 начало
			СообщитьИзМодуля("Дата документа основания "+ докоснование + " - " + докоснование.Дата +" Нельзя установить в этом документе более раннюю дату.");	 
			// Андреев И.Д. 05.09.2024 конец	
		Конецесли;	   
	Конецесли; 
	//++Данилова Е.В. 11.08.2025 HELP-6187
	Если ЕстьИзменения
		И Дата >= Дата(2025,07,01) Тогда
	
		ЗаполнитьТЧКомплектующие(); 	
	    ПроверитьТЧКомплектующие(Отказ); 
		
	КонецЕсли;
	//--Данилова Е.В. 11.08.2025
	//++Данилова Е.В. 25.09.2025 WEB-3705
	ПроставитьСостояниеПроверкиМарокНаТСД(); 
	//--Данилова Е.В. 25.09.2025
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	//крохин начало 18.02.2011
	//очистим ТЧ контракты
	КонтрактыСПроизводителем.Очистить();
	//крохин  конец 18.02.2011
	//крохин начало 14.05.2012
	Курс = 0;
	//крохин конец 14.05.2012
	Контракт = Неопределено;
	
	// Кухарь А.Ю.  15.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		Организация=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
	КонецЕсли;
	// Кухарь А.Ю.  15.03.2024 конец
	
КонецПроцедуры


Функция ПроводитьПоЗаказам(ДокСсылка)
	//крохин начало 15.02.2011
	//не проводим по заказам рижские ЗПС, к ним нет ЗАП/КП
	//	Если ДокСсылка.ОтгрузкаСТранзитногоСклада Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	//крохин конец 15.02.2011
	Если ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ
		ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути			
		ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Таможня    
		// Кухарь А.Ю.  12.02.2026 начало
		// OUT-196
		ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ГотовоКОтгрузке	
		// Кухарь А.Ю.  12.02.2026 конец
		
		ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Ликвидирован Тогда		
		
		Возврат Истина;
	Иначе
		Возврат Ложь;			
	КонецЕсли;
КонецФункции // ()


Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	ДвиженияПоРегистрам=Неопределено;
	
	Если СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути			
		ИЛИ СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Таможня     		
		ИЛИ СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Получен Тогда			
		ПроводитьПоПути=Истина;
	Иначе
		ПроводитьПоПути=Ложь;			
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Доллары		= Справочники.Валюты.НайтиПоКоду("840");
	Евро		= Справочники.Валюты.НайтиПоКоду("978");
	
	КурсВалюты	= ПолучитьКурсВалюты_ПоРусски(Валюта,Дата);
	
	ВалютаУпр	= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	КурсДоллара	= ПолучитьКурсВалюты(Доллары,Дата).Курс;
	КурсЕвро	= ПолучитьКурсВалюты(Евро,Дата).Курс;
	Рубли		= ПараметрыСеанса.ВалютаНац;
	
	Валюты_Курсы=Новый Структура("ВалютаДокумента,КурсДокумента,Рубли,Доллары,Евро,ВалютаНац,Евро,Доллары,КурсДоллара,КурсЕвро",Валюта,Курс,1,КурсДоллара,КурсЕвро,1,Справочники.Валюты.НайтиПоКоду("978"),Справочники.Валюты.НайтиПоКоду("840"),КурсДоллара,КурсЕвро);
	
	ПроводитьПоЗаказам	= ПроводитьПоЗаказам(Ссылка);
	
	Если Не Отказ Тогда		
		Если  СостояниеЗаказа<>Перечисления.СостоянияНакладной.ВРаботе и СостояниеЗаказа<>Перечисления.СостоянияНакладной.Сканирование и  ОтгрузкаСТранзитногоСклада 
			И ( ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ ПараметрыСеанса.ЭтотУзел.Код = ТранзитныйСклад.КодФизическогоУзла) Тогда
			ТаблицаСписания=Неопределено;
			
			РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТаблицаСписания);			
			Результат=РезультатПроведения["Результат"];
			
			Результат=РезультатПроведения["Результат"];
			
			Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда		
				Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
				
				ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));			
			КонецЕсли; 
			
			Если НЕ Отказ Тогда
				ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);						
			КонецЕсли;			
			
			ТаблицаСписания.Свернуть("Номенклатура","Количество,СписанаСтоимость");
			Если ПроводитьПоПути = Истина Тогда
				ТаблицаПути = Новый ТаблицаЗначений;
				ТаблицаПути.Колонки.Добавить("Номенклатура");
				ТаблицаПути.Колонки.Добавить("Количество");
				ТаблицаПути.Колонки.Добавить("Сумма");
				ТаблицаПути.Колонки.Добавить("СуммаПоставщика");
				
				Для Каждого СтрокаТЧ Из ТаблицаСписания Цикл	
					Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли;
					СтрокаТаблицыПути = ТаблицаПути.Добавить();
					СтрокаТаблицыПути.Номенклатура = СтрокаТЧ.Номенклатура;
					СтрокаТаблицыПути.Количество   = СтрокаТЧ.Количество;
					СтрокаТаблицыПути.Сумма		 = СтрокаТЧ.СписанаСтоимость;
					СтрокаТаблицыПути.СуммаПоставщика	=СтрокаТЧ.СписанаСтоимость;	
				КонецЦикла;
				ПровестиПоТоварамВПути(ТаблицаПути,ОбменДанными.Загрузка);
			КонецЕсли;
			Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда
				Если Дата < Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить() Тогда
					Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Установить(Дата);	
				КонецЕсли;
			КонецЕсли;
		Иначе
			ДвиженияПоВзаиморасчетам=Неопределено;
			РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,ОбменДанными.Загрузка);	
			ТекКонтрагент			=?(Контрагент.Ведущий.Пустая(),Контрагент,Контрагент.Ведущий);
			Если ЗначениеЗаполнено(КонтрагентКомпенсация) Тогда
				ВалютаУпр	= ПараметрыСеанса.ВалютаУпр_2009;
				КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
				СумКомпВал=Товары.Итог("Компенсация");
				СуммаУпр			=глПересчет(СумКомпВал,Валюта,Курс,ВалютаУпр,КурсУпр);
				Если СумКомпВал Тогда
					ДвидВзР1=Движения.Взаиморасчеты.Добавить();
					ДвидВзР1.ВидДвижения=ВидДвиженияНакопления.Расход;
					ДвидВзР1.Контрагент=ТекКонтрагент;
					ДвидВзР1.Договор=Договор;
					ДвидВзР1.Период=Дата;
					ДвидВзР1.СуммаВал=СумКомпВал;
					ДвидВзР1.СуммаУпр=СуммаУпр;
					ДвидВзР1.СуммаДокумента=СуммаДокумента;
					ДвидВзР1.Регистратор=Ссылка;
					ДвидВзР1.ВалютаДокумента=Валюта;
					
					ДвидВзР2=Движения.Взаиморасчеты.Добавить();
					ДвидВзР2.ВидДвижения=ВидДвиженияНакопления.Приход;
					ДвидВзР2.Контрагент=КонтрагентКомпенсация;
					ДвидВзР2.Договор=ДоговорКомпенсация;
					ДвидВзР2.Период=Дата;
					ДвидВзР2.СуммаВал=СумКомпВал;
					ДвидВзР2.СуммаУпр=СуммаУпр;
					ДвидВзР2.СуммаДокумента=СуммаДокумента;
					ДвидВзР2.Регистратор=Ссылка;
					ДвидВзР2.ВалютаДокумента=Валюта;
					
					//ВалютаДокумента
					Движения.Взаиморасчеты.Записать();
				КонецЕсли;	
			КонецЕсли;	
			Если ПроводитьПоПути Тогда
				
				ТаблицаПути = Новый ТаблицаЗначений;
				ТаблицаПути.Колонки.Добавить("Номенклатура");
				ТаблицаПути.Колонки.Добавить("Количество");
				ТаблицаПути.Колонки.Добавить("Сумма");
				ТаблицаПути.Колонки.Добавить("СуммаПоставщика");
				
				Для Каждого СтрокаТЧ Из Товары Цикл	
					Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли;
					СтрокаТаблицыПути = ТаблицаПути.Добавить();
					СтрокаТаблицыПути.Номенклатура = СтрокаТЧ.Номенклатура;
					СтрокаТаблицыПути.Количество   = СтрокаТЧ.Количество;
					СтрокаТаблицыПути.Сумма		 =глПересчет(СтрокаТЧ.Всего+СтрокаТЧ.ДопРасходыПоИнвойсу,Валюта,Курс,ВалютаУпр,КурсУпр);
					СтрокаТаблицыПути.СуммаПоставщика	=СтрокаТЧ.Всего;	
				КонецЦикла;		
				ПровестиПоТоварамВПути(ТаблицаПути,ОбменДанными.Загрузка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если СостояниеЗаказа<>Перечисления.СостоянияНакладной.ВРаботе и СостояниеЗаказа<>Перечисления.СостоянияНакладной.Сканирование и ОтгрузкаСТранзитногоСклада 
		и  ТоварыПартии.Количество()>0 И ( ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ ПараметрыСеанса.ЭтотУзел.Код = ТранзитныйСклад.КодФизическогоУзла) Тогда

		Если ТоварыПартии.итог("Количество")<>Товары.итог("Количество") тогда
			Сообщить(""+ссылка+"Разное количество по товарам и по партиям. Не должно проводиться!");
			Отказ=ИСТИНА;возврат;
		Конецесли;	
		Остатки = ПолучитьОстаткиПартий(ТоварыПартии,Дата);
		СписокВалютИм7 = ПолучитьВалютыПартий(ТоварыПартии.ВыгрузитьКолонку("Им7"));
		Для Каждого Стр Из ТоварыПартии Цикл
			Если стр.Количество>0 тогда
				если НЕ ЗначениеЗаполнено(стр.Номенклатура.Родитель.состав	) тогда
					Сообщить("У товара "+стр.номенклатура+" не задан состав!");
				Конецесли;	
				ДвижениеПоПартиям=Движения.Партии.Добавить();					
				ДвижениеПоПартиям.Период			=Дата;
				ДвижениеПоПартиям.ВидДвижения		=ВидДвиженияНакопления.Расход;
				ДвижениеПоПартиям.Партия			=Стр.Им7;
				ДвижениеПоПартиям.Склад				=ТранзитныйСклад;
				ДвижениеПоПартиям.ШтВКоробе			=стр.ШтукВКоробе;
				ДвижениеПоПартиям.Номенклатура		=Стр.Номенклатура;
				ДвижениеПоПартиям.Количество		=стр.Количество;
				ДвижениеПоПартиям.Производитель=Стр.Производитель;
				ТекОстатки		=Остатки.НайтиСтроки(Новый Структура("Номенклатура",Стр.Номенклатура));
				ТекСумма = 0;
				ТекВес = 0;
				ТекВесНетто = 0;
				ТекКоличество = 0;

				Для Каждого СтрокаОстатка Из ТекОстатки Цикл
					Если СтрокаОстатка.Им7 = Стр.Им7 Тогда
						ТекСумма  =ТекСумма	+СтрокаОстатка.Сумма;
						ТекВес = ТекВес + СтрокаОстатка.Брутто; 
						ТекВесНетто = ТекВесНетто + СтрокаОстатка.Нетто;
						ТекКоличество = ТекКоличество + СтрокаОстатка.Количество;
					КонецЕсли;
				КонецЦикла;	

				Если стр.Количество <>  0 Тогда
					если ТекКоличество<>стр.Количество тогда
						ДвижениеПоПартиям.Сумма = стр.Количество*ТекСумма/ТекКоличество;
						ДвижениеПоПартиям.Валюта = СписокВалютИм7.получить(Стр.Им7);
						ДвижениеПоПартиям.Вес =стр.Количество*ТекВес/ТекКоличество;
						ДвижениеПоПартиям.ВесНетто =стр.Количество*ТекВесНетто/ТекКоличество;	
					иначе
						ДвижениеПоПартиям.Сумма = ТекСумма;
						ДвижениеПоПартиям.Валюта = СписокВалютИм7.получить(Стр.Им7);
						ДвижениеПоПартиям.Вес =  ТекВес;
						ДвижениеПоПартиям.ВесНетто =ТекВесНетто;	
					КонецЕсли;				
				Иначе
					ДвижениеПоПартиям.Сумма = 0;
					ДвижениеПоПартиям.Валюта = СписокВалютИм7.получить(Стр.Им7);
					ДвижениеПоПартиям.Вес = 0;
					ДвижениеПоПартиям.ВесНетто = 0;	 
				КонецЕсли;
			Конецесли;
		КонецЦикла;

		Если значениезаполнено(контракт) тогда  //MESSERLE
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Склады.Ссылка
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	Склады.ФизическийСклад = &ФизическийСклад";
			Запрос.УстановитьПараметр("ФизическийСклад",ТранзитныйСклад);
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() и НЕ( (Значениезаполнено(докОснование) и ТипЗнч(докоснование)=Тип("ДокументСсылка.ЗаказПоставщику"))  ) Тогда  //или состояниезаказа=перечисления.СостояниеЗаказаПоставщику.ВРаботе
				СкладРезерв = Выборка.Ссылка;	
				Для Каждого Стр Из ТоварыПартии Цикл
					Если стр.Количество>0 тогда
						Если  Стр.ШтукВКоробе = 0 Тогда сообщить(""+Стр.Номенклатура+" "+Стр.Им7+" не задано количество в коробе!");Отказ=ИСТИНА; КонецЕсли;	
						ДвижениеПоПартиям=Движения.Партии.Добавить();					
						ДвижениеПоПартиям.Период			=Дата;
						ДвижениеПоПартиям.ВидДвижения		=ВидДвиженияНакопления.Расход;
						ДвижениеПоПартиям.Партия			=Стр.Им7;
						ДвижениеПоПартиям.Склад				=СкладРезерв;
						ДвижениеПоПартиям.ШтВКоробе			=стр.ШтукВКоробе;
						ДвижениеПоПартиям.Номенклатура		=Стр.Номенклатура;
						ДвижениеПоПартиям.Количество		=стр.Количество;
						
						ДвижениеПоПартиям.Сумма = 0;
						ДвижениеПоПартиям.Валюта = СписокВалютИм7.получить(Стр.Им7);
						ДвижениеПоПартиям.Вес = 0;
						ДвижениеПоПартиям.ВесНетто = 0;
						
						ДвижениеПоПартиям.Контракт          =Контракт;
					Конецесли;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
	иначе
		//++Данилова Е.В. 11.08.2025
		Если ПроводитьПоЗаказам Тогда				
			Если СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.Ликвидирован Тогда 
				ДвиженияПоЗаказамПоставщикам("Товары","ЗаказыПоставщикам");
				Если Дата >= Дата(2025,07,01) Тогда   	
					
					ДвиженияПоЗаказамПоставщикам("Комплектующие","ЗаказыПоставщикамШтуки");
					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		//добавляем движения по заказам поставщикам, Чирков отказался добавлять
		//Для Каждого СтрокаТЧ Из Товары Цикл
		//	Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
		//	
		//	Если ПроводитьПоЗаказам Тогда				
		//		Если СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.Ликвидирован Тогда
		//			Движение=Движения.ЗаказыПоставщикам.Добавить();			
		//			
		//			Движение.Период			=Дата;
		//			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		//			
		//			Движение.Склад			= Склад;
		//			Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
		//			Движение.Заказ			= Ссылка;
		//			
		//			Движение.Количество		= СтрокаТЧ.Количество;				
		//			Движение.СуммаРуб		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Рубли,Курс);
		//			Движение.СуммаEUR		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Евро,КурсЕвро);
		//			Движение.СуммаUSD		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Доллары,КурсДоллара);
		//			
		//			Движение.Отправитель	= Контрагент;
		//			Движение.Контракт          = СтрокаТЧ.ЗаявкаПоставщику.Контракт;
		//		КонецЕсли;							
		//	КонецЕсли;	
		//КонецЦикла;
		//--Данилова Е.В. 11.08.2025
		ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикам(Ссылка,Валюты_Курсы),ОбменДанными.Загрузка,Ложь);
		//++Данилова Е.В. 11.08.2025 HELP-6187 
		Если Дата >= Дата(2025,07,01) Тогда
			ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикамПоКомплектующим(Ссылка,Валюты_Курсы,истина,истина),ОбменДанными.Загрузка,Ложь);  
		КонецЕсли;
		//--Данилова Е.В. 11.08.2025
	Конецесли;	

	Если ОбменДанными.Загрузка Тогда
		
		Движения.Партии.Записать();
		
	КонецЕсли;
	Если Дата > '20110501' Тогда
		СформироватьДвиженияПоЗабалансовымРегистрам();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	
	РеквизитыОснования=Новый Структура("ИБ,Контрагент,Договор,Менеджер,Организация,Склад,ГруппыТоваров,ТипЦен,ТипСкидок,Скидка");
	ЗаполнитьЗначенияСвойств(РеквизитыОснования,Основание);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,РеквизитыОснования);	
	
	// Кухарь А.Ю.  15.03.2024 начало
	//
	если ЗначениеЗаполнено(Договор) тогда
		Организация=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
	КонецЕсли;
	// Кухарь А.Ю.  15.03.2024 конец
	
	
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");	
	//крохин начало
	//Для Каждого исхСтрокаТЧ Из Основание.Товары Цикл
	//	СтрокаТЧ = Товары.Добавить();		
	//	ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);		
	//	СтрокаТЧ.ЗаявкаПоставщику=Основание;
	//			
	//	Если СтрокаТЧ.Количество=0 Тогда
	//		Товары.Удалить(СтрокаТЧ);	
	//	Иначе
	//		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
	//	КонецЕсли; 
	//КонецЦикла;
	Если ДокОснование.Метаданные().Имя = "ЗаявкаНаПроизводство" ИЛИ ДокОснование.Метаданные().Имя = "КонтрактСПроизводителем" Тогда
		ОстаткиЗаказов=РегистрыНакопления.ЗаказыПоставщикам.Остатки(,Новый Структура("Заказ",Основание),"Номенклатура","Количество");     
		// Кухарь А.Ю. 31.10.2025 начало
		// HELP-7593
		Валюта = ПолучитьРеквизитШапки(ДокОснование,"Валюта","Документ");  
		Курс=ПолучитьКурсВалюты_ПоРусски(Валюта,ТекущаяДата());
		// Кухарь А.Ю. 31.10.2025 конец
		
		Для Каждого исхСтрокаТЧ Из Основание.Товары Цикл
			СтрокаОстатка=ОстаткиЗаказов.Найти(исхСтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаОстатка=Неопределено ИЛИ СтрокаОстатка.Количество<=0 Тогда Продолжить; КонецЕсли; 
			
			СтрокаТЧ = Товары.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			СтрокаТЧ.ЗаявкаПоставщику=Основание;
			
			СтрокаТЧ.Количество=СтрокаОстатка.Количество;
			СтрокаТЧ.Заявка =  СтрокаОстатка.Количество;
			СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаОстатка.Количество; 
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);				
		КонецЦикла;		
	Иначе
		
		Если ДокОснование.Метаданные().Имя <> "ЗаказПоставщику" Тогда //Заказ-основание только в Риге и должен бытьпустым
			
			
			Для Каждого исхСтрокаТЧ Из Основание.Товары Цикл
				СтрокаТЧ = Товары.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);		
				СтрокаТЧ.ЗаявкаПоставщику=Основание;
				
				Если СтрокаТЧ.Количество=0 Тогда
					Товары.Удалить(СтрокаТЧ);	
				Иначе
					РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
				КонецЕсли; 
			КонецЦикла;		
			
		Конецесли;
		
		Если ДокОснование.Метаданные().Имя  = "ПриходнаяНакладная" и  ЗначениеЗаполнено(ДокОснование.партия) Тогда //Заказ-основание только в Риге и должен бытьпустым
			
			отгрузкастранзитногосклада=ИСТИНА;
			ТранзитныйСклад=докоснование.склад;
			Для Каждого исхСтрокаТЧ Из Основание.Товары Цикл
				СтрокаТЧ = ТоварыПартии.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);		
				СтрокаТЧ.Им7=ДокОснование.партия;
				СтрокаТЧ.ШтукВКоробе=исхСтрокаТЧ.ШтВКоробе;
				Если СтрокаТЧ.Количество=0 Тогда
					ТоварыПартии.Удалить(СтрокаТЧ);	
				КонецЕсли; 
				
			КонецЦикла;		
			
		Конецесли;
		
	КонецЕсли;
	//крохин конец
	//крохин начало 25.05.2011
	//контракт
	
	Если  ДокОснование.Метаданные().Имя = "КонтрактСПроизводителем" Тогда
		Контракт = ДокОснование.Контракт;	
		//партии
		Если ДокОснование.Склад.ТипСклада = Перечисления.ТипСклада.ВнешнийСкладРезерв Тогда
			ОтгрузкаСТранзитногоСклада = Истина;
			ТранзитныйСклад = ДокОснование.Склад.ФизическийСклад;
			
			//ОстаткиПартий=РегистрыНакопления.Партии.Остатки(,Новый Структура("Контракт",Контракт),"Номенклатура,Партия,ШтВКоробе","Количество,Сумма");
			//Для Каждого СтрокаОстатковПартий Из ОстаткиПартий Цикл
			//	СтрокаТЧ = ТоварыПартии.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаОстатковПартий);
			//	СтрокаТЧ.Им7 = СтрокаОстатковПартий.Партия;
			//	СтрокаТЧ.ШтукВКоробе = СтрокаОстатковПартий.ШтВКоробе;
			//	Если СтрокаТЧ.Количество=0 Тогда
			//		ТоварыПартии.Удалить(СтрокаТЧ);	
			//	КонецЕсли; 
			//КонецЦикла;
			
			//Мессерле 12,07,2012, Поменял  на заполнение из ТЧ во избежание косяков
			тз=докоснование.товарыпартии.выгрузить();
			тз.Свернуть("Номенклатура,им7,ШтукВкоробе","Количество,Сумма");
			//  КолСтрок=тз.количество()-1;
			//Для ном=0 По КолСтрок-1 Цикл
			//	Если тз[КолСтрок-ном].Количество=0 тогда
			//		тз.удалить(КолСтрок-ном);
			//	Конецесли;
			//Конеццикла;		
			товарыпартии.Загрузить(тз);
			
			//Мессерле 12,07,2012, Поменял  на заполнение из ТЧ во избежание косяков
			
		КонецЕсли;
//крохин начало 07.10.2019	
//бред какой-то. Перезаполняется ТЧ товары, уже корректно заполненная остатками регистра "заказы поставщикам". 
//Да ещё и "Сумма" (без НДС) пишется в колонку "Всего", из-за чего цены становятся кривыми

	
		//Тз=ДокОснование.Товары.Выгрузить();
		//тз.Свернуть("Номенклатура","Количество,Сумма");
		//Товары.Загрузить(Тз);
		//для каждого стр из товары цикл
		//	если Стр.Количество>0 тогда	
		//		стр.Коэффициент=1;
		//		стр.Единица=стр.Номенклатура.ОсновнаяЕдиница;
		//		стр.Всего=стр.Сумма;
		//		стр.цена=стр.сумма/Стр.Количество;
		//		стр.ЦенаБезСкидки=стр.Цена;
		//		стр.СтавкаНДС=стр.Номенклатура.Родитель.СтавкаНДС;
		//		стр.Заявка=стр.Количество;
		//		стр.ПодтвержденнаяЗаявка=стр.Количество;
		//		//крохин начало 01.06.2011
		//		//ЗаявкаПоставщику
		//		стр.ЗаявкаПоставщику = ДокОснование;
		//		//крохин конец 01.06.2011
		//		
		//		РассчитатьСуммуТабЧасти(стр, ЭтотОбъект);
		//		//крохин начало 06.09.2013
		//		//количество равно 0
		//	Иначе
		//		стр.Коэффициент=1;
		//		стр.Единица=стр.Номенклатура.ОсновнаяЕдиница;
		//		стр.Всего=стр.Сумма;
		//		стр.цена=0;
		//		стр.ЦенаБезСкидки=0;
		//		стр.СтавкаНДС=стр.Номенклатура.Родитель.СтавкаНДС;
		//		стр.Заявка=стр.Количество;
		//		стр.ПодтвержденнаяЗаявка=стр.Количество;
		//		стр.ЗаявкаПоставщику = ДокОснование;				
		//		РассчитатьСуммуТабЧасти(стр, ЭтотОбъект);
		//		//крохин начало 06.09.2013
		//		//крохин конец 06.09.2013
		//	Конецесли;
		//Конеццикла;	
//крохин конец 07.10.2019		
	КонецЕсли;
	
	//крохин конец 25.05.2011
	
	
КонецПроцедуры

Процедура ПровестиПоТоварамВПути(ТаблицаСписания,ЗаписыватьДвижения=Ложь) Экспорт
	////  Если ЗаписыватьДвижения Тогда
	//	Движения.ТоварыВПути.Очистить();
	////  Конецесли;
	
	ВалютаУпр	= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	Для Каждого СтрокаТЧ Из ТаблицаСписания Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
		
		Движение=Движения.ТоварыВПути.Добавить();	
		
		Движение.Период=Дата;
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
		
		Движение.Заказ				=Ссылка;
		Движение.Номенклатура		=СтрокаТЧ.Номенклатура;
		
		Движение.Количество			=СтрокаТЧ.Количество;
		
		//	Если СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.ВРаботе Тогда
		Движение.Сумма				=строкаТЧ.Сумма;//глПересчет(СтрокаТЧ.Всего+СтрокаТЧ.ДопРасходыПоИнвойсу,Валюта,Курс,ВалютаУпр,КурсУпр);
		Движение.СуммаПоставщика	=СтрокаТЧ.СуммаПоставщика;//СтрокаТЧ.Всего;			
		//	КонецЕсли;			
		
	КонецЦикла;
	Если ЗаписыватьДвижения Тогда
		Движения.ТоварыВПути.Записать();
	Конецесли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоЗабалансовымРегистрам() 
	//Если СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ
	//	ИЛИ СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути			
	//	ИЛИ СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Получен Тогда 
	//ТЗ = ПолучитьТЗУпаковки(Товары);
	////минус резервы
	//Для Каждого СтрокаТЗ Из ТЗ Цикл 
	//Движение = Движения.РезервыТМЦзабаланс.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Заказ = СтрокаТЗ.Заказ;
	//Движение.Склад = СтрокаТЗ.Заказ.СкладУпаковки;
	//Движение.Номенклатура = СтрокаТЗ.номенклатура;
	//Движение.Количество = СтрокаТЗ.количество;
	//Движение.Период = Дата;
	//КонецЦикла;
	////минус остатки
	//Для Каждого СтрокаТЗ Из ТЗ Цикл 
	//Движение = Движения.ОстаткиТМЦзабаланс.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Склад = СтрокаТЗ.Заказ.СкладУпаковки;
	//Движение.Номенклатура = СтрокаТЗ.номенклатура;
	//Движение.Количество = СтрокаТЗ.количество;
	//Движение.Сумма = 0;
	//Движение.Период = Дата;
	//КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры
//кухарь 17.05.15 начало
//разобьём партии по производителям
Функция РазбитьПоПроизводителям()
	ТЗБезПроизводителей=ТоварыПартии.Выгрузить();
	ТЗСПроизводителями=ТоварыПартии.Выгрузить();
	ТЗСПроизводителями.Очистить();
	СписокПартий=ТЗБезПроизводителей.ВыгрузитьКолонку("Им7");
	СписокНоменклатуры=ТЗБезПроизводителей.ВыгрузитьКолонку("Номенклатура");
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПартииОстатки.Партия,
	|	ПартииОстатки.Номенклатура,
	|	ПартииОстатки.Склад,
	|	ПартииОстатки.ШтВКоробе,
	|	ПартииОстатки.Контракт,
	|	ПартииОстатки.Производитель,
	|	СУММА(ЕСТЬNULL(ПартииОстатки.КоличествоОстаток, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ПартииОстатки.СуммаОстаток, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ПартииОстатки.ВесОстаток, 0)) КАК Вес,
	|	СУММА(ЕСТЬNULL(ПартииОстатки.ВесНеттоОстаток, 0)) КАК ВесВсего
	|ИЗ
	|	РегистрНакопления.Партии.Остатки(
	|			&Дата,
	|			Партия В (&СписокПартий)
	|				И Номенклатура В (&СписокНоменклатуры)
	|				И склад = &Склад) КАК ПартииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииОстатки.Партия,
	|	ПартииОстатки.Номенклатура,
	|	ПартииОстатки.Склад,
	|	ПартииОстатки.ШтВКоробе,
	|	ПартииОстатки.Контракт,
	|	ПартииОстатки.ЛН,
	|	ПартииОстатки.Производитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	//кухарь 21.05.15 начало
	//если вид границы включая, остатков не хватает
	//Запрос.УстановитьПараметр("Дата",Новый граница(Дата,видграницы.Включая));
	Запрос.УстановитьПараметр("Дата",Новый граница(Дата,видграницы.Исключая));
	//кухарь 21.05.15 конец
	Запрос.УстановитьПараметр("Склад",ТранзитныйСклад);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	Запрос.УстановитьПараметр("СписокПартий",СписокПартий);
	результат=запрос.Выполнить().Выгрузить();
	
	для каждого СтрТЧ из  ТоварыПартии цикл
		Отбор=новый Структура;
		Отбор.Вставить("ШтВКоробе",СтрТЧ.ШтукВКоробе);
		Отбор.Вставить("Номенклатура",СтрТЧ.Номенклатура);
		Отбор.Вставить("Партия",СтрТЧ.Им7);
		
		НашлиОтбором=результат.НайтиСтроки(Отбор);
		если НашлиОтбором.Количество()=0 тогда
			СтрТЗ=ТЗСПроизводителями.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрТЧ);
		иначе
			если НашлиОтбором.Получить(0).Количество>=СтрТЧ.Количество тогда
				СтрТЗ=ТЗСПроизводителями.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТЗ,СтрТЧ);
				СтрТЗ.производитель=НашлиОтбором.Получить(0).Производитель;
			иначе
				СчКоличества=0;
				ОсталосьДобрать=СтрТЧ.Количество;
				Для каждого СтрФабрики из НашлиОтбором цикл
					СтрТЗ=ТЗСПроизводителями.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТЗ,СтрТЧ);
					СтрТЗ.производитель=НашлиОтбором.Получить(0).Производитель;
					
					если ОсталосьДобрать>=СтрФабрики.Количество тогда
						СтрТЗ.количество=СтрФабрики.Количество;
					иначе
						СтрТЗ.количество=ОсталосьДобрать;
					КонецЕсли;
					ОсталосьДобрать=ОсталосьДобрать-СтрТЗ.Количество;					
					если ОсталосьДобрать=0 тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;		
				если ОсталосьДобрать>0 тогда
					#Если КЛИЕНТ Тогда
						Сообщить("Сбой распределения по фабрикам, обратитесь в тех поддержку!");
						Возврат ложь;
					#КонецЕсли
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТоварыПартии.Очистить();
	ТоварыПартии.Загрузить(ТЗСПроизводителями);
	Возврат Истина;
КонецФункции

//кухарь 17.05.15 конец

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//крохин начало 23.12.2015
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение
		И (СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.ВПути) Тогда
		ЗаполнитьПервичнуюГруппуНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	//крохин конец 23.12.2015
КонецПроцедуры


#Область Маркировка


Процедура ПередЗаписью_Маркировка()
	ТребуетсяМаркировка = ТребуетсяМаркировка();
	Если СтатусМаркировки.Пустая() Тогда
		СтатусМаркировки = Перечисления.СтатусыДоков_Маркировка.ВРаботе;	
	КонецЕсли; 
КонецПроцедуры

Функция ТребуетсяМаркировка()	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка В(&мНоменклатура)
	|	И Родитель.ТНВЭД.ДатаНачалаРаботыСМаркировкой >= ДАТАВРЕМЯ(2000,1,1)
	// Кухарь А.Ю.  29.08.2024 начало
	//
	|И Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой < &Дата
	// Кухарь А.Ю.  29.08.2024 конец	
	|";
	// Кухарь А.Ю.  29.08.2024 начало
	//
	Запрос.УстановитьПараметр("Дата",Дата); 
	// Кухарь А.Ю.  29.08.2024 конец
	
	
	мНоменклатура = Новый Массив;
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Количество>0 Тогда
			мНоменклатура.Добавить(СтрокаТЧ.Номенклатура);					
		КонецЕсли;	
	КонецЦикла; 
	Запрос.УстановитьПараметр("мНоменклатура", мНоменклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Количество()>0);
КонецФункции // ()

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры


#КонецОбласти 

#Область Комплектующие 
//++Данилова Е.В. 11.08.2025 HELP-6187 
Процедура ЗаполнитьТЧКомплектующие()   
		
	//ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ЭтотОбъект,,,,истина);
	ЗаполнениеДокументов.ЗаполнитьТЧКомплектующиеСоСверткой(ЭтотОбъект,,,,истина);
	Для каждого СтрокаТЧ Из Товары Цикл
		
		ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ); 	
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику) Тогда
			
			СтрокиТЧ = Комплектующие.НайтиСтроки(Новый Структура("Продукция",СтрокаТЧ.Номенклатура)); 
			Для каждого СтрокаТЧКомпл Из СтрокиТЧ Цикл
				
				СтрокаТЧКомпл.ЗаявкаПоставщику = СтрокаТЧ.ЗаявкаПоставщику; 	
				
			КонецЦикла;
			
			
		КонецЕсли;

	КонецЦикла;
	
	//Сообщить("Была (пере)заполнена Табличная часть ""Комплектующие""");
		
КонецПроцедуры

Процедура ПроверитьТЧКомплектующие(Отказ)

	
	КоличествоКомплектующих = Комплектующие.Итог("Количество");
	
	КоличествоКомплектующихДляСверки = Товары.Итог("КоличествоКомплектующих");
	
	Если КоличествоКомплектующихДляСверки = 0 Тогда
		Для каждого СтрокаТЧ из Товары цикл
			ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
		КонецЦикла;			
	КонецЕсли;
	
	Если не ОбменДанными.Загрузка тогда
		Если Товары.Итог("КоличествоКомплектующих") <> Комплектующие.Итог("Количество") тогда
			СообщитьИзМодуля("Не совпадает количество комплектующих в таблице состав и в таблице комплектующие");
			Отказ = Истина; 
		КонецЕсли;
		
		//ТЧНоменклатура = Товары.Выгрузить(,"Номенклатура");
		//ТЧНоменклатура.Свернуть("Номенклатура"); 
		МассивНоменклатуры = ПолучитьМассивНоменклатуры("Товары","Номенклатура");//ТЧНоменклатура.ВыгрузитьКолонку("Номенклатура"); 
		
		//ТЧПродукции = Комплектующие.Выгрузить(,"Продукция"); 
		//ТЧПродукции.Свернуть("Продукция"); 	
		
		МассивПродукции = ПолучитьМассивНоменклатуры("Комплектующие","Продукция");//ТЧПродукции.ВыгрузитьКолонку("Продукция");
		
		Если МассивНоменклатуры.Количество() <>  МассивПродукции.Количество() Тогда
			
			Отказ = истина; 
			Сообщить("Не совпадает номенклатура на закладке Состав и Комплектующие");
		Иначе 
			Для каждого ЭлементТовара Из МассивНоменклатуры Цикл
				
				Если МассивПродукции.Найти(ЭлементТовара) = неопределено Тогда
					
					Отказ = Истина; 	
					
					Сообщить("Не совпадает номенклатура на закладке Состав:" +Строка(ЭлементТовара)  + " и Комплектующие: не найдено");
					
				КонецЕсли;	
				
			КонецЦикла; 
			
			Для каждого ЭлементТовара Из МассивПродукции Цикл
				
				Если МассивНоменклатуры.Найти(ЭлементТовара) = неопределено Тогда
					
					Отказ = Истина; 	
					
					Сообщить("Не совпадает номенклатура на закладке Комплектующие:" +Строка(ЭлементТовара)  + " и Состав: не найдено");
					
				КонецЕсли;	
				
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;                                
	

КонецПроцедуры

Процедура ДвиженияПоЗаказамПоставщикам(ИмяТЧДляДвижений,ИмяРНакопления)

	Доллары		= Справочники.Валюты.НайтиПоКоду("840");
	Евро		= Справочники.Валюты.НайтиПоКоду("978");
	
	КурсВалюты	= ПолучитьКурсВалюты_ПоРусски(Валюта,Дата);
	
	ВалютаУпр	= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	КурсДоллара	= ПолучитьКурсВалюты(Доллары,Дата).Курс;
	КурсЕвро	= ПолучитьКурсВалюты(Евро,Дата).Курс;
	Рубли		= ПараметрыСеанса.ВалютаНац;
	
	Валюты_Курсы=Новый Структура("ВалютаДокумента,КурсДокумента,Рубли,Доллары,Евро,ВалютаНац,Евро,Доллары,КурсДоллара,КурсЕвро",Валюта,Курс,1,КурсДоллара,КурсЕвро,1,Справочники.Валюты.НайтиПоКоду("978"),Справочники.Валюты.НайтиПоКоду("840"),КурсДоллара,КурсЕвро);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
		|	ЗаказПоставщикуТовары.Единица КАК Единица,
		|	ЗаказПоставщикуТовары.Коэффициент КАК Коэффициент,
		|	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК Цена,
		|	СУММА(ЗаказПоставщикуТовары.Сумма) КАК Сумма,
		|	ЗаказПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЗаказПоставщикуТовары.НДС) КАК НДС,
		|	СУММА(ЗаказПоставщикуТовары.Всего) КАК Всего,
		|	ЗаказПоставщикуТовары.ЗаявкаПоставщику КАК ЗаявкаПоставщику
		|ИЗ
		|	Документ.ЗаказПоставщику.%ИмяТЧДляДвижений% КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка
		|	И ЗаказПоставщикуТовары.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.СтавкаНДС,
		|	ЗаказПоставщикуТовары.ЗаявкаПоставщику,
		|	ЗаказПоставщикуТовары.Единица,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Коэффициент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяТЧДляДвижений%",ИмяТЧДляДвижений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаТЧ = РезультатЗапроса.Выбрать();
	
	Пока СтрокаТЧ.Следующий() Цикл 
		
		Движение=Движения[ИмяРНакопления].Добавить();			
		
		Движение.Период			=Дата;
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.Склад			= Склад;
		Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
		Движение.Заказ			= Ссылка;
		
		Движение.Количество		= СтрокаТЧ.Количество;				
		Движение.СуммаРуб		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Рубли,Курс);
		Движение.СуммаEUR		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Евро,КурсЕвро);
		Движение.СуммаUSD		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Доллары,КурсДоллара);
		
		Движение.Отправитель	= Контрагент;
		Если ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику) И ТипЗнч(СтрокаТЧ.ЗаявкаПоставщику)  = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			
			Движение.Контракт = СтрокаТЧ.ЗаявкаПоставщику.Контракт; 	
			
		КонецЕсли;
		       		
		
	КонецЦикла;
	

КонецПроцедуры

Функция ПолучитьМассивНоменклатуры(ИмяТЧ,ИмяКолонки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказПоставщикуТовары.%ИмяКолонки% КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ЗаказПоставщикуТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар) "; 	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяКолонки%",ИмяКолонки);
	
	Запрос.УстановитьПараметр("Товары",ЭтотОбъект[ИмяТЧ].Выгрузить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 


КонецФункции // ПолучитьМассивНоменклатуры()


//--Данилова Е.В. 11.08.2025     

#КонецОбласти 

#Область ПриложениеТСД 
//++Данилова Е.В. 25.09.2025 WEB-3705
Функция ПроставитьСостояниеПроверкиМарокНаТСД()
    //++Данилова Е.В. 13.03.2026 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Контрагенты.ВыгружатьМаркиЗПСДляТСД КАК ВыгружатьМаркиЗПСДляТСД
	//	|ИЗ
	//	|	Справочник.Контрагенты КАК Контрагенты
	//	|ГДЕ
	//	|	Контрагенты.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Контрагент);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	//ВыборкаДетальныеЗаписи.Следующий(); 
	//
	//Если ВыборкаДетальныеЗаписи.ВыгружатьМаркиЗПСДляТСД 
	//	И СостояниеПроверкиМарокНаТСД = перечисления.СостоянияПроверкиМарокНаТСД.ПустаяСсылка() Тогда
	//	
	//	СостояниеПроверкиМарокНаТСД = Перечисления.СостоянияПроверкиМарокНаТСД.НеТребуетсяОтправлять; 
	//	
	//КонецЕсли;
	//
	//Если НЕ ВыборкаДетальныеЗаписи.ВыгружатьМаркиЗПСДляТСД 
	//	И СостояниеПроверкиМарокНаТСД = перечисления.СостоянияПроверкиМарокНаТСД.НеТребуетсяОтправлять Тогда
	//	
	//	СостояниеПроверкиМарокНаТСД = Перечисления.СостоянияПроверкиМарокНаТСД.ПустаяСсылка(); 
	//	
	//КонецЕсли;
	ОбменДаннымиПоAPI_ТСД.ПолучитьСостояниеПроверкиМарокНаТСД(Контрагент,СостояниеПроверкиМарокНаТСД); 
     //--Данилова Е.В. 13.03.2026 
КонецФункции // ПроставитьСостояниеПроверкиМарокНаТСД()
//--Данилова Е.В. 25.09.2025	
#КонецОбласти


НеКонтролироватьЗапись=Ложь;
