Перем  Рубли,Доллары;
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Функция ПересчетМЮ(Сумма,Валюта1,Курс1,Валюта2,Курс2)	
	Если Валюта1=Рубли И Валюта2=Доллары Тогда		
		Возврат ?(Курс1=0,0,Сумма/Курс1);	
	ИначеЕсли Валюта1=Доллары И Валюта2=Рубли Тогда
		Возврат Сумма*Курс1;		
	Иначе
		Возврат глПересчет(Сумма,Валюта1,Курс1,Валюта2,Курс2);	
	КонецЕсли; 	
КонецФункции // ПересчетМЮ()

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	
	ВалютаУпр			=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	Если Сумма <> 0 Тогда
		
		ВалютаРасчетов_Дебитор	=ПолучитьВалютуРасчетов(Договор_Дебитор);	
		ВалютаРасчетов_Кредитор	=ПолучитьВалютуРасчетов(Договор_Кредитор);	
		
		СуммаВАЛ_Дебитор	= глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов_Дебитор,Дата);
		СуммаВАЛ_Кредитор	= глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов_Кредитор,Дата);
		
		СуммаУпр			= глПересчет(Сумма,Валюта,Курс,ВалютаУпр,Дата);	
		
		Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
		
		Движение.Период				= Дата;
		Движение.Контрагент			= Контрагент_Дебитор;
		Движение.Договор 			= Договор_Дебитор;			
		
		Движение.СуммаВал			= Модуль(СуммаВАЛ_Дебитор);
		Движение.СуммаУпр			= Модуль(СуммаУпр);
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		
		Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
		
		Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		
		Движение.Период				= Дата;
		Движение.Контрагент			= Контрагент_Кредитор;
		Движение.Договор 			= Договор_Кредитор;			
		
		Движение.СуммаВал			= Модуль(СуммаВАЛ_Кредитор);
		Движение.СуммаУпр			= Модуль(СуммаУпр);
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		
		Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
	КонецЕсли;
	//сформируем проводки по ТЧ
	Если Взаимозачеты.Количество() <> 0 Тогда
		Для Каждого СтрокаТЧ Из Взаимозачеты Цикл
			ВалютаРасчетов_Дебитор	=ПолучитьВалютуРасчетов(СтрокаТЧ.Договор_Дебитор);	
			ВалютаРасчетов_Кредитор	=ПолучитьВалютуРасчетов(СтрокаТЧ.Договор_Кредитор);	
			
			СуммаВАЛ_Дебитор	= глПересчет(СтрокаТЧ.Сумма,Валюта,Курс,ВалютаРасчетов_Дебитор,Дата);
			СуммаВАЛ_Кредитор	= глПересчет(СтрокаТЧ.Сумма,Валюта,Курс,ВалютаРасчетов_Кредитор,Дата);
			
			СуммаУпр			= глПересчет(СтрокаТЧ.Сумма,Валюта,Курс,ВалютаУпр,Дата);	
			
			Движение 					= Движения.Взаиморасчеты.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			
			Движение.Период				= Дата;
			Движение.Контрагент			= СтрокаТЧ.Контрагент_Дебитор;
			Движение.Договор 			= СтрокаТЧ.Договор_Дебитор;			
			
			Движение.СуммаВал			= Модуль(СуммаВАЛ_Дебитор);
			Движение.СуммаУпр			= Модуль(СуммаУпр);
			
			Движение.СуммаДокумента		= СтрокаТЧ.Сумма;
			Движение.ВалютаДокумента	= Валюта;	
			
			Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
			
			Движение 					= Движения.Взаиморасчеты.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			
			Движение.Период				= Дата;
			Движение.Контрагент			= СтрокаТЧ.Контрагент_Кредитор;
			Движение.Договор 			= СтрокаТЧ.Договор_Кредитор;			
			
			Движение.СуммаВал			= Модуль(СуммаВАЛ_Кредитор);
			Движение.СуммаУпр			= Модуль(СуммаУпр);
			
			Движение.СуммаДокумента		= СтрокаТЧ.Сумма;
			Движение.ВалютаДокумента	= Валюта;	
			
			Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
			
		КонецЦикла;	
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если ОбменДанными.Загрузка Тогда
		Движения.Взаиморасчеты.Записать();	
	КонецЕсли; 
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
КонецПроцедуры

//крохин начало 24.05.2012
Процедура ПриКопировании(ОбъектКопирования)
	Если ДокОснование = Неопределено Тогда
	Возврат;	
КонецЕсли;
ДатаОплаты = ДокОснование.ДатаОплаты;
КонецПроцедуры

//крохин конец 24.05.2012

//Чирков начало 07.03.2013
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Основание) Тогда Возврат КонецЕсли; 
	
	ТипОснования=ТипЗнч(Основание);
	Если ТипОснования=Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.Текст =" 
		|ВЫБРАТЬ	
		|	Сотрудник,
		|	МАКСИМУМ(Договоры.Ссылка) КАК Договор
		|ПОМЕСТИТЬ ДоговорыПодотчет
		|ИЗ
		|	Документ.ЗаявкаНаОплату.Подотчет КАК ЗаявкаНаОплатуПодотчет
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.Договоры КАК Договоры
		|ПО
		|	ЗаявкаНаОплатуПодотчет.Сотрудник	=Договоры.Владелец 	
		|	И Договоры.ВидДоговора_Новый		=&ВидДоговораПодОтчет
		|	И НЕ Договоры.ПометкаУдаления
		|ГДЕ
		|	ЗаявкаНаОплатуПодотчет.Ссылка=&ЗНО
		|СГРУППИРОВАТЬ ПО 
		|	Сотрудник
		|;
		|ВЫБРАТЬ
		|	ЗаявкаНаОплатуПодотчет.Сотрудник 	КАК Контрагент_Кредитор,
		|	ДоговорыПодотчет.Договор			КАК Договор_Кредитор,
		|	ЗаявкаНаОплатуПодотчет.Сумма		КАК Сумма
		|ИЗ	
		|	Документ.ЗаявкаНаОплату.Подотчет КАК ЗаявкаНаОплатуПодотчет	
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ДоговорыПодотчет
		|ПО
		|	ДоговорыПодотчет.Сотрудник=ЗаявкаНаОплатуПодотчет.Сотрудник			
		|ГДЕ
		|	ЗаявкаНаОплатуПодотчет.Ссылка		=&ЗНО";
		
		ВидДоговораПодОтчет	= Справочники.ВидыДоговоров.НайтиПоНаименованию("Под отчёт", Истина);	
		
		Запрос.УстановитьПараметр("ЗНО",Основание);
		Запрос.УстановитьПараметр("ВидДоговораПодОтчет",ВидДоговораПодОтчет);		
		
		Выборка = Запрос.Выполнить().Выбрать();
		// заполняем таб.часть Взаимозачеты
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Взаимозачеты.Добавить();			
			
			НоваяСтрока.Контрагент_Дебитор	= Основание.Контрагент;
			НоваяСтрока.Договор_Дебитор		= Основание.Договор;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);			
		КонецЦикла;		
	КонецЕсли; 
КонецПроцедуры
//Чирков конец 07.03.2013

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
//Катаев- 08/10/14