//функции работы с числами

Функция ОкруглениеЧисла(ВходноеЧисло,Точность)экспорт
	Возврат Окр(ВходноеЧисло,Точность);
КонецФункции

 //Нечаева 26,01,26 ++
Функция Конвертация_MXL_в_ТЗ(АдресФайла)
//	АдресФайла = "C:\Users\nechaeva\Desktop\11\222.mxl";
	MXL=Новый ТабличныйДокумент;
	MXL.Прочитать(АдресФайла);	
	Построитель=Новый ПостроительОтчета; 
	//Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(MXL.Область(1, 1, MXL.ВысотаТаблицы, MXL.ШиринаТаблицы));
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(MXL.Область(1, 1, MXL.ВысотаТаблицы, MXL.ШиринаТаблицы));
	Построитель.Выполнить();
	ТЗ = Построитель.Результат.Выгрузить();	
  	Возврат ТЗ;

КонецФункции
  //Нечаева 26,01,26---


//функции работы со строками
Функция ОтрезкаВремениИзПравойЧастиСтроки(ВходнаяСтрока,КоличествоОтрезаемыхСимволов)экспорт
	ВходнаяСтрока=СокрП(ВходнаяСтрока);
	
	если сред(ВходнаяСтрока,стрдлина(ВходнаяСтрока)-9,1)<>"(" тогда
		КоличествоОтрезаемыхСимволов=КоличествоОтрезаемыхСимволов-1;
	КонецЕсли;
	
	
	ВыхСтрока=Сред(ВходнаяСтрока,1,СтрДлина(ВходнаяСтрока)-КоличествоОтрезаемыхСимволов);
	возврат ВыхСтрока;		
КонецФункции

//функция выполняет приведение строки к числу
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено
//
// Возвращаемое значение:
//  Число
//
Функция ПривестиСтрокуКЧислуН(ЧислоСтрокой, ВозвращатьНеопределено = Ложь) Экспорт
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;	
	
КонецФункции

// Функция выполняет приведение строки к дате
Функция ПривестиСтрокуКДатеН(ДатаСтрокой) Экспорт
	
	ОписаниеТипаДаты = Новый ОписаниеТипов("Дата");
	ЗначениеДаты = ОписаниеТипаДаты.ПривестиЗначение(ДатаСтрокой);
	
	Возврат ЗначениеДаты;
	
КонецФункции

// Функция выполняет приведение строки к булево
Функция ПривестиСтрокуКБулевоН(БулевоСтрокой) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ЗначениеБулево = ОписаниеТипаБулево.ПривестиЗначение(БулевоСтрокой);
	
	Возврат ЗначениеБулево;
	
КонецФункции

//нечаева 01.022022 ++
// строку в дату переводит  "12.02.2025"
Функция СтрокуВДату(ИзмДата) Экспорт
	Возврат Дата(Сред(ИзмДата,7,4)+Сред(ИзмДата,4,2)+Сред(ИзмДата,0,2));	       	
КонецФункции 
//нечаева  01.022022 --



// с документами 

//нечаева +++ 26.11.13
Функция ВидДокумента(Документ) Экспорт
	Если  СтрДлина(Документ.Метаданные().Синоним) Тогда
		Возврат Документ.Метаданные().Синоним;
	Иначе
		возврат "";
	КонецЕсли;	
КонецФункции
//нечаева --- 26.11.13


//нечаева +++ 01,12,23
Функция ТИпТОвараФР(Номенклатура) Экспорт
	Если  Номенклатура.ЭтоГруппа Тогда
		Возврат Номенклатура.ФР_ТипТовара.Наименование;
	Иначе
		возврат Номенклатура.Родитель.ФР_ТипТовара.Наименование;
	КонецЕсли;	
КонецФункции
//нечаева --- 01,12,23




// функции работы с датами

Функция ПолучитьНаимДатыДеньНедели(Дата) Экспорт
	Рез=Строка(Формат(Дата,"ДЛФ=Д"));
	ДеньН=ДеньНЕдели(Дата);
	НомДн="";
	Если Деньн=1 Тогда
		НомДн="Пн.";
	конецЕсли;
	
	Если Деньн=2 Тогда
		НомДн="Вт.";
	конецЕсли;
	
	Если Деньн=3 Тогда
		НомДн="Ср.";
	конецЕсли;
	
	Если Деньн=4 Тогда
		НомДн="Чт.";
	конецЕсли;
	
	Если Деньн=5 Тогда
		НомДн="Пт.";
	конецЕсли;
	
	Если Деньн=6 тогда
		НомДн="Сб.";
	конецЕсли;
	
	Если Деньн=7 Тогда
		НомДн="Вс.";
	конецЕсли;
	
	
	Рез=Рез+" "+Строка(НомДн);
	
	возврат РЕз;
	
	
КонецФункции

// нечаева 26,11,13 поменяла наименование +++
// 
// Процедура вычисляет количество лет, месяцев и дней между двумя датами
// Параметры
//  Дата1    – дата, первая дата (более поздняя, часто текущая, стаж определяется по состоянию на эту дату)
//  Дата2    – дата, вторая дата (ранняя дата, с нее начинается "течение" стажа)
//  Лет        – Число, в этот параметр будет записано кол-во лет между двумя датами (Дата1-Дата2)
//  Месяцев    – Число, в этот параметр будет записано кол-во месяцев между двумя датами (Дата1-Дата2)
//  Дней    – Число, в этот параметр будет записано кол-во дней между двумя датами (Дата1-Дата2)
Процедура РазобРазностьДат(Дата11, Дата22, Лет = 0, Месяцев = 0, Дней = 0) Экспорт
	
	Лет        = 0;
	Месяцев    = 0;
	Дней    = 0;
	Если Дата11 > Дата22 Тогда
		
		ВременнаяДата = Дата11;
		Если День(ВременнаяДата) < День(Дата22) Тогда
			Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);
		КонецЕсли;
		Если Месяц(ВременнаяДата) < Месяц(Дата22) Тогда
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);
			Месяцев = 12;
		КонецЕсли;
		Лет        = Макс(             Год(ВременнаяДата)        - Год(Дата22),    0);
		Месяцев    = Макс(Месяцев    + Месяц(ВременнаяДата)    - Месяц(Дата22),    0);
		Дней    = Макс(Дней        + День(ВременнаяДата)    - День(Дата22),    0);
		
		// скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах
		
		Если Дата22 <> (ДобавитьМесяц(Дата11,-Лет*12-Месяцев)-Дней*86400) Тогда
			Дней = Дней + (День(КонецМесяца(Дата22)) - День(НачалоМесяца(Дата22))) - (День(КонецМесяца(ДобавитьМесяц(Дата11,-1))) - День(НачалоМесяца(ДобавитьМесяц(Дата11,-1))));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    // РазобратьРазностьДат
// нечаева 26,11,13 поменяла наименование ---


// кол-во раб дней месяца
Функция КолРабДнейМесяца(Дата)
	
	ВсегоРДней=0;
	
	ЗапросПоДням=Новый Запрос;
	ЗапросПоДням.Текст="
	|ВЫБРАТЬ
	|	КалендарьДни.Дата КАК Дата
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Ссылка.Период = &Период
	|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
	|	И КалендарьДни.Часы > 0
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дата)
	|ПО ОБЩИЕ";
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	КалендарьДни.Дата КАК Дата
	//|ИЗ
	//|	Справочник.Календарь.Дни КАК КалендарьДни
	//|ГДЕ
	//|	КалендарьДни.Дата >= &ДатаОтгрузки
	//|	И КалендарьДни.Часы <> 0
	//|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата
	//|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	
	ЗапросПоДням.УстановитьПараметр("Период",НачалоМесяца(Дата));
	РезультатПоДням	=ЗапросПоДням.Выполнить();
	
	ВсегоРДней=0;
	
	ВыборкаПоДням	=РезультатПоДням.Выбрать();
	Пока ВыборкаПоДням.Следующий() Цикл
		Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда
			ВсегоРДней=ВыборкаПоДням.Дата;			
		Иначе					
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	
	Если ВсегоРДней=0 Тогда
		Сообщить("Не заполнен календарь на: " +ПредставлениеПериода(НачалоМесяца(Дата),КонецМесяца(Дата)),СтатусСообщения.Важное);					
	КонецЕсли;
	
	
	Возврат ВсегоРДней;
	
КонецФункции

//крохин начало 17.03.2014
Функция ДобавитьДату(Дата11,Секунды) Экспорт
	Возврат Дата11 + Секунды;	
КонецФункции
//крохин конец 17.03.2014

//крохин начало 26.03.2014
Функция ПустаяДата() Экспорт
	Возврат '00010101';	
КонецФункции
//крохин конец 26.03.2014


//кухарь 24.07.14 начало
Функция СтранаПроизводительИзГтД(Номенклатура) экспорт
	ГТД=ПолучитьГрупповойПериодическийРеквизит(Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
	попытка
		Страна=ГТД.СтранаПроисхождения;
	исключение
		страна="";
	КонецПопытки;
	возврат Страна;
КонецФункции 
//кухарь 24.07.14 конец  

//кухарь 15.10.14 начало
Функция ПолучитьОбъемКоробовИзРегистра(Докобъект) экспорт
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ОбъемКоробов
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита
	|	И РеквизитыРНКПНКПРМ.Документ = &Документ";
	запрос.УстановитьПараметр("ИмяРеквизита","ОбъемКоробов");
	запрос.УстановитьПараметр("Документ",Докобъект.Ссылка);
	РезОбъемКоробов=запрос.Выполнить().Выгрузить();
	
	если РезОбъемКоробов.Количество()=0 тогда
		возврат Докобъект.ОбъемДокумента;
	иначе
		ТОбъём=РезОбъемКоробов.Получить(0).ОбъемКоробов;
		если ТОбъём=0 тогда
			возврат Докобъект.ОбъемДокумента;
		иначе Возврат ТОбъём;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//кухарь 15.10.14 конец

//нечаева 08,12,2014 +++ 
Функция ПолучитьОтветственноеЛицо(ДокОбъект) Экспорт
	
	//нечаева 06,03,17 +++
	ДатаДокумента = ДокОбъект.дата;
	// если есть реквизит, то берем дату отгрузки.
	Попытка
		ДатаДокумента = ДокОбъект.датаОтгрузки;
	Исключение
		
	КонецПопытки;
	//нечаева 06,03,17 ---
	
	ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	ТекДок = ДокОбъект;
	
	Организация = ТекДок.Организация;
	Если Организация = ПараметрыСеанса.ОрганизацияПриПечатиДокументов Тогда
		ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов;
	Иначе
		// проверяем есть ли записи в регистре сведений ПриказНаПодпись, если нет, то берем по справочнику.
		//------------------------------------------------------------------------------------------------------
		
		Запрос=Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		|	ДоверенностиНаПодписьСрезПоследних.Период,
		|	ДоверенностиНаПодписьСрезПоследних.Сотрудник,
		|	ДоверенностиНаПодписьСрезПоследних.Документ,
		|	ДоверенностиНаПодписьСрезПоследних.Организация КАК Организация1,
		|	ДоверенностиНаПодписьСрезПоследних.ДатаОкончанияДействияДоверенности,
		|	ДоверенностиНаПодписьСрезПоследних.ДатаДоверенности
		|ИЗ
		|	РегистрСведений.ДоверенностиНаПодпись.СрезПоследних КАК ДоверенностиНаПодписьСрезПоследних
		|ГДЕ
		|	ДоверенностиНаПодписьСрезПоследних.Организация = &ТекОрганизация";
		запрос.УстановитьПараметр("ТекОрганизация",Организация);
		Рез=запрос.Выполнить().Выбрать();
		Если Рез.Количество()<>0 Тогда
			// смотрим по регистру сведений, раньше был только 1 документ, теперь нет.
			
			//сообщить(ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов);
			//сообщить(ПараметрыСеанса.ОрганизацияПриПечатиДокументов);
			//
			ОтветственноеЛицо = ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов;
			
			
			Запрос=Новый Запрос;
			запрос.Текст = "ВЫБРАТЬ
			|	ДоверенностиНаПодписьСрезПоследних.Период,
			|	ДоверенностиНаПодписьСрезПоследних.Сотрудник,
			|	ДоверенностиНаПодписьСрезПоследних.Документ,
			|	ДоверенностиНаПодписьСрезПоследних.Организация КАК Организация,
			|	ДоверенностиНаПодписьСрезПоследних.ДатаОкончанияДействияДоверенности,
			|	ДоверенностиНаПодписьСрезПоследних.ДатаДоверенности
			|ИЗ
			|	РегистрСведений.ДоверенностиНаПодпись.СрезПоследних(
			|			,
			|			Сотрудник = &ОтветственноеЛицо
			|				И Организация = &Организация
			|				И (КОНЕЦПЕРИОДА(ДатаОкончанияДействияДоверенности, ДЕНЬ) >= &ТекДокДата
			|					И ДатаДоверенности <= &ТекДокДата)) КАК ДоверенностиНаПодписьСрезПоследних";
			запрос.УстановитьПараметр("Организация",Организация);
			запрос.УстановитьПараметр("ОтветственноеЛицо",ОтветственноеЛицо);
			запрос.УстановитьПараметр("ТекДокДата",ТекДок.Дата);
			Рез2=запрос.Выполнить().Выбрать();
			
			
			Если Рез2.Количество()=0  Тогда
				//ищем на физ лицо.
				Запрос=Новый Запрос;
				запрос.Текст = "ВЫБРАТЬ
				|	ДоверенностиНаПодписьСрезПоследних.Период,
				|	ДоверенностиНаПодписьСрезПоследних.Сотрудник,
				|	ДоверенностиНаПодписьСрезПоследних.Документ,
				|	ДоверенностиНаПодписьСрезПоследних.Организация КАК Организация,
				|	ДоверенностиНаПодписьСрезПоследних.ДатаОкончанияДействияДоверенности,
				|	ДоверенностиНаПодписьСрезПоследних.ДатаДоверенности
				|ИЗ
				|	РегистрСведений.ДоверенностиНаПодпись.СрезПоследних(
				|			,
				|			Сотрудник = &ОтветственноеЛицо
				|				И Организация = &Организация
				|				И (КОНЕЦПЕРИОДА(ДатаОкончанияДействияДоверенности, ДЕНЬ) >= &ТекДокДата
				|					И ДатаДоверенности <= &ТекДокДата)) КАК ДоверенностиНаПодписьСрезПоследних";
				запрос.УстановитьПараметр("Организация",Организация);
				запрос.УстановитьПараметр("ОтветственноеЛицо",ПараметрыСеанса.Пользователь.ФизЛицо);
				
				//нечаева 06,03,17--
				//запрос.УстановитьПараметр("ТекДокДата",ТекДок.Дата);
				запрос.УстановитьПараметр("ТекДокДата",ДатаДокумента);
				//нечаева 06,03,17++
				
				Рез3=запрос.Выполнить().Выбрать();
				
				Если Рез3.Количество() = 0 Тогда 
					ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
					//предупреждение("ОЛ не заполнено, так как у ответственного лица "+ПараметрыСеанса.Пользователь.ФизЛицо +" нет права подписи, либо истек срок действия доверенности на право подписи");
				Иначе
					ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.Пользователь.ФизЛицо;
					
				КонецЕсли;
				
			Иначе
				// если нашли 
				ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов;	
				
			КонецЕсли;
			
			
		иначе 
			
			
			//------------------------------------------------------------------------------------------------------
			// ищем по справочнику (по старому механизму)
			
			ПриказНаПодпись = Справочники.ПриказНаПодписьСФ.НайтиПоРеквизиту("Организация",Организация);
			Если ПриказНаПодпись.Пустая() Тогда
				ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.Пользователь.ФизЛицо;
			Иначе
				СтрокаДоверенности = ПриказНаПодпись.Сотрудники.Найти(ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов,"Сотрудник");
				Если СтрокаДоверенности = Неопределено Тогда
					СтрокаДоверенности2 = ПриказНаПодпись.Сотрудники.Найти(ПараметрыСеанса.Пользователь.ФизЛицо,"Сотрудник");	
					Если СтрокаДоверенности2 = Неопределено Тогда
						ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
						//предупреждение("ОЛ не заполнено, так как у ответственного лица "+ПараметрыСеанса.Пользователь.ФизЛицо +" нет права подписи, либо истек срок действия доверенности на право подписи");
					Иначе
						Если СтрокаДоверенности2.ДатаОкончанияДействияДоверенности = '00010101' ИЛИ (КонецДня(СтрокаДоверенности2.ДатаОкончанияДействияДоверенности)  >= ТекДок.Дата И СтрокаДоверенности2.ДатаДоверенности <= ТекДок.Дата) Тогда
							ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.Пользователь.ФизЛицо;
						Иначе
							ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
							//предупреждение("ОЛ не заполнено, так как у ответственного лица "+ПараметрыСеанса.Пользователь.ФизЛицо +" нет права подписи, либо истек срок действия доверенности на право подписи");
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если СтрокаДоверенности.ДатаОкончанияДействияДоверенности = '00010101' ИЛИ (КонецДня(СтрокаДоверенности.ДатаОкончанияДействияДоверенности)  >= ТекДок.Дата И СтрокаДоверенности.ДатаДоверенности <= ТекДок.Дата) Тогда
						ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов;	
					Иначе
						СтрокаДоверенности2 = ПриказНаПодпись.Сотрудники.Найти(ПараметрыСеанса.Пользователь.ФизЛицо,"Сотрудник");	
						Если СтрокаДоверенности2 = Неопределено Тогда
							//предупреждение("ОЛ не заполнено, так как у ответственного лица "+ПараметрыСеанса.Пользователь.ФизЛицо +" нет права подписи, либо истек срок действия доверенности на право подписи");
							ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();	
						Иначе
							Если СтрокаДоверенности2.ДатаОкончанияДействияДоверенности = '00010101' ИЛИ (КонецДня(СтрокаДоверенности2.ДатаОкончанияДействияДоверенности ) >= ТекДок.Дата И СтрокаДоверенности2.ДатаДоверенности <= ТекДок.Дата) Тогда
								ОтветственноеЛицоПриПечатиДокументов = ПараметрыСеанса.Пользователь.ФизЛицо;
							Иначе
								//предупреждение("ОЛ не заполнено, так как у ответственного лица "+ПараметрыСеанса.Пользователь.ФизЛицо +" нет права подписи, либо истек срок действия доверенности на право подписи");
								ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		
		
	КонецЕсли;
	//сообщить("+++" + ОтветственноеЛицоПриПечатиДокументов);
	возврат  ОтветственноеЛицоПриПечатиДокументов;
	
КонецФункции
//нечаева 08,12,2014 ---

//нечаева 08,12,2014 +++ 
Функция ПолучитьСтрокуСДаннымиОтветственноеЛицо(ДокОбъект) Экспорт
	
	//нечаева 06,03,17 +++
	ДатаДокумента = ДокОбъект.дата;
	// если есть реквизит, то берем дату отгрузки.
	Попытка
		ДатаДокумента = ДокОбъект.датаОтгрузки;
	Исключение
		
	КонецПопытки;
	//нечаева 06,03,17 ---
	
	
	ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
	ТекДок = ДокОбъект;
	
	
	ОВЛ = "";
	СтрокаСотрудников = "";
	НомерПриказа="";
	//Кухарь 21.11.16 начало
	ДолжностьОВЛ="";
	//Кухарь 21.11.16 конец
	
	Организация = ТекДок.Организация;
	// проверяем есть ли записи в регистре сведений ПриказНаПодпись, если нет, то берем по справочнику.
	//------------------------------------------------------------------------------------------------------
	
	
	Сотрудник = ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов;
	
	Запрос=Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ДоверенностиНаПодписьСрезПоследних.Период,
	|	ДоверенностиНаПодписьСрезПоследних.Сотрудник,
	|	ДоверенностиНаПодписьСрезПоследних.Документ,
	|	ДоверенностиНаПодписьСрезПоследних.Организация КАК Организация1,
	|	ДоверенностиНаПодписьСрезПоследних.ДатаОкончанияДействияДоверенности,
	|	ДоверенностиНаПодписьСрезПоследних.ДатаДоверенности
	|ИЗ
	|	РегистрСведений.ДоверенностиНаПодпись.СрезПоследних КАК ДоверенностиНаПодписьСрезПоследних
	|ГДЕ
	|	ДоверенностиНаПодписьСрезПоследних.Организация = &ТекОрганизация";
	запрос.УстановитьПараметр("ТекОрганизация",Организация);
	Рез=запрос.Выполнить().Выбрать();
	Если Рез.Количество()<>0 Тогда
		// смотрим по регистру сведений, раньше был только 1 документ, теперь нет.
		
		ОтветственноеЛицо = ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов;
		
		
		Запрос=Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		//Кухарь 10.06.15 начало
		| Первые 1
		//Кухарь 10.06.15 конец
		|	ДоверенностиНаПодписьСрезПоследних.Период,
		|	ДоверенностиНаПодписьСрезПоследних.Сотрудник,
		|	ДоверенностиНаПодписьСрезПоследних.Документ,
		|	ДоверенностиНаПодписьСрезПоследних.Организация КАК Организация,
		|	ДоверенностиНаПодписьСрезПоследних.ДатаОкончанияДействияДоверенности КАК ДатаОкончанияДействияДоверенности,
		|	ДоверенностиНаПодписьСрезПоследних.ДатаДоверенности,
		//Кухарь 10.06.15 начало
		|	ДоверенностиНаПодписьСрезПоследних.НомерДоверенности
		//Кухарь 10.06.15 конец
		|ИЗ
		|	РегистрСведений.ДоверенностиНаПодпись.СрезПоследних(
		|			,
		|			Сотрудник = &ОтветственноеЛицо
		|				И Организация = &Организация
		|				И (КОНЕЦПЕРИОДА(ДатаОкончанияДействияДоверенности, ДЕНЬ) >= &ТекДокДата
		|					И ДатаДоверенности <= &ТекДокДата)) КАК ДоверенностиНаПодписьСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончанияДействияДоверенности УБЫВ";
		запрос.УстановитьПараметр("Организация",Организация);
		запрос.УстановитьПараметр("ОтветственноеЛицо",Сотрудник);
		
		//нечаева 06,03,17--
		//запрос.УстановитьПараметр("ТекДокДата",ТекДок.Дата);
		запрос.УстановитьПараметр("ТекДокДата",ДатаДокумента);
		//нечаева 06,03,17++
		
		Рез2=запрос.Выполнить().Выбрать();
		
		Если Рез2.следующий() Тогда
			ОВЛ =Рез2.Сотрудник.Фамилия+ " "+Лев(Рез2.Сотрудник.Имя,1)+"." + Лев(Рез2.Сотрудник.Отчество,1)+"."; 
			//Кухарь 21.11.16 начало
			ДолжностьОВЛ= Рез2.сотрудник.должность.Наименование;
			//Кухарь 21.11.16 конец
			
			//Кухарь 10.06.15 начало
			//Находит строчки в документе с уже истёкшей доверенностью и выводит не верный номер
			//СтрокаДоверенности = Рез2.Документ.Сотрудники.Найти(ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов,"Сотрудник");
			СтрокаДоверенности = Рез2;
			//Кухарь 10.06.15 конец
			Если СтрокаДоверенности = Неопределено Тогда
				ОВЛ = "";
				
			Иначе
				
				//Кухарь 22.11.16 начало
				//Добавим должность и уберём дубль слова номер.
				//СтрокаСотрудников = "На основании доверенности номер "+СтрокаДоверенности.НомерДоверенности + ?(СтрокаДоверенности.ДатаДоверенности <> '00010101'," от "+формат(СтрокаДоверенности.ДатаДоверенности,"ДФ=dd.MM.yyyy"),"")+  " право подписи за главного бухгалтера и руководителя имеет: "+ОВЛ;
				
				СтрокаСотрудников = "На основании доверенности номер "+СтрокаДоверенности.НомерДоверенности + ?(СтрокаДоверенности.ДатаДоверенности <> '00010101'," от "+формат(СтрокаДоверенности.ДатаДоверенности,"ДФ=dd.MM.yyyy"),"")+  " право подписи за главного бухгалтера и руководителя имеет: "+ДолжностьОВЛ+" "+ОВЛ;
				СтрокаСотрудников=СтрЗаменить(СтрокаСотрудников,"№","");
				
				//Кухарь 22.11.16 конец
				
			КонецЕсли;
		Иначе
			ОВЛ = "";
			
		КонецЕсли; 
		
		
	иначе 
		//------------------------------------------------------------------------------------------------------
		// ищем по справочнику (по старому механизму)
		ПриказНаПодпись = Справочники.ПриказНаПодписьСФ.НайтиПоРеквизиту("Организация",Организация);
		Если Не Сотрудник.Пустая() Тогда
			ОВЛ =Сотрудник.Фамилия+ " "+Лев(Сотрудник.Имя,1)+"." + Лев(Сотрудник.Отчество,1)+"."; 
			СтрокаДоверенности = ПриказНаПодпись.Сотрудники.Найти(ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов,"Сотрудник");
			//Кухарь 21.11.16 начало
			ДолжностьОВЛ= Рез2.сотрудник.должность.Наименование;
			//Кухарь 21.11.16 конец
			
			Если СтрокаДоверенности = Неопределено Тогда
				ОВЛ = "";
				СтрокаСотрудников = "";
			Иначе
				//Кухарь 22.11.16 начало
				//Добавим должность и уберём дубль слова номер.
				//СтрокаСотрудников = "На основании доверенности номер "+СтрокаДоверенности.НомерДоверенности + ?(СтрокаДоверенности.ДатаДоверенности <> '00010101'," от "+формат(СтрокаДоверенности.ДатаДоверенности,"ДФ=dd.MM.yyyy"),"")+  " право подписи за главного бухгалтера и руководителя имеет: "+ОВЛ;
				СтрокаСотрудников = "На основании доверенности номер "+СтрокаДоверенности.НомерДоверенности + ?(СтрокаДоверенности.ДатаДоверенности <> '00010101'," от "+формат(СтрокаДоверенности.ДатаДоверенности,"ДФ=dd.MM.yyyy"),"")+  " право подписи за главного бухгалтера и руководителя имеет: "+ДолжностьОВЛ+" "+ОВЛ;
				СтрокаСотрудников=СтрЗаменить(СтрокаСотрудников,"№","");
				
				//Кухарь 22.11.16 конец
			КонецЕсли;
		Иначе
			ОВЛ = "";
			
		КонецЕсли; 
		
		// нечаева 17,12,14 +++ косяк
		////-----------------------------
		//НомерПриказа="";
		//СтрокаСотрудников = "";
		// нечаева 17,12,14 --- косяк
		
		//
		
		
	КонецЕсли;
	
	
	
	ЗначенияОВЛ = Новый Структура; 
	ЗначенияОВЛ.Вставить("ОВЛ", ОВЛ);
	ЗначенияОВЛ.Вставить("СтрокаСотрудников",СтрокаСотрудников);
	ЗначенияОВЛ.Вставить("НомерПриказа",номерПриказа);
	//Кухарь 21.11.16 начало
	ЗначенияОВЛ.Вставить("ДолжностьОВЛ",ДолжностьОВЛ);
	//Кухарь 21.11.16 конец
	
	//Сообщить("Цвет: "+с.Цвет);
	//Сообщить("Размер: "+с.Размер);
	//
	//   	
	
	
	
	возврат  ЗначенияОВЛ;
	
КонецФункции
//нечаева 08,12,2014 ---




	// Кухарь А.Ю.  01.02.2023 начало
	//функция ПолучитьЦенуНоменклатурыУпрощДляСКД(Номенклатура,ТипЦен,ДатаРасчета=Неопределено,Валюта = неопределено) Экспорт
функция ПолучитьЦенуНоменклатурыУпрощДляСКД(Номенклатура,ТипЦен,ДатаРасчета=Неопределено,Валюта = неопределено,НеПересчитыватьКурс=ложь) Экспорт	 
	// Кухарь А.Ю.  01.02.2023 конец
	
	//Нечаева 17,06,19++
	Если Валюта = Неопределено Тогда
		ВалютаДокумента=Справочники.Валюты.НайтиПоКоду("810");
	Иначе
	    ВалютаДокумента=Валюта;
	КонецЕсли;
	//Нечаева 17,06,19---

	
	
	ВалютаДокумента=Справочники.Валюты.НайтиПоКоду("810");
	КурсДокумента=1;
	
	Если ТипЦен<>Неопределено И НЕ ТипЦен.Пустая() Тогда		
		Запрос=Новый Запрос;
		
		Если ДатаРасчета=Неопределено Тогда
			#Если Клиент Тогда		
				// нечаева 06,08,13 +++ было везде на конец дня
				//ТекДатаРасчета=КонецДня(РабочаяДата);
				ТекДатаРасчета=Текущаядата();  //РабочаяДата;
				
			#Иначе
				ТекДатаРасчета=КонецДня(ТекущаяДата());		
			#КонецЕсли		
		Иначе
			//ТекДатаРасчета=КонецДня(ДатаРасчета);	
			ТекДатаРасчета=ДатаРасчета;
		КонецЕсли;
		
		
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1	
		|	Цена,
		|	ВЫБОР 
		|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
		|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
		|	(ТипЦен = &ТипЦен)
		|	И Номенклатура = &Номенклатура0
		|	И Прайс.Проведен
		|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2 И Прайс.Дата < &Дата2
		|	) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ Номенклатура.ЭтоГруппа
		|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв";
		
		
		
		
		Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
		Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);		
		
		Запрос.УстановитьПараметр("Номенклатура0",	?(Номенклатура.ЭтоГруппа,Номенклатура,Номенклатура.Родитель));
		
		Результат=Запрос.Выполнить();
		//крохин начало 22.09.2011
		//единицу не используем больше
		//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
		Коэффициент = 1;
		//крохин конец 22.09.2011;
		Выборка=Результат.Выбрать();
		
		
		
		Пока Выборка.Следующий() Цикл			
			//нечаева 08,09,2014 +++
			Если Выборка.цена<>-1 Тогда
				
				// Кухарь А.Ю.  01.02.2023 начало
				//		Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);
				если НеПересчитыватьКурс тогда
					Возврат  Выборка.Цена;
				иначе
					Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);			
				КонецЕсли;
				// Кухарь А.Ю.  01.02.2023 конец
				
				
			иначе 
				// тогда берем цену по базовому прайс-листу. сделано для франчей - сброс цен
				прервать;
			КонецЕсли;
			//нечаева 08,09,2014 ----
		КонецЦикла;	
		
		
		// смотрим базовый тип цен
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1	
		|	Цена,
		|	ВЫБОР 
		|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
		|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата2,
		|	(ТипЦен=&ТипЦен_Базовый)
		|	И Номенклатура = &Номенклатура0
		|	И Прайс.Проведен
		|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2	И Прайс.Дата < &Дата2
		|	) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ Номенклатура.ЭтоГруппа
		|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв";
		
		Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
		Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);		
		
		Запрос.УстановитьПараметр("Номенклатура0",	?(Номенклатура.ЭтоГруппа,Номенклатура,Номенклатура.Родитель));
		
		Результат=Запрос.Выполнить();
		//крохин начало 22.09.2011
		//единицу не используем больше
		//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
		Коэффициент = 1;
		//крохин конец 22.09.2011;
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			
			// Кухарь А.Ю.  01.02.2023 начало
			//			Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);		
			если НеПересчитыватьКурс тогда
				Возврат  Выборка.Цена;
			иначе
				Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);			
			КонецЕсли;
			// Кухарь А.Ю.  01.02.2023 конец
			
		КонецЦикла;	
		
		
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
//кухарь 19.01.14 конец


//06.02.15 кухарь начало
Функция НакладнаяПоШККоробки (ШК)   экспорт
	Накладная="";	
	ИщемВЛП=ложь;
	если СтрДлина(шк)=13 тогда
		запрос=новый Запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ИнформацияШКЛН.НомерНакладной,
		|	ИнформацияШКЛН.ВидНакладной,
		|	ИнформацияШКЛН.КоличествоКоробок
		|ИЗ
		|	РегистрСведений.ИнформацияШКЛН КАК ИнформацияШКЛН
		|ГДЕ
		|	ИнформацияШКЛН.Год = &Год
		|	И ИнформацияШКЛН.ШК = &ШК";
		запрос.УстановитьПараметр("ШК",ШК);
		запрос.УстановитьПараметр("Год",НачалоГода(ТекущаяДата()));
		результат=запрос.Выполнить().Выгрузить();
	иначе
		запрос=новый Запрос;
		запрос.Текст="ВЫБРАТЬ 
		|	ИнформацияШКЛП.НомерНакладной,
		|	ИнформацияШКЛП.ВидНакладной,
		|	ИнформацияШКЛП.КоличествоКоробок
		|ИЗ
		|	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
		|ГДЕ
		|	ИнформацияШКЛП.Год = &Год
		|	И ИнформацияШКЛП.ШК = &ШК";
		запрос.УстановитьПараметр("ШК",ШК);
		запрос.УстановитьПараметр("Год",НачалоГода(ТекущаяДата()));
		результат=запрос.Выполнить().Выгрузить();
		ИщемВЛП=Истина;
	КонецЕсли;
	
	
	
	
	
	
	если результат.Количество()>0 тогда
		Вид=результат.Получить(0).ВидНакладной;
		Номер=результат.Получить(0).НомерНакладной;
		
		если ИщемВЛП тогда
			запрос=новый Запрос;
			запрос.Текст="ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИнформацияШКЛП.ШК) КАК Количество
			|ИЗ
			|	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
			|ГДЕ
			|	ИнформацияШКЛП.Год = &Год
			|	И ИнформацияШКЛП.ВидНакладной = &ВидНакладной
			|	И ИнформацияШКЛП.НомерНакладной = &НомерНакладной";
			запрос.УстановитьПараметр("ВидНакладной",Вид);
			запрос.УстановитьПараметр("НомерНакладной",Номер);
			запрос.УстановитьПараметр("Год",НачалоГода(ТекущаяДата()));
			Попытка
				Количество=запрос.Выполнить().Выгрузить().Получить(0);
			Исключение
				Количество=0;
			КонецПопытки;
			
		иначе
			запрос=новый Запрос;
			запрос.Текст="ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИнформацияШКЛН.ШК) КАК Количество
			|ИЗ
			|	РегистрСведений.ИнформацияШКЛН КАК ИнформацияШКЛН
			|ГДЕ
			|	ИнформацияШКЛН.Год = &Год
			|	И ИнформацияШКЛН.ВидНакладной = &ВидНакладной
			|	И ИнформацияШКЛН.НомерНакладной = &НомерНакладной";
			запрос.УстановитьПараметр("ВидНакладной",Вид);
			запрос.УстановитьПараметр("НомерНакладной",Номер);
			запрос.УстановитьПараметр("Год",НачалоГода(ТекущаяДата()));
			Попытка
				Количество=запрос.Выполнить().Выгрузить().Получить(0).количество;
			Исключение
				Количество=0;
			КонецПопытки;	
		КонецЕсли;
		
		Накладная=Вид+" "+Номер;
		если Количество>0 тогда
			накладная=Накладная+" ("+Количество+" кор.)";
		КонецЕсли;
	КонецЕсли;
	Возврат Накладная;	
	
	
	
КонецФункции
//06.02.15 кухарь конец

Функция ПрочитатьЗначениеРеквизитаПНКПРМРНК(ИмяРеквизита,ДокОбъектСсылка)  Экспорт 
	
	если ИмяРеквизита="ДатаПечатиДокументов" тогда
		ПолучаемоеЗначение=ПустаяДата();
	иначе
		ПолучаемоеЗначение="";
	КонецЕсли;
	
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	запрос.УстановитьПараметр("Документ",ДокОбъектСсылка);
	запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПолучаемоеЗначение=результат.ЗначениеРеквизита;
	КонецЦикла;
	
	Возврат ПолучаемоеЗначение;
	
КонецФункции

//Кухарь 29.11.15 начало
//Для отчёта по распределению накладных по УСО + нераспределённые
Функция ПолучитьУникальнуюСтрокуПунктаДоставки(ПунктДоставки, ТранспортнаяКомпания, ДатаОтгрузки)  экспорт
	//Кухарь 15.12.15 начало
	//Так Уникальнее
	//Возврат ПунктДоставки.Наименование+?(ТранспортнаяКомпания<>"ОВЛ" и ТранспортнаяКомпания<>"Не распределено!!!!!!!!",ТранспортнаяКомпания.Наименование,ТранспортнаяКомпания)+Строка(ДатаОтгрузки);
	Возврат ПунктДоставки.АдресПолучателя+?(ТранспортнаяКомпания<>"ОВЛ" и ТранспортнаяКомпания<>"Не распределено!!!!!!!!",ТранспортнаяКомпания.Наименование,ТранспортнаяКомпания)+Строка(ДатаОтгрузки);
	//Кухарь 15.12.15 конец	
	
КонецФункции
//Кухарь 29.11.15 конец

//Кухарь 24.12.15 начало
//Для отчёта по распределению накладных по УСО + нераспределённые
Функция ПолучитьУникальнуюСтрокуПунктаПерегруза(ПунктДоставки, ТранспортнаяКомпания, ДатаОтгрузки)  экспорт
	//Кухарь 24.08.18 начало
	//Иногда входные параметры = null  
	//Возврат ПунктДоставки.код+Строка(ДатаОтгрузки);
	попытка
		Возврат ПунктДоставки.код+Строка(ДатаОтгрузки);
	Исключение возврат null
	КонецПопытки;	
	//Кухарь 24.08.18 конец
	
	
КонецФункции
//Кухарь 24.12.15 конец

//Кухарь 17.05.16 начало
Функция ПолучитьУникальнуюСтрокуНаборногоПоля(ПунктДоставки, ТранспортнаяКомпания, ДатаОтгрузки,ПунктПерегруза)  экспорт
	//Кухарь 24.08.18 начало
	//Иногда входные параметры = null
	попытка
		//Кухарь 24.08.18 конец
		
		если ТранспортнаяКомпания=null или ТранспортнаяКомпания=Неопределено или ТранспортнаяКомпания="Не распределено!!!!!!!!" или ТранспортнаяКомпания="ОВЛ" тогда 
			Возврат ПунктПерегруза.код+Строка(ДатаОтгрузки);
		иначе
			если ТранспортнаяКомпания.код="SSR-0515" или ТранспортнаяКомпания.код="SSR-0515" или ТранспортнаяКомпания.код="SSR-5056" или ТранспортнаяКомпания.код="SSP-6039" или ТранспортнаяКомпания.код="SSR-3668" или ТранспортнаяКомпания.код="SSR-4914" или ТранспортнаяКомпания.код="SSR-3819" тогда 	
				Возврат ПунктДоставки.код+Строка(ДатаОтгрузки);
			иначе
				
				Возврат ПунктПерегруза.код+Строка(ДатаОтгрузки);
			КонецЕсли;
			
		КонецЕсли;
		//Кухарь 24.08.18 начало
		//Иногда входные параметры = null
	Исключение
		возврат null;
	КонецПопытки;
	//Кухарь 24.08.18 конец
	
КонецФункции
//Кухарь 17.05.16 конец

//Кухарь 28.07.16 начало
Функция ПолучитьИмяКомпьютераИзЛогов(ТекстСообщения)    экспорт
	если ложь тогда
		ТекстСообщения="Пользователь: Шишкина С.Н., компьютер: KASSA1-VGS Чек: VGS-006678 Время: 4 сек.";
	КонецЕсли;
	
	НачСимвол=Найти(ТекстСообщения,"компьютер:");
	КонСимвол=Найти(ТекстСообщения,"Чек:");
	
	Если НачСимвол=0 или КонСимвол=0 тогда
		возврат "";
	Иначе
		Возврат Сред(ТекстСообщения,НачСимвол+11,КонСимвол-НачСимвол-12);
	КонецЕсли;
	
	
КонецФункции
//Кухарь 28.07.16 конец

//нечаева 05,09,17+++
Функция СФНакладной(РНК) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	НЕ Ссылка.ПометкаУдаления
	|	И Накладные.Накладная = &РНК";	
	
	Запрос.УстановитьПараметр("РНК",РНК);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат Документы.СчетФактура.ПустаяСсылка();
	
КонецФункции
//нечаева 05,09,17---

//нечаева 25,10,21+++
Функция КСФНакладной(РНК) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	СчетФактура.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.КорректировочныйСчетФактура КАК СчетФактура
	             |ГДЕ
	             |	НЕ СчетФактура.Ссылка.ПометкаУдаления
	             |	И СчетФактура.Накладные.Накладная.ДокОснование = &РНК
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СчетФактура.Дата УБЫВ";	
	
	Запрос.УстановитьПараметр("РНК",РНК);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат Документы.корректировочныйСчетФактура.ПустаяСсылка();
	
КонецФункции
//нечаева 25,10,21---

// нечаева 17,10,24+++
Функция СписокКСФНакладной(РНК) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ 
	             |	СчетФактура.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.КорректировочныйСчетФактура КАК СчетФактура
	             |ГДЕ
	             |	НЕ СчетФактура.Ссылка.ПометкаУдаления
	             |	И СчетФактура.Накладные.Накладная.ДокОснование = &РНК
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СчетФактура.Дата УБЫВ";	
	
	Запрос.УстановитьПараметр("РНК",РНК);
	
	Выборка=Запрос.Выполнить().Выгрузить();
    Если выборка.Количество()>0 Тогда
		
		Возврат Выборка;
		
	Иначе
		 Возврат неопределено;
		
	КонецЕсли;	
	
КонецФункции
//нечаева 17,10,24---

//нечаева 07,03,18++
Функция СостояниеЭУПД(РНК) Экспорт	
	
	Состояние = неопределено;
	
	Если рнк.контрагент.отправлятьУПД = ложь Тогда
		
	КонецЕсли;	
	
	//Запрос = Новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	СостояниеЭлектронногоУПД.СостояниеУПД
	//|ИЗ
	//|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	//|ГДЕ
	//|	СостояниеЭлектронногоУПД.Объект = &текОб
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СостояниеЭлектронногоУПД.Дата УБЫВ";
	//Запрос.УстановитьПараметр("ТекОб",рнк);
	//рр = Запрос.Выполнить().Выбрать();
	//
	
	
	//нечаева 19,06,18+++ сначала смотрим ручную корректировку	
	//нечаева 19,06,18+++ сначала смотрим ручную корректировку	
	//нечаева 19,06,18+++ сначала смотрим ручную корректировку	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектовУПД.Объект,
	|	ЗначенияСвойствОбъектовУПД.СостояниеУПД
	|ИЗ
	|	РегистрСведений.СостояниеЭлектрУПДРучнаяКорр КАК ЗначенияСвойствОбъектовУПД
	|ГДЕ
	|	ЗначенияСвойствОбъектовУПД.Объект = &ТекОб";
	
	
	Запрос.УстановитьПараметр("ТекОб",РНк);
	рр = Запрос.Выполнить().Выбрать();
	
	Если РР.Следующий() Тогда
		Состояние = РР.СостояниеУПД;
		возврат состояние;
	КонецЕсли;
	//нечаева 19,06,18----	
	
	
	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектовУПД.Объект,
	|	ЗначенияСвойствОбъектовУПД.Свойство,
	|	ЗначенияСвойствОбъектовУПД.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектовУПД
	|ГДЕ
	|	ЗначенияСвойствОбъектовУПД.Объект = &ТекОб
	|	И ЗначенияСвойствОбъектовУПД.Свойство = &Свойство";
	
	СФ = СФНакладной(РНК);			   
	Если СФ<>неопределено Тогда
		Запрос.УстановитьПараметр("ТекОб",СФ);
	иначе
		Запрос.УстановитьПараметр("ТекОб",РНк);
	КонецЕсли;
	Св = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_Статус"));
	Запрос.УстановитьПараметр("Свойство",Св);
	
	рр = Запрос.Выполнить().Выбрать();
	
	
	
	
	Если РР.Следующий() Тогда
		Состояние = РР.Значение;
	КонецЕсли;
	
	возврат состояние;		
	
КонецФункции
//нечаева 25,01,18--


//нечаева 12,01,26 ++ HELP-8463
Функция СостояниеЭУПД_ЧЗ(РНК) Экспорт	
	
	Состояние = неопределено;
	
	Если рнк.контрагент.отправлятьУПД = ложь Тогда
		 возврат состояние;
	КонецЕсли;	
	
	// Нечаева 24,02,26 +++ HELP-8559
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостояниеЭУПД_в_ЧЗ.СостояниеУПД КАК Значение
	               |ИЗ
	               |	РегистрСведений.СостояниеЭУПД_в_ЧЗ_РучнаяКорр КАК СостояниеЭУПД_в_ЧЗ
	               |ГДЕ
	               |	СостояниеЭУПД_в_ЧЗ.Объект = &ТекОб
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СостояниеЭУПД_в_ЧЗ.Дата УБЫВ";
		
	СФ = СФНакладной(РНК);			   
	Если СФ<>неопределено Тогда
		Запрос.УстановитьПараметр("ТекОб",СФ);
	иначе
		Запрос.УстановитьПараметр("ТекОб",РНк);
	КонецЕсли;
	
	рр = Запрос.Выполнить().Выбрать();
	
	Если РР.Следующий() Тогда
		Состояние = РР.Значение;
		возврат состояние;
	КонецЕсли;
	// Нечаева 24,02,26 ---HELP-8559
	

	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостояниеЭУПД_в_ЧЗ.СостояниеУПД КАК Значение
	               |ИЗ
	               |	РегистрСведений.СостояниеЭУПД_в_ЧЗ КАК СостояниеЭУПД_в_ЧЗ
	               |ГДЕ
	               |	СостояниеЭУПД_в_ЧЗ.Объект = &ТекОб
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СостояниеЭУПД_в_ЧЗ.Дата УБЫВ";
	
	
	
	СФ = СФНакладной(РНК);			   
	Если СФ<>неопределено Тогда
		Запрос.УстановитьПараметр("ТекОб",СФ);
	иначе
		Запрос.УстановитьПараметр("ТекОб",РНк);
	КонецЕсли;
	
	рр = Запрос.Выполнить().Выбрать();
	
	
	Если РР.Следующий() Тогда
		Состояние = РР.Значение;
	КонецЕсли;
	
	возврат состояние;		
	
КонецФункции
//нечаева 12,01,26  -- HELP-8463



//нечаева 25,01,18 +++
Функция КомментарийЭУПД(РНК) Экспорт	
	
	Состояние = неопределено;
	
	Если рнк.контрагент.отправлятьУПД = ложь Тогда
		
	КонецЕсли;	
	//
	//Запрос = Новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//			   |	ВЫРАЗИТЬ(СостояниеЭлектронногоУПД.Комментарий КАК СТРОКА(300)) КАК Комментарий
	//			   |ИЗ
	//			   |	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	//			   |ГДЕ
	//			   |	СостояниеЭлектронногоУПД.Объект = &текОб
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	СостояниеЭлектронногоУПД.Дата УБЫВ";
	//Запрос.УстановитьПараметр("ТекОб",рнк);
	//рр = Запрос.Выполнить().Выбрать();
	//Если РР.Следующий() Тогда
	//	Состояние = РР.Комментарий;
	//КонецЕсли;
	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектовУПД.Объект,
	|	ЗначенияСвойствОбъектовУПД.Свойство,
	|	ЗначенияСвойствОбъектовУПД.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектовУПД
	|ГДЕ
	|	ЗначенияСвойствОбъектовУПД.Объект = &ТекОб
	|	И ЗначенияСвойствОбъектовУПД.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("ТекОб",РНк);
	
	//СФ = СФНакладной(РНК);			   
	//Если СФ<>неопределено Тогда
	//	Запрос.УстановитьПараметр("ТекОб",СФ);
	//иначе
	//	Запрос.УстановитьПараметр("ТекОб",РНк);
	//КонецЕсли;
	Св = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_Уточнение"));
	Запрос.УстановитьПараметр("Свойство",Св);
	
	рр = Запрос.Выполнить().Выбрать();
	
	
	
	Если РР.Следующий() Тогда
		Состояние = РР.Значение;
	КонецЕсли;
	
	возврат состояние;		
	
	
	
	
	возврат состояние;		
	
КонецФункции

//нечаева 25,01,18--
//нечаева 07,03,18---		

//нечаева 04,07,18++
Функция СостояниеЭУПД_ПоНашемуРегистру(РНК) Экспорт	
	
	Состояние = неопределено;
	
	Если рнк.контрагент.отправлятьУПД = ложь Тогда
		
	КонецЕсли;	
	
	//Запрос = Новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	СостояниеЭлектронногоУПД.СостояниеУПД
	//|ИЗ
	//|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	//|ГДЕ
	//|	СостояниеЭлектронногоУПД.Объект = &текОб
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СостояниеЭлектронногоУПД.Дата УБЫВ";
	//Запрос.УстановитьПараметр("ТекОб",рнк);
	//рр = Запрос.Выполнить().Выбрать();
	//
	
	// ручная корректировка
	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектовУПД.Объект,
	|	ЗначенияСвойствОбъектовУПД.СостояниеУПД
	|ИЗ
	|	РегистрСведений.СостояниеЭлектрУПДРучнаяКорр КАК ЗначенияСвойствОбъектовУПД
	|ГДЕ
	|	ЗначенияСвойствОбъектовУПД.Объект = &ТекОб";
	
	
	Запрос.УстановитьПараметр("ТекОб",РНк);
	рр = Запрос.Выполнить().Выбрать();
	
	Если РР.Следующий() Тогда
		Состояние = РР.СостояниеУПД;
		возврат состояние;
	КонецЕсли;
	
	
	
	////-------------------
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектовУПД.Объект,
	|	ЗначенияСвойствОбъектовУПД.СостояниеУПД
	|ИЗ
	|	РегистрСведений.СостояниеЭлектронногоУПД КАК ЗначенияСвойствОбъектовУПД
	|ГДЕ
	|	ЗначенияСвойствОбъектовУПД.Объект = &ТекОб
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначенияСвойствОбъектовУПД.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ТекОб",РНк);
	//			   СФ = СФНакладной(РНК);			   
	//			   Если СФ<>неопределено Тогда
	//				   Запрос.УстановитьПараметр("ТекОб",СФ);
	//			   иначе
	//				   Запрос.УстановитьПараметр("ТекОб",РНк);
	//			   КонецЕсли;
	//Св = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_Статус"));
	//Запрос.УстановитьПараметр("Свойство",Св);
	
	рр = Запрос.Выполнить().Выбрать();
	
	
	
	
	Если РР.Следующий() Тогда
		Состояние = РР.СостояниеУПД;
	КонецЕсли;
	
	возврат состояние;		
	
КонецФункции
//нечаева 04,07,18--

//нечаева24,05,18 +++
Функция КомментарийЭУПД_Расширенный(РНК) Экспорт	
	
	Состояние = неопределено;
	
	Если рнк.контрагент.отправлятьУПД = ложь Тогда
		
	КонецЕсли;	
	СФ =  СФНакладной(РНК);
	
	Если СФ = Документы.СчетФактура.ПустаяСсылка() Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	СостояниеЭлектронногоУПД.Комментарий
	|ИЗ
	|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	|ГДЕ
	|	СостояниеЭлектронногоУПД.СостояниеУПД = &Свойство
	|	И СостояниеЭлектронногоУПД.Объект = &ТекОб";
	
	Запрос.УстановитьПараметр("ТекОб",СФ);
	Запрос.УстановитьПараметр("Свойство",перечисления.СостояниеУПД.ПолученоУведомлениеОбУточнении);
	
	рр = Запрос.Выполнить().Выбрать();
	
	
	Если РР.Следующий() Тогда
		Состояние = РР.Комментарий;
	КонецЕсли;
	
	возврат состояние;		
	
КонецФункции
//нечаева24,05,18 ---


//нечаева 08,06,18 +++
Функция ДатаКомментарияЭУПД_Расширенный(РНК) Экспорт	
	
	Состояние = неопределено;
	
	Если рнк.контрагент.отправлятьУПД = ложь Тогда
		
	КонецЕсли;	
	СФ =  СФНакладной(РНК);
	
	Если СФ = Документы.СчетФактура.ПустаяСсылка() Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеЭлектронногоУПД.Комментарий,
	|	СостояниеЭлектронногоУПД.Дата
	|ИЗ
	|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	|ГДЕ
	|	СостояниеЭлектронногоУПД.СостояниеУПД = &Свойство
	|	И СостояниеЭлектронногоУПД.Объект = &ТекОб";
	
	Запрос.УстановитьПараметр("ТекОб",СФ);
	Запрос.УстановитьПараметр("Свойство",перечисления.СостояниеУПД.ПолученоУведомлениеОбУточнении);
	
	рр = Запрос.Выполнить().Выбрать();
	
	
	Если РР.Следующий() Тогда
		Состояние = РР.Дата;
	КонецЕсли;
	
	возврат состояние;		
	
КонецФункции
//нечаева 08,06,18 ---

//21,03,18 нечаева +++
Функция ПолучитьСтатусАктаПриемки(СФ)  Экспорт
	
	Если СФ = Неопределено или СФ = Null Тогда
		
		возврат "Не обнаружен акт";
		
	КонецЕсли;
	Запрос = Новый Запрос;
	СтатусАкта = "";
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктПриемки.СостояниеДокумента,
	|	АктПриемки.РНК
	|ИЗ
	|	Документ.АктПриемки КАК АктПриемки
	|ГДЕ
	|	АктПриемки.РНК = &РНК";
	Для Каждого РНК из СФ.Накладные Цикл
		Запрос.УстановитьПараметр("РНК", РНК.Накладная);
		Выборка = Запрос.Выполнить().Выбрать();
		попытка
			Если Выборка.Следующий() Тогда
				Если Выборка.СостояниеДокумента = Перечисления.СостоянияНакладной.Принята Тогда
					Возврат "Товар получен покупателем, но имеются расхождения";
				КонецЕсли;
			Иначе
				Возврат "Не обнаружен акт";
			КонецЕсли;
		исключение
			Возврат "Не обнаружен акт";
		конецПопытки;
	КонецЦикла;
	попытка
		РНК = Выборка.РНК;
	исключение
		РНК = СФ.накладные[0].Накладная;
	конецПопытки;
	
	Возврат "Товар по получен покупателем";
	
КонецФункции
//21,03,18 нечаева ---

// 02,10,2018 нечаева +++
Функция ЦенаНоменклатурыПоМатрицеНеАкция(Номенклатура,Контрагент,ПунктДоставки=неопределено,ДатаРасчета) Экспорт
	
	Если  Номенклатура=Null или Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат или Номенклатура=неопределено Тогда Возврат 0 КонецЕсли;	
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	ДатаРасчетаЦены= Датарасчета;
	Если ПунктДоставки=неопределено тогда ПунктДоставки=Справочники.ПунктыДоставки.ПустаяСсылка() КонецЕсли;
	
	//
	////нечаева 11,04,14+++	
	//ТекТовар = номенклатура;
	////-------------------------------------------------------------------------------
	//ТЗМартицПоФА=новый ТаблицаЗначений;
	////------------------------------------------
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВложенныйЗапрос.Ссылка
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
	//|		СУММА(1) КАК кол,
	//|		Матрица.Ссылка КАК Ссылка
	//|	ИЗ
	//|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
	//|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
	//|	ГДЕ
	//|		Матрица.Контрагент = &Контрагент
	//|		И Матрица.Дата <= &Дата1
	//|		И Матрица.ДатаОкончания >= &Дата2
	//|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		МатрицаПунктыДоставки.ПунктДоставки,
	//|		Матрица.Ссылка) КАК ВложенныйЗапрос
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//
	//Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	//Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("пустая",справочники.ПунктыДоставки.ПустаяСсылка());
	//// цена по акции
	//ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
	//
	
	////---------------------------------------------
	//ЕстьМартицаПоФактАдресу=ложь;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	МатрицаПунктыДоставки.Ссылка
	//|ИЗ
	//|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	//|ГДЕ
	//|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
	//|	И МатрицаПунктыДоставки.Ссылка.Проведен
	//|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
	//|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
	//|		И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//
	//Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	//Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
	//// цена по акции
	//ТЗМК = Запрос.Выполнить().Выгрузить();
	//
	//Если ТЗМК.Количество()>0 Тогда
	//	ЕстьМартицаПоФактАдресу=истина;
	//конецЕсли;
	//// список значений матриц с пустыми значениями.
	//
	//
	//ТекЦена=0;
	//
	//Если ЕстьМартицаПоФактАдресу Тогда
	//	
	//	//считаем по матрице. для конкретного факт. адреса
	//	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	МатрицаТовары.Номенклатура,
	//	|	МатрицаТовары.Цена,
	//	|	МатрицаПунктыДоставки.Ссылка
	//	|ИЗ
	//	|	Документ.Матрица.Товары КАК МатрицаТовары
	//	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	//	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	//	|ГДЕ
	//	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	//	|	И МатрицаТовары.Ссылка.Проведен
	//	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	//	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	//	|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
	//	|	И МатрицаТовары.Номенклатура = &ТекНом
	//	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	МатрицаТовары.Ссылка.Дата УБЫВ
	//	|АВТОУПОРЯДОЧИВАНИЕ";
	//	Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
	//	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	//	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//	Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
	//	// цена по акции
	//	ТЗ1 = Запрос.Выполнить().Выгрузить();
	//	ТЗ1 = Новый ТаблицаЗначений;
	//	ТЗ1.Колонки.Добавить("Номенклатура");
	//	
	//	//цена по основному способу расчета, без учета акции		
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	МатрицаТовары.Номенклатура,
	//	|	МатрицаТовары.Цена,
	//	|	МатрицаПунктыДоставки.Ссылка
	//	|ИЗ
	//	|	Документ.Матрица.Товары КАК МатрицаТовары
	//	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	//	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	//	|ГДЕ
	//	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	//	|	И МатрицаТовары.Ссылка.Проведен
	//	|	И МатрицаТовары.Ссылка.Акция = Ложь
	//	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	//	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	//	|	И МатрицаТовары.Номенклатура = &ТекНом
	//	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	МатрицаТовары.Ссылка.Дата УБЫВ
	//	|АВТОУПОРЯДОЧИВАНИЕ";
	//	Запрос.УстановитьПараметр("ТекНом",ТекТовар);
	//	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	//	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	//	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//	Запрос.УстановитьПараметр("ТекПункт",пунктДоставки);
	//	ТЗ2 = Запрос.Выполнить().Выгрузить();
	//	
	//	Отбор = новый Структура;
	//	Отбор.Вставить("Номенклатура",ТекТовар);
	//	СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
	//	СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
	//	ТекЦена=0;
	//	Если СтрокиМатриц.Количество() = 0 Тогда
	//		// смотрим по основной базе
	//		Если СтрокиМатриц2.Количество() = 0 Тогда
	//			ТекЦена=0;
	//		Иначе
	//			Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
	//				ТекЦена=СтрокаМатриц.Цена;
	//			КонецЦикла;
	//		КонецЕсли;
	//		
	//	Иначе
	//		
	//		Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
	//			ТекЦена=СтрокаМатриц.Цена;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//	
	//иначе 
	//	// берем по матрицам без заполненных факт адресов.
	//	
		
		ТекТовар = номенклатура;
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	МатрицаТовары.Номенклатура,
		//|	МатрицаТовары.Цена,
		//|	МатрицаТовары.Ссылка
		//|ИЗ
		//|	Документ.Матрица.Товары КАК МатрицаТовары
		//|ГДЕ
		//|	МатрицаТовары.Ссылка.Дата <= &Дата1
		//|	И МатрицаТовары.Ссылка.Проведен
		//|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		//|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		//|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		//|	И МатрицаТовары.Номенклатура = &ТекНом
		////|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	МатрицаТовары.Ссылка.Дата УБЫВ
		//|АВТОУПОРЯДОЧИВАНИЕ";
		//Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		//Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		//Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		//Запрос.УстановитьПараметр("Контрагент",Контрагент);
		//Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		//
		// цена по акции
		ТЗ1 = Новый ТаблицаЗначений; //Запрос.Выполнить().Выгрузить();
		ТЗ1.Колонки.Добавить("Номенклатура");
		
		//цена по основному способу расчета, без учета матрицы.		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Акция = Ложь
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		//|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		//Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					
						ТекЦена=СтрокаМатриц.Цена;
						прервать;
					
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				//ТекЦена=СтрокаМатриц.Цена;
				//Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
					ТекЦена=СтрокаМатриц.Цена;
					прервать;
				//конецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
	//конецЕсли;
	//нечаева 11,04,14
	
	Возврат ТекЦена;
	
	
КонецФункции

Функция ЦенаПоследнегоПрихода(Номенклатура, Дата2) Экспорт 
	
	ЦПП = 0 ;
	
	ДатаРеквизита=Неопределено;
	//ЦПП		=ПолучитьПериодическийРеквизит(Номенклатура,"ЦенаПоследнегоПрихода",Дата,,ДатаРеквизита);
		Дата2=?(Дата2=Неопределено,ТекущаяДата(),Дата2);
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	История.Значение,
		             |	История.Период КАК Период
		             |ИЗ
		             |	РегистрСведений.История КАК История
		             |ГДЕ
		             |	История.Объект В ИЕРАРХИИ(&Объект)
		             |	И История.Реквизит = &Реквизит
		             |	И История.Период <= &Дата2
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Период УБЫВ";			
		
		
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	Запрос.УстановитьПараметр("Объект",Номенклатура);
	Запрос.УстановитьПараметр("Реквизит","ЦенаПоследнегоПрихода");
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла; 
	
	
	
	Возврат 0;
			
КонецФункции
//02,10,18----

//крохин начало 23.01.2019
Функция ПолучитьПоследнийСтатусДоставки(Накладная)   Экспорт
запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	СтатусыДоставкиСрезПоследних.Статус,
	             |	СтатусыДоставкиСрезПоследних.Дополнительно
	             |ИЗ
	             |	РегистрСведений.СтатусыДоставки.СрезПоследних(&Дата, Документ = &Документ) КАК СтатусыДоставкиСрезПоследних";
	запрос.УстановитьПараметр("Документ",Накладная);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	результат=запрос.Выполнить().Выбрать();
	ВремТекст="";
	пока результат.Следующий() цикл
		ВремТекст=ВремТекст+результат.Статус+"  "+результат.Дополнительно+символы.ПС;
	КонецЦикла;
	 Возврат ВремТекст;
КонецФункции
//крохин конец 23.01.2019

//крохин начало 06.03.2019
Функция ПолучитьГодДаты(Дата) Экспорт 
	Возврат Прав(формат(Дата,"ДФ=dd.MM.yyyy"),4) + "г.";
КонецФункции

Функция ПолучитьМесяцДаты(Дата) Экспорт
	МесяцДаты = Сред(формат(Дата,"ДФ=dd.MM.yyyy"),4,2);
	Если МесяцДаты = "01" Тогда
		МесяцДаты = "Январь";
	ИначеЕсли МесяцДаты = "02" Тогда
		МесяцДаты = "Февраль";
	ИначеЕсли МесяцДаты = "03" Тогда
		МесяцДаты = "Март";
	ИначеЕсли МесяцДаты = "04" Тогда
		МесяцДаты = "Апрель";
    ИначеЕсли МесяцДаты = "05" Тогда
		МесяцДаты = "Май";
    ИначеЕсли МесяцДаты = "06" Тогда
		МесяцДаты = "Июнь";
    ИначеЕсли МесяцДаты = "07" Тогда
		МесяцДаты = "Июль";
    ИначеЕсли МесяцДаты = "08" Тогда
		МесяцДаты = "Август";
    ИначеЕсли МесяцДаты = "09" Тогда
		МесяцДаты = "Сентябрь";
    ИначеЕсли МесяцДаты = "10" Тогда
		МесяцДаты = "Октябрь";
    ИначеЕсли МесяцДаты = "11" Тогда
		МесяцДаты = "Ноябрь";
    ИначеЕсли МесяцДаты = "12" Тогда
		МесяцДаты = "Декабрь";
	КонецЕсли;
	Возврат МесяцДаты + " "+ПолучитьГодДаты(Дата); 
КонецФункции

Функция ПолучитьКварталДаты(Дата)    Экспорт
	Дата = НачалоКвартала(Дата);
	КварталДаты = Сред(формат(Дата,"ДФ=dd.MM.yyyy"),4,2);
	Если КварталДаты = "01" Тогда
		КварталДаты = "1 квартал";
	ИначеЕсли КварталДаты = "04" Тогда
		КварталДаты = "2 квартал";	
	ИначеЕсли КварталДаты = "07" Тогда
		КварталДаты = "3 квартал";
	ИначеЕсли КварталДаты = "10" Тогда
		КварталДаты = "4 квартал";	
	КонецЕсли;
	Возврат КварталДаты + " "+ПолучитьГодДаты(Дата); 
КонецФункции
//крохин конец 06.03.2019

Функция получитьДекларацию(Модель,ТипРеквизита=неопределено) Экспорт
	
	
		декларация = ПолучитьГрупповойПериодическийРеквизит(Модель,"Декларация",ТекущаяДата());
		
				
		Если декларация <> Неопределено тогда
			НомерД = декларация.Наименование;
			Изготовитель = декларация.Изготовитель;
			Орган = декларация.Орган;
			ВидДокумента = декларация.ВидДокумента;	
			ДатаНачала = Формат(декларация.ДатаНачала,"ДФ=dd.MM.yy");
			ДатаОкончания = Формат(декларация.ДатаОкончания,"ДФ=dd.MM.yy");
			СтранаПроисхождения = Декларация.СтранаПроисхождения;
			попытка
				Филиал = Декларация.Филиал;
			исключение
				филиал="";
			конецПопытки;

		иначе
			НомерД = "";
			Изготовитель = "";
			Орган = "";
			ВидДокумента = "";	
			ДатаНачала = "";
			ДатаОкончания = "";
			СтранаПроисхождения="";
			Филиал="";
		КонецЕсли;
		
		Если ТипРеквизита = "Изготовитель"	 тогда
			
			возврат Изготовитель;
		иначеЕсли типРеквизита = "Филиал" ТОгда
			возврат филиал;
		иначеЕсли типРеквизита = "СтранаПроисхождения" ТОгда
			возврат СтранаПроисхождения;
	
		иначе
			возврат Изготовитель;
		КонецЕсли;	  
	

		
		
		
	  возврат СтранаПроисхождения;
	
	
КонецФункции

//крохин начало 01.04.2021
Функция ПолучитьНаименованияЗначковПоУходу(Номенклатура,ЗначокУход)    Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыУпаковкиЗначки.Значок.Наименование КАК ЗначокНаименование
	               |ИЗ
	               |	Справочник.ТипыУпаковки.Значки КАК ТипыУпаковкиЗначки
	               |ГДЕ
	               |	ТипыУпаковкиЗначки.Значок В ИЕРАРХИИ(&ЗначокУход)
	               |	И ТипыУпаковкиЗначки.Ссылка = &ОсновнойТипУпаковки";
				   
				   Запрос.УстановитьПараметр("ОсновнойТипУпаковки",Номенклатура.Родитель.ОсновнойТипУпаковки);
				   Запрос.УстановитьПараметр("ЗначокУход",ЗначокУход);
				   
Выборка = запрос.Выполнить().Выбрать();
НаименованиеУхода = "";
Пока Выборка.Следующий() Цикл
НаименованиеУхода = НаименованиеУхода + Выборка.ЗначокНаименование + ",";	
КонецЦикла; 
Если не ПустаяСтрока(НаименованиеУхода) Тогда
	НаименованиеУхода = Лев(НаименованиеУхода,СтрДлина(НаименованиеУхода)-1);
КонецЕсли;
Возврат НаименованиеУхода;
КонецФункции

//крохин конец 01.04.2021

//крохин начало 19.05.2021
Функция ДатаПоследнегоДвиженияРегистра(НаименованиеРегистра,НаименованиеИзмерения,ЗначениеИзмерения,ВидДвижения = Неопределено) Экспорт
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
               |	НаименованиеРегистра.Период КАК Период
               |ИЗ
               |	РегистрНакопления."+НаименованиеРегистра + " КАК НаименованиеРегистра
               |ГДЕ
               |	НаименованиеРегистра."+ НаименованиеИзмерения +"= &ЗначениеИзмерения";
Если ВидДвижения <> Неопределено Тогда
	Запрос.Текст = Запрос.Текст + "
               |	И НаименованиеРегистра.ВидДвижения = &ВидДвижения";
		   КонецЕсли;
	Запрос.Текст = Запрос.Текст + "	   
               |
               |УПОРЯДОЧИТЬ ПО
               |	НаименованиеРегистра.Период УБЫВ";

Запрос.УстановитьПараметр("ЗначениеИзмерения",ЗначениеИзмерения);
Запрос.УстановитьПараметр("ВидДвижения",ВидДвижения);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Возврат Выборка.Период;
Иначе
	Возврат ПустаяДата();
	КонецЕсли;
КонецФункции
//крохин конец 19.05.2021

// ФУНКЦИЯ ОКРУГЛЕНИЯ "ОКРУГЛТ" (как в EXCEL)
// y = x * Цел(ч/x)
Функция ОКРУГЛТ(Знач Результат, Знач Показатель) Экспорт
	Возврат ?(Показатель <> 0, Показатель * Цел(Результат/Показатель), 0);
КонецФункции

// ФУНКЦИЯ ПЕРВОЕ/ПОСЛЕДНЕЕ ДВИЖЕНИЕ РЕГИСТРА В УКАЗАННОМ ДИАПАЗОНЕ
// Шворобей ВЮ 25.02.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1654
Функция ДатаДвиженияРегистраНакопленияВДиапазоне(НаименованиеИзмерения = "Номенклатура", ЗначениеИзмерения, ДатаНачала, ДатаОкончания,
		НаименованиеРегистра, ФлагВидДвижения = "Приход", ФлагЗаписи = "Первая") Экспорт
	
	МассивКодовОпераций = Новый Массив;
	
	Если ФлагВидДвижения = "Приход" Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
		МассивКодовОпераций.Добавить(Перечисления.КодыОперацийОстатки.ЗакупкаР);
	ИначеЕсли ФлагВидДвижения = "Расход" Тогда
		ВидДвижения = ВидДвиженияНакопления.Расход;
		МассивКодовОпераций.Добавить(Перечисления.КодыОперацийОстатки.Реализация);
	КонецЕсли;
	
	Если СокрЛП(НаименованиеИзмерения) = "" Тогда
		НаименованиеИзмерения = ЗначениеИзмерения.Метаданные().Имя;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	Запрос.УстановитьПараметр("ЗначениеИзмерения", ЗначениеИзмерения);
	Запрос.УстановитьПараметр("МассивКодовОпераций", МассивКодовОпераций);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрНакопления.Период КАК Период
	|ИЗ
	|	РегистрНакопления." + НаименованиеРегистра + " КАК РегистрНакопления
	|ГДЕ
	|	РегистрНакопления.ВидДвижения = &ВидДвижения
	|	И РегистрНакопления.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|	И РегистрНакопления." + НаименованиеИзмерения + " = &ЗначениеИзмерения
	|	И РегистрНакопления.КодОперации В (&МассивКодовОпераций)
	|
       |УПОРЯДОЧИТЬ ПО
       |	Период " + ?(ФлагЗаписи = "Последняя", "УБЫВ", "ВОЗР") + "
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;
	Иначе
		Возврат ПустаяДата();
	КонецЕсли;	
	
КонецФункции
// Шворобей ВЮ 25.02.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1654

// Кухарь А.Ю. 12.02.2024 начало
//
Функция ПолучитьКартинкуИзПутиКФайлу (ПутьКФайлу) экспорт
	если ТипЗнч(ПутьКФайлу)=Тип("Строка") и СтрДлина(ПутьКФайлу)>10 тогда
		Файл=новый Файл(ПутьКФайлу);
		если Файл.Существует() тогда
			//Возврат новый ДвоичныеДанные(ПутьКФайлу);
			возврат новый Картинка(ПутьКФайлу);
			
		КонецЕсли;
	КонецЕсли;
	
	
	возврат Неопределено;
КонецФункции
// Кухарь А.Ю. 12.02.2024 конец


// Кухарь А.Ю.  27.02.2024 начало
//
Функция ПроверитьНоменклатуруНаВхождениеНаименованийМоделиЦветаРазмера (НаименованиеМодели,НаименованиеЦвета,НаименованиеРазмера,НаименованиеЭлемента) Экспорт 
	НаименованиеМодели=СокрЛП(НаименованиеМодели);	
	НаименованиеЦвета=СокрЛП(НаименованиеЦвета);	
	НаименованиеРазмера=СокрЛП(НаименованиеРазмера);	
	НаименованиеЭлемента=СокрЛП(НаименованиеЭлемента);
	ТекстРасхождения="";
	МассивРасхождений=новый Массив;
	если СтрНайти(НаименованиеЭлемента,НаименованиеМодели)=0 тогда
		МассивРасхождений.Добавить("В наименовании элемента нет модели");
	КонецЕсли;
	если СтрНайти(НаименованиеЭлемента,НаименованиеЦвета)=0 тогда
		МассивРасхождений.Добавить("В наименовании элемента нет цвета");
	КонецЕсли;
	если СтрНайти(НаименованиеЭлемента,НаименованиеРазмера)=0 тогда
		МассивРасхождений.Добавить("В наименовании элемента нет размера");
	КонецЕсли;
	если МассивРасхождений.Количество()>0 тогда
		ТекстРасхождения=СтрСоединить(МассивРасхождений,", ");
	КонецЕсли;
	
	возврат ТекстРасхождения;
	
	
	
КонецФункции
// Кухарь А.Ю.  27.02.2024 конец

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///// УНИВЕРСАЛЬНЫЕ ФУНКЦИИ РАБОТЫ С ЖУРНАЛОМ РЕГИСТРАЦИИ
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///// ПОЛУЧИТЬ ОБЪЕКТ ПО СТРОКЕ УИД (УНИВЕРСАЛЬНАЯ ФУНКЦИЯ)
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция НайтиОбъектПоУИД(УникальныйИдентификаторСтрокой, ТипМетаданных = "Справочник", ВидМетаданных = "") Экспорт
	
	УИД = Новый УникальныйИдентификатор(УникальныйИдентификаторСтрокой);
	
	Если ТипМетаданных = "Справочник" Тогда
		Ссылка = ПолучитьСсылкуПоМенеджеруОбъекта(Справочники[ВидМетаданных], УИД);
	ИначеЕсли ТипМетаданных = "Документ" Тогда
		Ссылка = ПолучитьСсылкуПоМенеджеруОбъекта(Документы[ВидМетаданных], УИД);
	КонецЕсли;
	
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСсылкуПоМенеджеруОбъекта(ОбъектыМенеджер, УИД)
	
	СсылкаГуид = ОбъектыМенеджер.ПолучитьСсылку(УИД);
	Если СсылкаГуид.ПолучитьОбъект() <> Неопределено Тогда
		Возврат СсылкаГуид;
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///// ПОЛУЧИТЬ ИЗМЕНЕНИЯ ИЗ ХРАНИЛИЩА ЗНАЧЕНИЙ (УНИВЕРСАЛЬНАЯ ФУНКЦИЯ)
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьИзмененияЖурналаРегистрации(Изменения) Экспорт
	
	СтруктураВозврата = Новый Структура("ИзмененияРеквизитов", Неопределено);
	
	Если ТипЗнч(Изменения) = Тип("ХранилищеЗначения") Тогда
		ИзмененияОбъекта = ЗначениеИзСтрокиВнутр(Изменения.Получить());
	Иначе
		ИзмененияОбъекта = ЗначениеИзСтрокиВнутр(Изменения);
	КонецЕсли;
	
	Если ТипЗнч(ИзмененияОбъекта) = Тип("Структура") Тогда
		Если ИзмененияОбъекта.Свойство("Реквизиты") Тогда
			Если ТипЗнч(ИзмененияОбъекта.Реквизиты) = Тип("ТаблицаЗначений") И ИзмененияОбъекта.Реквизиты.Количество() > 0 Тогда
				СтруктураВозврата.Вставить("ИзмененияРеквизитов", ИзмененияОбъекта.Реквизиты);
			КонецЕсли;
		КонецЕсли;
		Если ИзмененияОбъекта.Свойство("ТЧ") Тогда
			Для Каждого Элемент ИЗ ИзмененияОбъекта.ТЧ Цикл
				Если ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") И Элемент.Значение.Количество() > 0 Тогда
					СтруктураВозврата.Вставить(Элемент.Ключ, Элемент.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///// ПОИСК РЕКВИЗИТА ВНУТРИ ПОЛУЧЕННЫХ ИЗМЕНЕНИЙ С СОРТИРОВКОЙ ПО ДНЯМ И СОСТОЯНИЮ ОБЪЕКТА
///// НА ВЫХОДЕ - МАССИВ СТРУКТУР С ИСТОРИЕЙ ИЗМЕНЕНИЯ РЕКВИЗИТА ПОИСКА
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПоискИзмененийРеквизитаВЖурналеРегистрации(Объект, РеквизитПоиска = "", РеквизитТЧПоиска = "", НомерЗаписи = "Первая") Экспорт
	
	МассивРеквизитовПоиска = Новый Массив;
	МассивРеквизитовТЧПоиска = Новый Массив;
	
	////////// ПРОВЕРИМ, ЕСТЬ ЛИ ТАКОЙ РЕКВИЗИТ ///////////////////////////////////////////////////////
	Если НЕ ПустаяСтрока(РеквизитПоиска) ИЛИ НЕ ПустаяСтрока(РеквизитТЧПоиска) Тогда
		Представление = Объект.Метаданные().ПолноеИмя();
		
		Если Найти(Представление, "Документ") > 0 Тогда
			
			Если НЕ ПустаяСтрока(РеквизитПоиска) Тогда
				Если НЕ ЕстьРеквизитДокумента(РеквизитПоиска, Объект.Метаданные()) Тогда
					Возврат Новый Массив;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(РеквизитТЧПоиска) Тогда
				ФлагПоиска = Ложь;
				Для Каждого СтрТЧ ИЗ Объект.Метаданные().ТабличныеЧасти Цикл
					Если ЕстьРеквизитТабЧастиДокумента(РеквизитТЧПоиска, Объект.Метаданные(), СтрТЧ.Имя) Тогда
						ФлагПоиска = Истина;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ФлагПоиска Тогда
					Возврат Новый Массив;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Найти(Представление, "Справочник") > 0 Тогда
			
			Если НЕ ПустаяСтрока(РеквизитПоиска) Тогда
				Если НЕ ЕстьРеквизитОтчета(РеквизитПоиска, Объект.Метаданные()) Тогда
					Возврат Новый Массив; 
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(РеквизитТЧПоиска) Тогда
				ФлагПоиска = Ложь;
				Для Каждого СтрТЧ ИЗ Объект.Метаданные().ТабличныеЧасти Цикл
					Если ЕстьРеквизитТабЧастиДокумента(РеквизитТЧПоиска, Объект.Метаданные(), СтрТЧ.Имя) Тогда
						ФлагПоиска = Истина;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ФлагПоиска Тогда
					Возврат Новый Массив;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если НЕ ПустаяСтрока(РеквизитПоиска) И НЕ ПустаяСтрока(РеквизитТЧПоиска) Тогда
		ТекстПоиска = "И (ЖурналРегистрации.ИзмененияШапки = ИСТИНА ИЛИ ЖурналРегистрации.ИзмененияТЧ = ИСТИНА)";
	ИначеЕсли НЕ ПустаяСтрока(РеквизитПоиска) И ПустаяСтрока(РеквизитТЧПоиска) Тогда
		ТекстПоиска = "И ЖурналРегистрации.ИзмененияШапки = ИСТИНА";
	ИначеЕсли ПустаяСтрока(РеквизитПоиска) И НЕ ПустаяСтрока(РеквизитТЧПоиска) Тогда
		ТекстПоиска = "И ЖурналРегистрации.ИзмененияТЧ = ИСТИНА";
	Иначе
		ТекстПоиска = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УИДОбъекта", XMLСтрока(Объект));
	Запрос.Текст =
	"ВЫБРАТЬ " + ?(НомерЗаписи = "Первая" ИЛИ НомерЗаписи = "Последняя", "ПЕРВЫЕ 1", "") + "
	|	ЖурналРегистрации.День КАК День,
	|	ЖурналРегистрации.Изменения КАК Изменения,
	|	ЖурналРегистрации.ИзмененияШапки КАК ИзмененияШапки,
	|	ЖурналРегистрации.ИзмененияТЧ КАК ИзмененияТЧ,
	|	ВЫБОР
	|		КОГДА ЖурналРегистрации.СостояниеОбъекта = ""Первичная запись""
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЖурналРегистрации.СостояниеОбъекта = ""Перезапись""
	|					ТОГДА 1
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЖурналРегистрации.СостояниеОбъекта = ""Пометка на удаление""
	|							ТОГДА 2
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ЖурналРегистрации.СостояниеОбъекта = ""Снятие пометки на удаление""
	|									ТОГДА 3
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ЖурналРегистрации.СостояниеОбъекта = ""Удаление""
	|											ТОГДА 4
	|										ИНАЧЕ 5
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеОбъекта
	|ИЗ
	|	РегистрСведений.ЖурналРегистрации КАК ЖурналРегистрации
	|ГДЕ
	|	ЖурналРегистрации.ТекстСсылки = &УИДОбъекта
	|	" + ТекстПоиска + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	День " + ?(НомерЗаписи = "Последняя", "УБЫВ,", "ВОЗР,") + "
	|	СостояниеОбъекта";
	
	// СостояниеОбъекта - "Первичная запись", "Перезапись", "Пометка на удаление", "Снятие пометки на удаление", "Удаление"
	// " + ТекстПоиска + "
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивИменРеквизитовТЧ = Новый Массив;
	МассивИменРеквизитовТЧ.Добавить("Номенклатура");
	МассивИменРеквизитовТЧ.Добавить("Контрагент");
	МассивИменРеквизитовТЧ.Добавить("Договор");
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураВозврата = ПолучитьИзмененияЖурналаРегистрации(Выборка.Изменения);
		
		////////// ВНАЧАЛЕ СМОТРИМ ПО РЕКВИЗИТАМ ////////////////////////////////////////////////////////////
		Если НЕ ПустаяСтрока(РеквизитПоиска)
			И СтруктураВозврата.Свойство("ИзмененияРеквизитов") И СтруктураВозврата.ИзмененияРеквизитов <> Неопределено Тогда
			
			НайденныеСтроки = СтруктураВозврата.ИзмененияРеквизитов.НайтиСтроки(Новый Структура("Реквизит", РеквизитПоиска));
			
			Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
				СтруктураВывода = Новый Структура("День, Реквизит, НачЗнач, КонЗнач");
				ЗаполнитьЗначенияСвойств(СтруктураВывода, НайденнаяСтрока);
				СтруктураВывода.Вставить("День", Выборка.День);
				МассивРеквизитовПоиска.Добавить(СтруктураВывода);
			КонецЦикла;
		КонецЕсли;
		
		////////// ТЕПЕРЬ ПО ТАБЛИЧНЫМ ЧАСТЯМ ///////////////////////////////////////////////////////////////
		Если НЕ ПустаяСтрока(РеквизитТЧПоиска) Тогда
			Для Каждого СтрТЧ ИЗ Объект.Метаданные().ТабличныеЧасти Цикл
				
				Если СтруктураВозврата.Свойство(СтрТЧ.Имя) И СтруктураВозврата[СтрТЧ.Имя] <> Неопределено Тогда
					/////////////////// СМОТРИМ, ЕСЛИ ЛИ СТОЛБЦЫ С ТАКИМ ИМЕНЕМ ////////////////////
					ЕстьСтолбецРеквизитаТЧПоиска = Истина;
					нКолонка = СтруктураВозврата[СтрТЧ.Имя].Колонки.Найти(РеквизитТЧПоиска + "__1");
					Если нКолонка = Неопределено Тогда
    						ЕстьСтолбецРеквизитаТЧПоиска = Ложь;
					КонецЕсли;
					ИмяСтолбцаРеквизитаТЧ = "";
					Для Каждого ИмяРеквизитаТЧ ИЗ МассивИменРеквизитовТЧ Цикл
						нКолонка = СтруктураВозврата[СтрТЧ.Имя].Колонки.Найти(ИмяРеквизитаТЧ);
						Если НЕ нКолонка = Неопределено Тогда
							ИмяСтолбцаРеквизитаТЧ = ИмяРеквизитаТЧ;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					////////////////////////////////////////////////////////////////////////////////
					Если ЕстьСтолбецРеквизитаТЧПоиска И НЕ ПустаяСтрока(ИмяСтолбцаРеквизитаТЧ) Тогда
						Для Каждого СтрокаТЗ ИЗ СтруктураВозврата[СтрТЧ.Имя] Цикл
				              	СтруктураВывода = Новый Структура("День, Реквизит, НачЗнач, КонЗнач");
							СтруктураВывода.Вставить("Реквизит", СтрокаТЗ[ИмяСтолбцаРеквизитаТЧ]);
							СтруктураВывода.Вставить("НачЗнач", СтрокаТЗ[РеквизитТЧПоиска + "__1"]);
							СтруктураВывода.Вставить("КонЗнач", СтрокаТЗ[РеквизитТЧПоиска + "__2"]);
							СтруктураВывода.Вставить("День", Выборка.День);
							МассивРеквизитовТЧПоиска.Добавить(СтруктураВывода);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
		       КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивРеквизитовПоиска.Количество() > 0 Тогда
		Возврат МассивРеквизитовПоиска;
	ИначеЕсли МассивРеквизитовТЧПоиска.Количество() > 0 Тогда
		Возврат МассивРеквизитовТЧПоиска;
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//// Первая, ПерваяНенулевая, Последняя, ПоследняяНенулевая
Функция ПолучитьЗначениеЗаписиЖРпоНомеру(Объект, РеквизитПоиска = "", РеквизитТЧПоиска = "", НомерЗаписи = "Первая") Экспорт
	
	МассивИзменений = ПоискИзмененийРеквизитаВЖурналеРегистрации(Объект, РеквизитПоиска, РеквизитТЧПоиска, НомерЗаписи);
	
	Если МассивИзменений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// МОЖНО СДЕЛАТЬ РАСШИРЯЕМУЮ ФУНКЦИЮ (СДЕЛАН ТОЛЬКО ЧАСТНЫЙ СЛУЧАЙ)
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПреобразоватьВДату = Ложь;
	Если Найти(ВРЕГ(РеквизитПоиска), "ДАТА") > 0 ИЛИ Найти(ВРЕГ(РеквизитТЧПоиска), "ДАТА") > 0 Тогда
		ПреобразоватьВДату = Истина;
	КонецЕсли;
	
	Значение = Неопределено;
	Если НомерЗаписи = "Первая" Тогда
		Запись = МассивИзменений[0];
		Если ПреобразоватьВДату Тогда
			Попытка
				НачЗнач = Дата(Запись.НачЗнач);
			Исключение
				НачЗнач = Дата(1,1,1);
			КонецПопытки;
			Попытка
				КонЗнач = Дата(Запись.КонЗнач);
			Исключение
				КонЗнач = Дата(1,1,1);
			КонецПопытки;
		Иначе
			НачЗнач = ?(ЗначениеЗаполнено(Запись.НачЗнач) И ЭтоЧисло(Запись.НачЗнач), ПривестиСтрокуКЧислу(Запись.НачЗнач), Запись.НачЗнач);
			КонЗнач = ?(ЗначениеЗаполнено(Запись.КонЗнач) И ЭтоЧисло(Запись.КонЗнач), ПривестиСтрокуКЧислу(Запись.КонЗнач), Запись.КонЗнач);
		КонецЕсли;
		Значение = ?(ЗначениеЗаполнено(НачЗнач), НачЗнач, КонЗнач); 
	ИначеЕсли НомерЗаписи = "Последняя" Тогда
	    Запись = МассивИзменений[МассивИзменений.Количество() - 1];
		Если ПреобразоватьВДату Тогда
			Попытка
				НачЗнач = Дата(Запись.НачЗнач);
			Исключение
				НачЗнач = Дата(1,1,1);
			КонецПопытки;
			Попытка
				КонЗнач = Дата(Запись.КонЗнач);
			Исключение
				КонЗнач = Дата(1,1,1);
			КонецПопытки;
		Иначе
			НачЗнач = ?(ЗначениеЗаполнено(Запись.НачЗнач) И ЭтоЧисло(Запись.НачЗнач), ПривестиСтрокуКЧислу(Запись.НачЗнач), Запись.НачЗнач);
			КонЗнач = ?(ЗначениеЗаполнено(Запись.КонЗнач) И ЭтоЧисло(Запись.КонЗнач), ПривестиСтрокуКЧислу(Запись.КонЗнач), Запись.КонЗнач);
		КонецЕсли;
		Значение = ?(ЗначениеЗаполнено(КонЗнач), КонЗнач, НачЗнач);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

