
Функция СоздатьЗаписьДляОтправкиПочтовымСообщением(СтруктураДанных, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ ///////////////////////////////
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ ///////////////////////////////
	
	Запись = РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураДанных);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			Запись[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
		Запись.Период = ТекущаяДата();
	КонецЕсли;
	
	Попытка
		Запись.Записать();
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
