Перем ПространствоИмен_СТ;
Перем ПространствоИмен_ЕД;
Перем ПространствоИмен_ЕЕ Экспорт;
Перем ПространствоИмен_ТК;
Перем ПространствоИмен_ЕМ;

Перем Фабрика Экспорт;
Перем Сериализатор Экспорт;

Перем ЗаписьXML Экспорт;

Перем КэшГТД;
Перем ТекПодразделение;
Перем ПодразделениеЦО Экспорт;
Перем Ед_Штука;
Перем ИБ_SSP;

Перем ДанныеШтуки;
Перем ВалютаРубХДТО;

Перем НаковырянныеСсылки Экспорт;
Перем ПростыеРеквизиты;

Перем ВсегоОтправленоБайт;

Перем ТекПакет;

Перем КомпонентаОбмена Экспорт;

Перем Кэши;
Перем МассивВыборок;

Перем ВалютаНац;

Перем РеквизитыШапок;

Перем УзелПолучатель Экспорт;
Перем УзелОтправитель Экспорт;
Перем УзелОтправительКод Экспорт;

Перем ТекУзелПолучатель Экспорт;

Перем ПустаяСсылка_Спр_Контрагенты;
Перем ПустаяСсылка_Спр_Организации;

Перем НазначениеТипаХМЛ;

Перем СоответствиеТипов_Стар_Нов Экспорт;
Перем СоответствиеТипов_Нов_Стар Экспорт;

Перем СоответствиеТиповОбъектов_ЕД;
Перем СоответствиеЗначенийПеречислений;

Перем ОбработчикиЗагрузки;
Перем ПротоколЗагрузки;

Перем КэшМенеджеров;

Перем СВ_ОрганизацияКонтр;
Перем СВ_ПодразделениеРНК;
Перем СВ_СкладПолРНК;

Функция ЗаполнитьСоответствия()
	СоответствиеТипов_Стар_Нов	= Новый Соответствие();
	
	СоответствиеТипов_Стар_Нов.Вставить("Справочник.Договоры",		"Справочник.ДоговорыКонтрагентов");
	СоответствиеТипов_Стар_Нов.Вставить("Справочник.Номенклатура",	"Справочник.ХарактеристикиНоменклатуры");
	
	СоответствиеТипов_Стар_Нов.Вставить("Документ.Заказ",			"Документ.ЗаказПокупателя");
	СоответствиеТипов_Стар_Нов.Вставить("Документы.Инвентаризация",	"Документ.ИнвентаризацияТМЦ");	
	
	СоответствиеТипов_Нов_Стар=Новый Соответствие;
	Для Каждого Элемент Из СоответствиеТипов_Стар_Нов Цикл
		СоответствиеТипов_Нов_Стар.Вставить(Элемент.Значение,Элемент.Ключ);	
	КонецЦикла;
	
	СоответствиеТиповОбъектов_ЕД	= СоответствиеТиповОбъектов_ЕД();	
	
	СоответствиеЗначенийПеречислений= СоответствиеЗначенийПеречислений();
КонецФункции //ЗаполнитьСоответствиеТипов()

Функция СоответствиеТиповОбъектов_ЕД()
	С=Новый Соответствие;
	
	//ТипЕД			ТипТек
	
	С.Вставить("Документ.ВозвратТоваровОтПокупателя",	"Документ.ПриходнаяНакладная");
	С.Вставить("Документ.ЗаказПоставщику",				"Документ.ЗаказПоставщику");
	С.Вставить("Документ.ИнвентаризацияТоваров",		"Документ.ИнвентаризацияТМЦ");
	С.Вставить("Документ.ОстаткиСобственныхТМЦ",		"Документ.ВводОстатковТМЦ");					
	С.Вставить("Документ.ПеремещениеДС",				"Документ.ПеремещениеДенежныхСредств");
	С.Вставить("Документ.ПеремещениеТоваров",			"Документ.Перемещение");
	С.Вставить("Документ.ПоступлениеТоваровУслуг",		"Документ.ПриходнаяНакладная");
	С.Вставить("Документ.ОприходованиеТоваров",			"Документ.ОприходованиеТМЦ");
	С.Вставить("Документ.ОтчетОРозничныхПродажах",		"Документ.ОтчетКассовойСмены");	
	С.Вставить("Документ.РеализацияТоваровУслуг",		"Документ.РасходнаяНакладная");
	С.Вставить("Документ.РасходныйКассовыйОрдер",		"Документ.РасходныйКассовыйОрдер");
	С.Вставить("Документ.ПриходныйКассовыйОрдер",		"Документ.ПриходныйКассовыйОрдер");	
	С.Вставить("Документ.СписаниеЗапасов",				"Документ.СписаниеТМЦ");
	С.Вставить("Документ.УстановкаЦенНоменклатуры",		"Документ.ПрайсЛист");
	С.Вставить("Документ.ЧекККМ",						"Документ.Чек");	
	
	С.Вставить("Справочник.СтатьиРасходов",				"Справочник.СтатьиЗатрат");		
	                                                                      
	Возврат С;
КонецФункции // ()

Функция ЧислоБезДури(Число) Экспорт
	Возврат Формат(Число,"ЧГ=");
КонецФункции // ()
 

Функция Состояние_(Строка)
	#ЕСЛИ КЛИЕНТ ИЛИ ТолстыйКлиентОбычноеПриложение ТОГДА
		Состояние(Строка);
	#КОНЕЦЕСЛИ
КонецФункции

Процедура ОбработкаПрерыванияПользователя_()
	#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
	#КОНЕЦЕСЛИ
КонецПроцедуры

Функция Сообщить_(ТекстСообщения,Статус=Неопределено)
	#ЕСЛИ КЛИЕНТ ТОГДА
		Сообщить(ТекстСообщения,Статус);
	#КОНЕЦЕСЛИ
КонецФункции //Сообщить_(ТекстСообщения,Статус=Неопределено)

Функция Предупреждение_(ТекстСообщения,Таймаут=Неопределено,Заголовок=Неопределено)
	#ЕСЛИ КЛИЕНТ ТОГДА
		Предупреждение(ТекстСообщения,Таймаут,Заголовок);
	#КОНЕЦЕСЛИ
КонецФункции //Предупреждение_(ТекстСообщения,Таймаут=Неопределено,Заголовок=Неопределено)

Функция ЗначениеЗаполнено_(Значение)	
	//Чушебред, но 1С отказывается проверять мутабельные значения на заполненность
	Если НЕ (Значение=Неопределено ИЛИ Значение="" ИЛИ Значение=NULL) Тогда
		Результат = Истина;
	Иначе
		Результат = ЗначениеЗаполнено(Значение);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ()


#Область Регистрация

Функция ЭтоПростойТип(Значение)
	Результат	= Ложь;
	
	Если ТипЗнч(Значение)=Тип("Тип") Тогда
		ТекТип	= Значение;		
	Иначе
		ТекТип	= ТипЗнч(Значение);		
	КонецЕсли;	
	
	Если ТекТип=Тип("Число") 
		ИЛИ ТекТип=Тип("Строка")
		ИЛИ ТекТип=Тип("Дата")
		ИЛИ ТекТип=Тип("Булево") Тогда	
		
		Результат	= Истина;	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ЭтоПростойТип(Значение)

Функция ЭтоПростойРеквизит(МетаРеквизит)
	ПолноеИмя	= МетаРеквизит.ПолноеИмя();
	Результат	= ПростыеРеквизиты.Получить(ПолноеИмя);
	Если Результат=Неопределено Тогда	
		Если МетаРеквизит.Тип.Типы().Количество()=1 Тогда
			Результат=ЭтоПростойТип(МетаРеквизит.Тип.Типы()[0]);
		Иначе
			Результат=Ложь; //А фиг его знает что там на самом деле
		КонецЕсли;
		
		ПростыеРеквизиты.Вставить(ПолноеИмя,Результат);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЭтоПростойРеквизит()
 
Процедура РасковырятьСсылкиИзОбъекта(Объект) Экспорт	
	ОбработкаПрерыванияПользователя_();	
		
	Если ТипЗнч(НаковырянныеСсылки)<>Тип("Соответствие") Тогда
		НаковырянныеСсылки=Новый Соответствие;	
	КонецЕсли;
	Если ТипЗнч(ПростыеРеквизиты)<>Тип("Соответствие") Тогда
		ПростыеРеквизиты=Новый Соответствие;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда Возврат КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ЭтоПростойТип(ТипОбъекта) Тогда Возврат КонецЕсли;
	Если ТипОбъекта=Тип("ХранилищеЗначения") Тогда Возврат КонецЕсли;	
	
	Если НЕ ФР_ОбщегоНазначения_ПИ.ЭтоСсылочныйТип(ЗначениеВСтрокуВнутр(ТипОбъекта)) Тогда Возврат КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект) Тогда
		Если НаковырянныеСсылки.Получить(Объект)=Неопределено Тогда			
			НаковырянныеСсылки.Вставить(Объект,Истина);					
			Состояние_(НаковырянныеСсылки.Количество());
		Иначе
			Возврат;		
		КонецЕсли;		
	КонецЕсли;
	
	Если ТипОбъекта=Тип("СправочникСсылка.Акции")
		ИЛИ ТипОбъекта=Тип("СправочникСсылка.Подразделения")
		ИЛИ ТипОбъекта=Тип("СправочникСсылка.Пользователи") 
		ИЛИ ТипОбъекта=Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;	
	КонецЕсли; 
	
	МетаОбъект=Объект.Метаданные();
	Для Каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл
		Если ЭтоПростойРеквизит(МетаРеквизит) Тогда Продолжить КонецЕсли;
		
		ТекЗначение	= Объект[МетаРеквизит.Имя];
		РасковырятьСсылкиИзОбъекта(ТекЗначение);		
	КонецЦикла; 
	
	Для Каждого МетаТЧ Из МетаОбъект.ТабличныеЧасти Цикл	
		Для Каждого СтрокаТЧ Из Объект[МетаТЧ.Имя] Цикл
			Для Каждого РеквизитТЧ Из МетаТЧ.Реквизиты Цикл				
				Если ЭтоПростойРеквизит(РеквизитТЧ) Тогда Продолжить КонецЕсли;
				
				ТекЗначение	= СтрокаТЧ[РеквизитТЧ.Имя];				
				РасковырятьСсылкиИзОбъекта(ТекЗначение);				
			КонецЦикла;		
		КонецЦикла; 
	КонецЦикла;
	
	//Если Метаданные.Документы.Содержит(МетаОбъект) И МетаОбъект.Движения.Содержит(Метаданные.РегистрыБухгалтерии.Хозрасчетный) Тогда
	//	НЗ=РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	//	НЗ.Отбор.Регистратор.Установить(Объект,Истина);
	//	НЗ.Прочитать();
	//	Для Каждого Проводка Из НЗ Цикл
	//		РасковырятьСсылкиИзОбъекта(Проводка.ПодразделениеДт);					
	//		РасковырятьСсылкиИзОбъекта(Проводка.ПодразделениеКт);
	//		
	//		РасковырятьСсылкиИзОбъекта(Проводка.ВалютаДт);
	//		РасковырятьСсылкиИзОбъекта(Проводка.ВалютаКт);
	//		
	//		Для Сч=1 По Проводка.СчетДт.ВидыСубконто.Количество() Цикл
	//			РасковырятьСсылкиИзОбъекта(Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[Сч-1].ВидСубконто]);		
	//		КонецЦикла; 
	//		Для Сч=1 По Проводка.СчетКт.ВидыСубконто.Количество() Цикл
	//			РасковырятьСсылкиИзОбъекта(Проводка.СубконтоКт[Проводка.СчетКт.ВидыСубконто[Сч-1].ВидСубконто]);		
	//		КонецЦикла;			
	//	КонецЦикла;	
	//КонецЕсли; 
	
КонецПроцедуры

Функция ЗарегистрироватьВыборку(ТекстЗапроса,ИмяОбъекта,ВариантВыгрузки="",ДопПараметры=Неопределено) Экспорт
	Если ТипЗнч(ТекстЗапроса)=Тип("Строка") Тогда
		Запрос	= Новый Запрос(ТекстЗапроса);
	
		Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
		Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
		Запрос.УстановитьПараметр("ПодразделениеПолучатель",ПодразделениеПолучатель);	
	Иначе
		Запрос	= ТекстЗапроса;
	КонецЕсли;	
	
	Если ДопПараметры<>Неопределено Тогда
		Для Каждого Элемент Из ДопПараметры Цикл
			Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);		
		КонецЦикла;
	КонецЕсли;
	
	
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	
	//Сообщить_("К регистрации по типу "+ИмяОбъекта+" найдено: "+Выборка.Количество()+" объектов.");
	Пропущено=0;
	
	Пока Выборка.Следующий() Цикл
		ОбработкаПрерыванияПользователя_(); 	
		
		Результат	= РегистрыСведений.ФР_ОбъектыКВыгрузке.НужноРегистрироватьОбъект(Выборка.Ссылка);
		Если Результат.Нужно Тогда			
			СтрокаТО	= ТО.Добавить();
			
			СтрокаТО.ОбъектСсылка		= Результат.ВыгружаемаяСсылка;		
			СтрокаТО.ВариантВыгрузки	= Результат.ВариантВыгрузки;
			СтрокаТО.Получатель			= Результат.ПодразделениеПолучатель;			
			
			Если ИмяОбъекта="Документ.ПрайсЛист" Тогда
				НЗ			= РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
				НЗ.Отбор.Прайс.Установить(Выборка.Ссылка,Истина);
				НЗ.Отбор.ТипЦен.Установить(Выборка.ТипЦен,Истина);
				
				СтрокаТО	= ТО.Добавить();
				
				СтрокаТО.ОбъектСсылка		= Выборка.Ссылка;		
				СтрокаТО.ВариантВыгрузки	= "РегистрСведений.ЦеныНоменклатуры";
				СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
				СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);
			ИначеЕсли ИмяОбъекта="Документ.УстановкаСкидок" Тогда			
				НЗ			= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
				НЗ.Отбор.Документ.Установить(Выборка.Ссылка,Истина);
				НЗ.Отбор.ТипСкидок.Установить(Выборка.ТипСкидок,Истина);
				
				СтрокаТО	= ТО.Добавить();
				
				СтрокаТО.ОбъектСсылка		= Выборка.Ссылка;		
				СтрокаТО.ВариантВыгрузки	= "РегистрСведений.СкидкиНоменклатуры";
				СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
				СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);
			КонецЕсли; 
		Иначе
			Пропущено=Пропущено+1;
		КонецЕсли;
		
		Если ТО.Количество()>=1000 Тогда
			РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);
			ТО.Очистить();		
		КонецЕсли; 	
		
		Сч=Сч+1;
		Если Сч%100=0 Тогда
			Состояние_("Регистрация "+ИмяОбъекта+": "+(ВсегоСтрок-Сч));		
		КонецЕсли;		
	КонецЦикла; 
	
	Если ТО.Количество()>0 Тогда
		РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО,ДопПараметры);
	КонецЕсли; 
	
	СтрокаРезультата	= СтрШаблон("	зарегистрировано: %1, пропущено: %2",ТО.Количество(),Пропущено);
	
	//Сообщить_(СтрокаРезультата);
	
	Состояние_("");

	Возврат Новый  Структура("Зарегистрировано,Пропущено,СтрокаРезультата",ТО.Количество(),Пропущено,СтрокаРезультата);
КонецФункции

Процедура Зарегистрировать_ФранчСклады() Экспорт	
	ТекстЗапроса="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склад
	|ИЗ
	|	Документ.ОтчетКассовойСмены
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Склад.Подразделение.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|";	
	
	ЗарегистрироватьВыборку(ТекстЗапроса,"Справочники.Склады");
КонецПроцедуры //Зарегистрировать_ФранчСклады() Экспорт

Процедура Зарегистрировать_НоменклатураПоОстаткамФР() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура КАК Ссылка	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ
	|ГДЕ
	|	Период МЕЖДУ &Дата1 И &Дата2
	|	И Склад.Подразделение.ВидПодразделения=ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВерсияДанных<>""""
	|";	
	
	ЗарегистрироватьВыборку(ТекстЗапроса,"Справочник.Номенклатура","Справочник.ХарактеристикиНоменклатуры");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель КАК Ссылка	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ
	|ГДЕ
	|	Период МЕЖДУ &Дата1 И &Дата2
	|	И Склад.Подразделение.ВидПодразделения=ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВерсияДанных<>""""
	|";
	
	ЗарегистрироватьВыборку(ТекстЗапроса,"Справочник.Номенклатура","Элемент");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель.Родитель КАК Ссылка	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ
	|ГДЕ
	|	Период МЕЖДУ &Дата1 И &Дата2
	|	И Склад.Подразделение.ВидПодразделения=ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВерсияДанных<>""""
	|ИТОГИ ПО Ссылка ИЕРАРХИЯ";
	
	ЗарегистрироватьВыборку(ТекстЗапроса,"Справочник.Номенклатура","Группа");	
КонецПроцедуры

Процедура Регистрация_ВсеОбъекты_Тест(УзелПолучатель,УзелОтправитель=Неопределено)  Экспорт
	ИмяПланаОбмена	= Метаданные.НайтиПоТипу(ТипЗнч(УзелПолучатель)).Имя;	
	
	МенеджерПО					= ПланыОбмена[ИмяПланаОбмена];
	МенеджерРегистраРегистрации	= РегистрыСведений.ФР_ОбъектыКВыгрузке;
	
	Для Каждого ЭлементСостава Из Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав Цикл
		МетаОбъект = ЭлементСостава.Метаданные;
		Если Метаданные.Справочники.Содержит(МетаОбъект) Тогда
			ОбработкаПрерыванияПользователя_();
			
			Состояние_(МетаОбъект);
			
			Менеджер	= Справочники[МетаОбъект.Имя];
			Выборка		= Менеджер.Выбрать();
			НужноНаименование=(МетаОбъект.ДлинаНаименования>0);
			
			НуженЭлемент = Истина;
			ЕстьГруппы	 = ФР_ОбщегоНазначения_ПИ.ЭтоСправочникСГруппами(ЗначениеВСтрокуВнутр(ТипЗнч(Менеджер.ПустаяСсылка())));
			
			Если ЕстьГруппы Тогда
				Элемент		= ПолучитьСсылкуНаСправочник(МетаОбъект.Имя,Ложь,НужноНаименование); 				
				Группа		= ПолучитьСсылкуНаСправочник(МетаОбъект.Имя,Истина,НужноНаименование);
			Иначе
				Элемент		= ПолучитьСсылкуНаСправочник(МетаОбъект.Имя,Неопределено,НужноНаименование); 				
				Группа		= Неопределено;				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Элемент) Тогда
				МенеджерРегистраРегистрации.ЗарегистрироватьОбъект(Элемент);			
			КонецЕсли;
			Если ЗначениеЗаполнено(Группа) Тогда
				МенеджерРегистраРегистрации.ЗарегистрироватьОбъект(Элемент);			
			КонецЕсли;
			
			Сообщить_(Элемент);
			Если Группа<>Неопределено Тогда				
				Сообщить_(Группа);
			КонецЕсли; 
			
			//Пока Выборка.Следующий() Цикл
			//	ОбработкаПрерыванияПользователя_();
			//	Если НужноНаименование И НЕ ЗначениеЗаполнено(Выборка.Наименование) Тогда Продолжить КонецЕсли;
			//	
			//	
			//	Если НуженЭлемент И НЕ Выборка.ЭтоГруппа Тогда
			//		МенеджерРегистраРегистрации.ЗарегистрироватьОбъект(Выборка.Ссылка);
			//		
			//		НуженЭлемент	= Ложь;			
			//	КонецЕсли;
			//	Если НужнаГруппа И Выборка.ЭтоГруппа Тогда					
			//		МенеджерРегистраРегистрации.ЗарегистрироватьОбъект(Выборка.Ссылка);
			//		
			//		НужнаГруппа	= Ложь;
			//	КонецЕсли;
			//	Если НЕ (НужнаГруппа ИЛИ НуженЭлемент) Тогда
			//		Прервать;			
			//	КонецЕсли; 
			//КонецЦикла;		
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСсылкуНаСправочник(Вид,ЭтоГруппа,НужноНаименование)	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник."+Вид+" ГДЕ Не ПометкаУдаления";
	Если ЭтоГруппа<>Неопределено Тогда
		Запрос.Текст=Запрос.Текст+" И ЭтоГруппа=&ЭтоГруппа";
	КонецЕсли; 
	Если НужноНаименование Тогда
		Запрос.Текст=Запрос.Текст+" И НЕ Наименование=""""";	
	КонецЕсли; 
	Запрос.УстановитьПараметр("ЭтоГруппа",ЭтоГруппа);
	
	Результат	= Справочники[Вид].ПустаяСсылка();
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьСсылкуНаСправочник(Вид,ЭтоГруппа,НужноНаименование)
 

#КонецОбласти 


#Область ВспомогательныеФункции
	
Функция ПолучитьРеквизитыШапки_(ОбъектСсылка,Знач СписокРеквизитов,ИмяТаблицы=Неопределено) Экспорт
	Если ТипЗнч(СписокРеквизитов)=Тип("Строка") Тогда
		СписокЭлементов	=СтрРазделить(СписокРеквизитов,",");
		СписокРеквизитов=Новый Соответствие;
		Для Каждого Элемент Из СписокЭлементов Цикл
			СписокРеквизитов.Вставить(Элемент,СтрЗаменить(Элемент,".","_"));		
		КонецЦикла;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка";
	Для Каждого Элемент Из СписокРеквизитов Цикл
		Запрос.Текст=Запрос.Текст+",
		|	"+Элемент.Ключ+" "+?(ПустаяСтрока(Элемент.Значение),"","КАК "+Элемент.Значение);
	КонецЦикла;
	
	Если ИмяТаблицы=Неопределено Тогда
		ИмяТаблицы=ТипОбъекта(ОбъектСсылка)+"."+ОбъектСсылка.Метаданные().Имя;	
	КонецЕсли;
	
	Результат=Новый Структура;
	Для Каждого Элемент Из СписокРеквизитов Цикл
		Результат.Вставить(?(ПустаяСтрока(Элемент.Значение),Элемент.Ключ,Элемент.Значение),Неопределено);	
	КонецЦикла; 
	
	Если ПустаяСтрока(ИмяТаблицы) Тогда
		ИмяТаблицы	= ОбъектСсылка.Метадынные().ПолноеИмя();
		//Возврат Результат;	
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
	|ИЗ
	|	"+ИмяТаблицы+"
	|ГДЕ
	|	Ссылка=&ОбъектСсылка";
	Запрос.УстановитьПараметр("ОбъектСсылка",ОбъектСсылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьРеквизитыШапки(ОбъектСсылка,СписокРеквизитов) Экспорт

Функция НайтиОКСпоЧеку(ЧекСсылка)
	Результат= Документы.ОтчетКассовойСмены.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ОКС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары КАК ОКС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Документ.Чек КАК Чек
	|ПО 	
	|	НАЧАЛОПЕРИОДА(ОКС.Ссылка.Дата,День) = НАЧАЛОПЕРИОДА(Чек.Дата,День)
	|	И ОКС.Ссылка.Касса	= Чек.КассаККМ
	|	И ОКС.НомерЧекаККМ 	= Чек.НомерЧекаККМ
	|ГДЕ
	|	Чек.Ссылка = &ЧекСсылка	
	|";
	
	Запрос.УстановитьПараметр("ЧекСсылка",ЧекСсылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //НайтиОКСпоЧеку

Функция ПолучитьГТД(Номенклатура,Дата)
	Возврат Неопределено;
	
	Ключ=""+Номенклатура.УникальныйИдентификатор()+"_"+НачалоДня(Дата);
	ГТД=КэшГТД.Получить(Ключ);	
	Если ГТД=Неопределено Тогда
		ГТД=ПолучитьГрупповойПериодическийРеквизит(Номенклатура.Родитель,"НомерГТД",Дата);
		КэшГТД.Вставить(Ключ,ГТД);		
	КонецЕсли; 
	Возврат ГТД;
КонецФункции // ()

#КонецОбласти


#Область Выгрузка_Справочники

#Область СлужебныеФункции

Функция ПолучитьМенеджерКласса(Знач КлассПолноеИмя)	Экспорт
	Результат	= Неопределено;
	
	Части		= СтрРазделить(КлассПолноеИмя,".");
	КлассИмя	= Части[0];	
	
	Если КлассИмя="Справочник" ИЛИ КлассИмя="Справочники" Тогда
		Результат = Справочники;
	ИначеЕсли КлассИмя="Документ" ИЛИ КлассИмя="Документы" Тогда
		Результат = Документы;				
	ИначеЕсли КлассИмя="БизнесПроцесс" ИЛИ КлассИмя="БизнесПроцессы" Тогда
		Результат = БизнесПроцессы;
	ИначеЕсли КлассИмя="Задача" ИЛИ КлассИмя="Задачи" Тогда
		Результат = Задачи;
	ИначеЕсли КлассИмя="ПланВидовХарактеристик" ИЛИ КлассИмя="ПланыВидовХарактеристик" Тогда
		Результат = ПланыВидовХарактеристик;
	ИначеЕсли КлассИмя="РегистрСведений" ИЛИ КлассИмя="РегистрыСведений" Тогда
		Результат = РегистрыСведений;	
	КонецЕсли;
	
	Если Части.Количество()>1 И Результат<>Неопределено Тогда
		МетаОбъект	= Метаданные.НайтиПоПолномуИмени(КлассПолноеИмя);
		Если МетаОбъект<>Неопределено Тогда		
			Результат	= Результат[Части[1]];		
		Иначе
			Результат	= Неопределено;		
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьМенеджерКласса(КлассИмя)

Функция РазобратьВходнойПараметр(Выборка,ИмяТаблицы)
	Результат	= Новый Структура("Результат",Ложь);
	
	Части		= СтрРазделить(ИмяТаблицы,".");
	
	КлассИмя	= Части[0];
	Вид			= Части[1];
	
	МенеджерКласса	= ПолучитьМенеджерКласса(КлассИмя);
	
	Если МенеджерКласса=Неопределено Тогда
		Результат.Вставить("Ошибки","Невозможно определить менеджер класса для таблицы: "+ИмяТаблицы);
	Иначе
		Менеджер = МенеджерКласса[Вид];
		Если Выборка = Неопределено ИЛИ Выборка = Менеджер.ПустаяСсылка() Тогда
		Иначе
			ТипПараметра	= ТипЗнч(Выборка);
			НаВходеВыборка	= (ТипПараметра=Тип("ВыборкаИзРезультатаЗапроса"));
			
			Результат.Вставить("НаВходеВыборка",НаВходеВыборка);
			Результат.Вставить("Ссылка",		?(НаВходеВыборка,Выборка.Ссылка,Выборка));			
			Результат.Вставить("Выборка",		Выборка);
			Результат.Вставить("ИмяТаблицы",	ИмяТаблицы);
			Результат.Вставить("КлассИмя",		КлассИмя);
			
			Результат.Результат	= ЗначениеЗаполнено(Результат.Ссылка);			
		КонецЕсли; 				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы)

Функция ПолучитьРеквизитыДляВыгрузки(ВходПараметр,ВариантВыгрузки)
	Если ВходПараметр.НаВходеВыборка Тогда
		Возврат ВходПараметр.Выборка;
	Иначе
		Возврат ПолучитьРеквизитыШапки(ВходПараметр.Ссылка,РеквизитыШапок.Получить(ВходПараметр.ИмяТаблицы+"."+ВариантВыгрузки),ВходПараметр.КлассИмя);
	КонецЕсли;
КонецФункции //ПолучитьРеквизитыДляВыгрузки(ВходПараметр,ВариантВыгрузки)
 
Функция СКДвСтроку(СКД)
	Результат	= Неопределено;
	Если СКД<>Неопределено Тогда		
		времЗаписьXML=Новый ЗаписьXML();
		времЗаписьXML.УстановитьСтроку();
		
		СериализаторXDTO.ЗаписатьXML(времЗаписьXML,СКД,НазначениеТипаXML.Неявное);	
		
		Результат	= Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(времЗаписьXML.Закрыть()));
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //СКДвСтроку(СКД)

Функция СлепитьЗаполненныеПараметры(Разделитель,П1="",П2="",П3="",П4="",П5="",П6="",П7="",П8="",П9="",П10="")
	МП=Новый Массив;
	Для Сч=1 По 10 Цикл
		ЗначПараметра=Вычислить("П"+Сч);
		Если ЗначениеЗаполнено(ЗначПараметра) Тогда
			МП.Добавить(ЗначПараметра);		
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат	СтрСоединить(МП,Разделитель);	
КонецФункции // ()

Функция ВыгрузитьПвх_СвойстваОбъектов_Элемент(СпрВыборка)	
	ИмяТаблицы	= "ПланВидовХарактеристик.СвойстваОбъектов";
	ИмяУзлаХДТО	= "ПланВидовХарактеристик.СвойстваОбъектов.Элемент";	
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьПвх_СвойстваОбъектов_Элемент(СпрВыборка)

Функция ВыгрузитьПвх_СвойстваОбъектов_Элемент_КС(Наименование)	
	ИмяТаблицы="ПланВидовХарактеристик.СвойстваОбъектов";
	Ссылка	= ПолучитьИзКэша(Наименование,ИмяТаблицы);
	Если Ссылка	= Неопределено Тогда
		Ссылка	= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(Наименование);
		ВставитьВКэш(Наименование,Ссылка,ИмяТаблицы);
	КонецЕсли; 	
	
	Возврат Ссылка;
КонецФункции //ВыгрузитьПвх_СвойстваОбъектов_Элемент_КС(СпрВыборка)

Функция ВыгрузитьСпр_КС(Ссылка,Вид,Знач Свойства,Знач ИмяТипаХДТО="",ПространствоИмен="")
	ДанныеВида	= ФР_ОбщегоНазначения_КС.СтрокуВСтруктуру(Вид,"Вид,Хвост");	
	ИмяТаблицы	= "Справочник."+ДанныеВида.Вид;
	
	ВхПараметр	= РазобратьВходнойПараметр(Ссылка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
		
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,СлепитьЗаполненныеПараметры(".",ДанныеВида.Хвост,"КС"));	
	
	ОбъектХДТО 	= ПолучитьИзКэша(РеквизитыШ.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда		
		Если ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда 
			Если ПустаяСтрока(ИмяТипаХДТО) Тогда
				ИмяТипаХДТО	= "КлючевыеСвойства"+Вид; 			
			КонецЕсли; 
			ОбъектХДТО			= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен);
			
			ОбъектХДТО.Ссылка	= СериализаторXDTO.XMLСтрока(РеквизитыШ.Ссылка);			
			
			Если ТипЗнч(Свойства)=Тип("Строка") Тогда
				Свойства=Новый Структура(Свойства);	
			КонецЕсли;
			
			Для Каждого Элемент Из Свойства Цикл
				РеквизитИмя=Элемент.Ключ;
				
				Если ЗначениеЗаполнено(Элемент.Значение) Тогда
					ОбъектХДТО[РеквизитИмя] = Элемент.Значение;
				Иначе			
					ОбъектХДТО[РеквизитИмя] = РеквизитыШ[РеквизитИмя];		
				КонецЕсли; 	
			КонецЦикла;
		Иначе
			ОбъектХДТО=Ложь;
		КонецЕсли;
		
		ВставитьВКэш(Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;
	
	//Битая ссылка засунутая в кэш
	Если ОбъектХДТО = Ложь Тогда
		ОбъектХДТО = Неопределено;	
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_КС(Ссылка,Вид,Знач Свойства,Знач ИмяТипаХДТО="")

Функция ПолучитьОрганизациюКонтрагента(КонтрагентСсылка)
	Результат = Справочники.Организации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка	
	|ИЗ
	|	Справочник.Организации
	|ГДЕ
	|	ИНН В (ВЫБРАТЬ ИНН ИЗ Справочник.Контрагенты ГДЕ Ссылка = &КонтрагентСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления
	|";	 	
	
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьОрганизациюКонтрагента(КонтрагентСсылка)

Функция ПолучитьОрганизациюДоговора(ДоговорСсылка)
	Результат = Справочники.Организации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка	
	|ИЗ
	|	Справочник.Организации
	|ГДЕ
	|	ИНН В (ВЫБРАТЬ Владелец.ИНН ИЗ Справочник.Договоры ГДЕ Ссылка = &ДоговорСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления
	|";	 	
	
	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьОрганизациюДоговора(ДоговорСсылка)
 

#КонецОбласти

Функция ВыгрузитьСпр_Акции_Группа(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО(Справочники.Акции, СпрВыборка, Истина);	
КонецФункции //ВыгрузитьСпр_Акции_Группа(СпрВыборка)

Функция ВыгрузитьСпр_Акции_Элемент(СпрВыборка)
	ИмяТаблицы	= "Справочник.Акции";
	ИмяУзлаХДТО	= ИмяТаблицы+".Элемент";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ТекСсылка	= РеквизитыШ.Ссылка;
	
	ОбъектХДТО							= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);		
	
	ОбъектХДТО.Ссылка					= ТекСсылка;
	
	ОбъектХДТО.Код						= РеквизитыШ.Код;
	ОбъектХДТО.Наименование				= РеквизитыШ.Наименование;
	ОбъектХДТО.Описание					= РеквизитыШ.Описание;
	ОбъектХДТО.ДатаНачала				= РеквизитыШ.ДатаНачала;
	ОбъектХДТО.ДатаОкончания			= РеквизитыШ.ДатаОкончания;
	ОбъектХДТО.ВыдаватьСертификаты		= РеквизитыШ.ВыдаватьСертификаты;		
	ОбъектХДТО.МинимальнаяСуммаПокупки  = РеквизитыШ.МинимальнаяСуммаПокупки;
	ОбъектХДТО.Штрихкод					= РеквизитыШ.ШтрихКод;
	
	ТЧ_УчаствующиеПодразделенияXDTO		= СоздатьОбъектХДТО("Справочник.Акции.УчаствующиеПодразделения",ПространствоИмен_ЕЕ);		
	
	ВыборкаПоТЧ_Подразделения			= СпрВыборка.Подразделения.Выбрать();	
	Пока ВыборкаПоТЧ_Подразделения.Следующий() Цикл
		Если ВыборкаПоТЧ_Подразделения.Подразделение=ПодразделениеПолучатель Тогда
			СтрокаТЧ_ХДТО				= СоздатьОбъектХДТО("Справочник.Акции.УчаствующиеПодразделения.Строка",ПространствоИмен_ЕЕ);				
			СтрокаТЧ_ХДТО.Подразделение	= СериализаторXDTO.XMLСтрока(ВыборкаПоТЧ_Подразделения.Подразделение);			
			
			ТЧ_УчаствующиеПодразделенияXDTO.Строка.Добавить(СтрокаТЧ_ХДТО);			
		КонецЕсли;			
	КонецЦикла;		
	
	Если ТЧ_УчаствующиеПодразделенияXDTO.Строка.Количество()>0 Тогда
		ОбъектХДТО.УчаствующиеПодразделения=ТЧ_УчаствующиеПодразделенияXDTO;		
	КонецЕсли; 
	
	//НоменклатураКаскаднаяСкидка+НоменклатураДляСкидокНаБлочок
	ТЧ_ХДТО			= СоздатьОбъектХДТО("Справочник.Акции.Номенклатура",ПространствоИмен_ЕЕ);		
	ВыборкаПоТЧ		= НоменклатураИзАкции(ТекСсылка);		
	
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаПоТЧ.ВерсияДанных) Тогда
			СтрокаТЧ_ХДТО				= СоздатьОбъектХДТО("Справочник.Акции.Номенклатура.Строка",ПространствоИмен_ЕЕ);				
			СтрокаТЧ_ХДТО.Номенклатура	= XMLСтрока(ВыборкаПоТЧ.Ссылка);			
			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);			
		КонецЕсли;			
	КонецЦикла;
	
	Если ТЧ_ХДТО.Строка.Количество()>0 Тогда
		ОбъектХДТО.Номенклатура=ТЧ_ХДТО;
	КонецЕсли;
	
	ИмяТЧ			= "ЦеныПродажиБлочками";
	ТЧ_ХДТО			= СоздатьОбъектХДТО("Справочник.Акции."+ИмяТЧ,ПространствоИмен_ЕЕ);		
	ВыборкаПоТЧ		= ПолучитьВыборкуТЧ(СпрВыборка,ИмяТЧ);	
	Пока ВыборкаПоТЧ.Следующий() Цикл		
		СтрокаТЧ_ХДТО				= СоздатьОбъектХДТО(СтрШаблон("%1.%2.%3",ИмяТаблицы,ИмяТЧ,"Строка"),ПространствоИмен_ЕЕ);				
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ);		
			
		ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
	КонецЦикла;	
	Если ТЧ_ХДТО.Строка.Количество()>0 Тогда
		ОбъектХДТО[ИмяТЧ]=ТЧ_ХДТО;
	КонецЕсли;
	

	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Акции_Элемент(СпрВыборка)

Функция НоменклатураИзАкции(АкцияСсылка)
	ИмяТаблицы	= "Справочник.Номенклатура";
	РеквизитыШ	= РеквизитыШапок.Получить(ИмяТаблицы+".Элемент.КС");
	
	МР=Новый Массив;
	Для Каждого Реквизит Из СтрРазделить(РеквизитыШ,",") Цикл
		МР.Добавить("Номенклатура.Родитель."+Реквизит+" КАК "+Реквизит);	
	КонецЦикла; 
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"+СтрСоединить(МР,",")+"
	|ИЗ
	|	Справочник.Акции.НоменклатураДляСтильнойАрифметики
	|ГДЕ
	|	Ссылка=&АкцияСсылка
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"+СтрСоединить(МР,",")+"
	|ИЗ
	|	Справочник.Акции.НоменклатураДляСкидокНаБлочок
	|ГДЕ
	|	Ссылка=&АкцияСсылка
	|";
	
	Запрос.УстановитьПараметр("АкцияСсылка",АкцияСсылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
КонецФункции //НоменклатураИзАкции(АкцияСсылка)
 

Функция ВыгрузитьСпр_Валюты_КС(ВалютаСсылка)	
	ОбъектХДТО				= СоздатьОбъектХДТО("КлючевыеСвойстваВалюта");
	
	ОбъектХДТО.Ссылка		= ""+ВалютаСсылка.УникальныйИдентификатор();
	ОбъектХДТО.Код			= ?(ВалютаСсылка.Код="810","643",ВалютаСсылка.Код);
	ОбъектХДТО.Наименование	= ВалютаСсылка.Наименование;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьОрганизацию(КонтрагентСсылка,Фабрика)

Функция ВыгрузитьСпр_Валюты_Элемент(СпрВыборка)	
	ИмяТаблицы		= "Справочник.Валюты";
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	ОбъектХДТО	= ПолучитьИзКэша(Реквизиты.Ссылка);
	Если ОбъектХДТО	= Неопределено Тогда				
		ОбъектХДТО = СоздатьОбъектХДТО(ИмяТаблицы+".Элемент",ПространствоИмен_ЕЕ);		
		
		ЗаполнитьЗначенияСвойств(ОбъектХДТО,Реквизиты);		
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Валюты_Элемент(ХарактеристикаНоменклатуры)

Функция ВыгрузитьСпр_ФР_Бренды_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ФР_Бренды,СпрВыборка,"Справочник.Бренды");
КонецФункции // ()

Функция ВыгрузитьСпр_ФР_ВидыНоменклатуры_Группа(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Группа(Справочники.ФР_ВидыНоменклатуры,СпрВыборка,"Справочник.ВидыНоменклатуры");
КонецФункции // ()

Функция ВыгрузитьСпр_ФР_ВидыНоменклатуры_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ФР_ВидыНоменклатуры,СпрВыборка,"Справочник.ВидыНоменклатуры");
КонецФункции // ()
 
Функция ВыгрузитьСпр_ФР_Коллекции_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ФР_Коллекции,СпрВыборка,"Справочник.Коллекции");
КонецФункции // ()

Функция ВыгрузитьСпр_ВидыПодарочныхСертификатов_КС(ТекСсылка)
	ИмяТаблицы	= "Справочник.ВидыПодарочныхСертификатов";
	
	ОбъектХДТО	= ПолучитьИзКэша(ТекСсылка,ИмяТаблицы);
	
	Если ОбъектХДТО=Неопределено Тогда
		ОбъектХДТО					= СоздатьОбъектХДТО("КлючевыеСвойстваВидыПодарочныхСертификатов");
	
		ОбъектХДТО.Ссылка					= СериализаторXDTO.XMLСтрока(ТекСсылка);	
		ОбъектХДТО.Валюта					= ВалютаРубХДТО;		
		ОбъектХДТО.РазрешитьЧастичнуюОплату	= Истина;	
		
		ДобавитьЭлементХДТО(ОбъектХДТО,ТекСсылка.Код,"Код","string",ПространствоИмен_СТ);
		
		ВставитьВКэш(ТекСсылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ВидыПодарочныхСертификатов_КС(ТекСсылка)

Функция ВыгрузитьСпр_ВидыПодарочныхСертификатов_Элемент(ТекСсылка)
	Возврат Неопределено;
КонецФункции //ВыгрузитьСпр_ВидыПодарочныхСертификатов_КС(ТекСсылка)

Функция ВыгрузитьСпр_ВидыПараметровРазмеровНоменклатуры_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ВидыПараметровРазмеровНоменклатуры, СпрВыборка);
КонецФункции //ВыгрузитьСпр_ВидыПараметровРазмеровНоменклатуры_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ВидыПараметровЦветовНоменклатуры_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ВидыПараметровЦветовНоменклатуры, СпрВыборка);
КонецФункции //ВыгрузитьСпр_ВидыПараметровЦветовНоменклатуры_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ГТД_Элемент(СпрВыборка)
	Возврат Неопределено;
КонецФункции

Функция ВыгрузитьСпр_Декларация_Элемент(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Декларация";
	ИмяУзлаХДТО	= "Справочник.Декларация.Элемент";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,Реквизиты);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления","boolean",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Декларации_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Декларация_Группа(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Декларация";
	ИмяУзлаХДТО	= "Справочник.Декларация.Группа";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Группа");
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,Реквизиты);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления","boolean",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Декларация_Группа(СпрВыборка)

Функция ВыгрузитьСпр_ДисконтныеКарты_Элемент(СпрВыборка)	
	Возврат Неопределено;
КонецФункции //ВыгрузитьСпр_Декларация_Группа(СпрВыборка)

Функция ВыгрузитьСпр_Договоры_Элемент_КС(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)
	ИмяТаблицы	= "Справочник.Договоры";
	ИмяТипаХДТО	= "КлючевыеСвойстваДоговор";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ИмяТаблицыДляКэша	= ИмяТаблицы+"_"+МенятьКонтаргентаИОрганизацию;
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицыДляКэша);
	Если ОбъектХДТО=Неопределено Тогда
		Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
		
		ОрганизацияФР	= ПолучитьОрганизациюДоговора(ВхПараметр.Ссылка);
		Если МенятьКонтаргентаИОрганизацию Тогда
			Организация	= ?(ЗначениеЗаполнено(ОрганизацияФР), ОрганизацияФР, Реквизиты.Владелец);		
			Контрагент	= Реквизиты.Организация;
		Иначе			
			Организация = ?(ЗначениеЗаполнено(ОрганизацияФР), ОрганизацияФР, Реквизиты.Организация);		
			Контрагент	= Реквизиты.Владелец;		
		КонецЕсли; 
		
		ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО);
		
		ОбъектХДТО.Ссылка 		= XMLСтрока(ВхПараметр.Ссылка);		
		ОбъектХДТО.ВидДоговора	= "СПоставщиком";
		
		
		ОбъектХДТО.Организация	= ВыгрузитьСпр_Организации_КС(Организация);	
		ОбъектХДТО.Контрагент	= ВыгрузитьСпр_Контрагенты_Элемент_КС(Контрагент);	
		
		ОбъектХДТО.ВалютаВзаиморасчетов	= ВыгрузитьСпр_Валюты_КС(Реквизиты.ВалютаКредита);
		ОбъектХДТО.Наименование			= Реквизиты.Наименование;
		
		УстановитьСвойствоХДТО(ОбъектХДТО,	"Дата",	Реквизиты.Дата);
		УстановитьСвойствоХДТО(ОбъектХДТО,	"Номер",Реквизиты.Номер);		
		
		ДобавитьЭлементХДТО(ОбъектХДТО,	Реквизиты.Код,"Код", "string",ПространствоИмен_СТ);
		
		ВставитьВКэш(ВхПараметр.Ссылка,ОбъектХДТО,ИмяТаблицыДляКэша);
	КонецЕсли; 
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Договоры_Элемент_КС(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)

Функция ВыгрузитьСпр_Договоры_Элемент_КС_ЕЕ(РеквизитыШ,МенятьКонтаргентаИОрганизацию=Ложь)
	ИмяТаблицы	= "Справочник.Договоры.ЕЕ";
	ИмяТипаХДТО	= "КлючевыеСвойстваДоговор";
		
	ОбъектХДТО	= ПолучитьИзКэша(РеквизитыШ.Ссылка,ИмяТаблицы);
	Если ОбъектХДТО=Неопределено Тогда		
		ОбъектХДТО			= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
		
		ОбъектХДТО.Ссылка 	= XMLСтрока(РеквизитыШ.Ссылка);		
		
		ВставитьВКэш(РеквизитыШ.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли; 
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Договоры_Элемент_КС_ЕЕ(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)

Функция ВыгрузитьСпр_Договоры_Элемент_ЕД(РеквизитыШ, МенятьКонтаргентаИОрганизацию = Ложь)
	ИмяТаблицы	= "Справочник.Договоры";
	ИмяТипаХДТО	= "Справочник.Договоры";
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО);
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_Договоры_Элемент_КС(РеквизитыШ,МенятьКонтаргентаИОрганизацию);	
	
	Агентский = (РеквизитыШ.ВидДоговора_Новый_Код = "000001022");
	ДобавитьЭлементХДТО(ОбъектХДТО,	Агентский, "Агентский", "boolean",ПространствоИмен_СТ);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Договоры_Элемент_ЕД(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)

Функция ВыгрузитьСпр_Договоры_Элемент_ЕЕ(РеквизитыШ,МенятьКонтаргентаИОрганизацию=Ложь)
	ИмяТаблицы	= "Справочник.Договоры";
	ИмяТипаХДТО	= "Справочник.ДоговорыЕЕ.Элемент";	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);
	
	ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО,РеквизитыШ,"Владелец");
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Договоры_Элемент_ЕД(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)

Функция ВыгрузитьСпр_Должности_Элемент(СпрВыборка)
	Возврат Неопределено;
КонецФункции

Функция ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО,Реквизиты,Знач ИменаРеквизитов)
	ИменаРеквизитов	= СтрРазделить(ИменаРеквизитов,",");
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		ЗначениекРекв	= Реквизиты[ИмяРеквизита];
		Если ЗначениеЗаполнено(ЗначениекРекв) Тогда			
			ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(ЗначениекРекв)));
			ОбъектХДТО[ИмяРеквизита+"Тип"]	= ОТ.ПолноеИмя;
		КонецЕсли;			
	КонецЦикла;
КонецФункции //ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО,Реквизиты,Знач ИменаРеквизитов)

Функция ВыгрузитьСпр_Договоры_Элемент(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)
	ИмяТаблицы	= "Справочник.Договоры";
	ИмяТипаХДТО	= "Справочник.Договоры";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	Если ТипЗнч(РеквизитыШ.Владелец)=Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектХДТО	= ВыгрузитьСпр_Договоры_Элемент_ЕД(РеквизитыШ,Истина);		
	Иначе
		ОбъектХДТО	= ВыгрузитьСпр_Договоры_Элемент_ЕЕ(РеквизитыШ,МенятьКонтаргентаИОрганизацию);	
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Договоры_Элемент(СпрВыборка,МенятьКонтаргентаИОрганизацию=Ложь)

Функция ВыгрузитьСпр_ДопПараметрРазмера_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ДопПараметрРазмера, СпрВыборка);
КонецФункции //ВыгрузитьСпр_ДопПараметрРазмера_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ДопПараметрЦвета_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ДопПараметрЦвета, СпрВыборка);
КонецФункции //ВыгрузитьСпр_ВидыПараметровЦветовНоменклатуры_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Единицы_Элемент_КС(СпрВыборка)	
	ИмяТаблицы		= "Справочник.Единицы";
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса") ИЛИ ТипЗнч(СпрВыборка)=Тип("Структура"));	
	Если НЕ НаВходеВыборка Тогда
		Если СпрВыборка=Неопределено ИЛИ СпрВыборка=NULL ИЛИ СпрВыборка=Справочники.ОКЕИ.ПустаяСсылка() Тогда			
			Возврат ВыгрузитьСпр_Единицы_Элемент_КС(Ед_Штука);
		КонецЕсли;			
	КонецЕсли;
	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);	
	ОбъектХДТО		= ПолучитьИзКэша(ТекСсылка,ИмяТаблицы);
	
	Если ОбъектХДТО=Неопределено Тогда
		Если НаВходеВыборка Тогда
			Реквизиты	= СпрВыборка;
		Иначе
			Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Код,Наименование");		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Реквизиты.Ссылка) Тогда
			ОбъектХДТО					= СоздатьОбъектХДТО("КлючевыеСвойстваЕдиницаИзмерения");
		
			ОбъектХДТО.Ссылка			= XMLСтрока(Реквизиты.Ссылка);	
			ОбъектХДТО.Код				= Реквизиты.Код;	
			ОбъектХДТО.Наименование		= Реквизиты.Наименование;		
		Иначе
			ОбъектХДТО					= ВыгрузитьСпр_Единицы_Элемент_КС(Ед_Штука);
		КонецЕсли;		
		
		ВставитьВКэш(ТекСсылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Единицы_Элемент(Номенклатура,Фабрика)

Функция ВыгрузитьСпр_Единицы_Элемент(СпрВыборка)	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	Если НЕ ЗначениеЗаполнено(ТекСсылка) Тогда
		ВыгрузитьСпр_Единицы_Элемент(Ед_Штука);			
	КонецЕсли; 
	
	Если НаВходеВыборка Тогда
		Реквизиты	= СпрВыборка;
	Иначе
		Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Код,Наименование,НаименованиеПолное");		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Реквизиты.Ссылка) Тогда
		ОбъектХДТО					= СоздатьОбъектХДТО("Справочник.ЕдиницыИзмерения");
		
		ОбъектХДТО.КлючевыеСвойства		= ВыгрузитьСпр_Единицы_Элемент_КС(Реквизиты);	
		ОбъектХДТО.НаименованиеПолное	= Реквизиты.НаименованиеПолное;		
	Иначе
		ОбъектХДТО						= ВыгрузитьСпр_Единицы_Элемент_КС(Ед_Штука);						
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Единицы_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ЛинииНоменклатуры_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ЛинииНоменклатуры, СпрВыборка, "Справочник.ЛинииНоменклатуры");
КонецФункции //ВыгрузитьСпр_ЛинииНоменклатуры_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Контрагенты_Элемент(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Контрагенты";
	
	Если СпрВыборка=Неопределено 
		ИЛИ СпрВыборка=ПустаяСсылка_Спр_Контрагенты
		ИЛИ СпрВыборка=ПустаяСсылка_Спр_Организации Тогда		
		Возврат Неопределено;	
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	ОбъектХДТО		= Неопределено;	
	
	Вид				= ТекСсылка.Метаданные().Имя;
	
	СписокРеквизитов= Новый Структура("ВерсияДанных,Код,Ссылка,ЭтоГруппа,ПометкаУдаления,ИНН,КПП");		
	СписокРеквизитов.Вставить(?(Вид="Контрагенты","ПолноеНаименование","НаименованиеПолное"),"НаименованиеПолное");		
	
	РеквизитыШапки	= ПолучитьРеквизитыШапки(ТекСсылка,СписокРеквизитов);	
	
	Если РеквизитыШапки.ВерсияДанных<>"" И НЕ РеквизитыШапки.ЭтоГруппа Тогда		
		Объект_ХДТО					= СоздатьОбъектХДТО("Справочник.Контрагенты");		
		Объект_ХДТО.КлючевыеСвойства= ВыгрузитьСпр_Контрагенты_Элемент_КС(СпрВыборка);    		
		
		
		ДобавитьЭлементХДТО(Объект_ХДТО,РеквизитыШапки.Код,				"Код",				"string",	ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(Объект_ХДТО,РеквизитыШапки.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	КонецЕсли;	
	
	Возврат Объект_ХДТО;
КонецФункции //ВыгрузитьСпр_Контрагенты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Контрагенты_Группа(СпрВыборка)	
	ИмяТаблицы		= "Справочник.Контрагенты";
	ИмяТипаХДТО     = "Справочник.КонтрагентыГруппа";
	
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяТипаХДТО);		
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_Контрагенты_Группа_КС(СпрВыборка);
		
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.Код,				"Код",				"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Контрагенты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Контрагенты_Элемент_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Контрагенты";
	
	Если СпрВыборка=Неопределено 
		ИЛИ СпрВыборка=ПустаяСсылка_Спр_Контрагенты
		ИЛИ СпрВыборка=ПустаяСсылка_Спр_Организации Тогда		
		Возврат Неопределено;	
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	КС_ХДТО	= ПолучитьИзКэша(ТекСсылка,ИмяТаблицы);
	Если КС_ХДТО = Неопределено Тогда
		Вид	= ТекСсылка.Метаданные().Имя;
		
		Если НаВходеВыборка Тогда
			РеквизитыШапки	= СпрВыборка;
		Иначе
			СписокРеквизитов	= Новый Структура("ВерсияДанных,Ссылка,Код,Наименование,ИНН,КПП");		
			СписокРеквизитов.Вставить(?(Вид="Контрагенты","ПолноеНаименование","НаименованиеПолное"),"НаименованиеПолное");		
		
			РеквизитыШапки	= ПолучитьРеквизитыШапки(ТекСсылка,СписокРеквизитов);				
		КонецЕсли;		
		
		Если РеквизитыШапки.ВерсияДанных<>"" Тогда
			КС_ХДТО	= СоздатьОбъектХДТО("КлючевыеСвойстваКонтрагент");
			
			КС_ХДТО.Ссылка				= XMLСтрока(РеквизитыШапки.Ссылка);
			КС_ХДТО.Наименование		= РеквизитыШапки.Наименование;					
			КС_ХДТО.НаименованиеПолное	= РеквизитыШапки.НаименованиеПолное;		
			Если СтрДлина(СокрЛП(РеквизитыШапки.ИНН))>=10 Тогда
				КС_ХДТО.ИНН				= СокрЛП(РеквизитыШапки.ИНН);
			КонецЕсли;		
			Если СтрДлина(СокрЛП(РеквизитыШапки.КПП))=9 Тогда
				КС_ХДТО.КПП				= СокрЛП(РеквизитыШапки.КПП);
			КонецЕсли;	
			//+ HELP-1058 20241002 Михайловский
			Попытка
			//+ HELP-1058 20241002 Михайловский
				Если СтрНайти(ВРег(РеквизитыШапки.НаименованиеПолное),"ЧАСТНОЕ ЛИЦО")<>0  Тогда
					КС_ХДТО.ЮридическоеФизическоеЛицо 	= "ФизическоеЛицо";
				Иначе		
					КС_ХДТО.ЮридическоеФизическоеЛицо 	= "ЮридическоеЛицо";			
				КонецЕсли;
			//+ HELP-1058 20241002 Михайловский	
			Исключение
			КонецПопытки;
			//- HELP-1058 20241002 Михайловский
		КонецЕсли;
		
		ВставитьВКэш(ТекСсылка,КС_ХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат КС_ХДТО;
КонецФункции //ВыгрузитьСпр_Контрагенты_Элемент_КС(СпрСсылка)

Функция ВыгрузитьСпр_Контрагенты_Группа_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Контрагенты";
	ИмяТипаХДТО	= "КлючевыеСвойстваКонтрагентГруппа";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Группа");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= ПолучитьИзКэша(Реквизиты.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО=Неопределено Тогда	
		ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕД);
	
		ОбъектХДТО.Ссылка		= XMLСтрока(Реквизиты.Ссылка);
		ОбъектХДТО.Наименование = XMLСтрока(Реквизиты.Наименование);		
		
		Если ЗначениеЗаполнено(Реквизиты.Родитель) Тогда
			ОбъектХДТО.Группа	= ВыгрузитьСпр_Контрагенты_Группа_КС(Реквизиты.Родитель);
		КонецЕсли; 
		
		ВставитьВКэш(Реквизиты.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Контрагенты_Группа_КС(СпрСсылка)

Функция ВыгрузитьСпр_Контрагенты_Документ_ЦеныПоставщика(СпрВыборка)	
	ИмяТаблицы		= "Справочник.Контрагенты";	
	
	ИмяТипаХДТО		= "Документ.ЦеныПоставщика";
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Документ.ЦеныПоставщика");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,СпрВыборка);
	ОбъектХДТО.Дата	= НачалоДня(ТекущаяДата());
	
	ОбъектХДТО.Подразделение	= ПодразделениеКонтрагента(РеквизитыШ.Ссылка);
	
	ИмяТЧ	= "Скидки";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);
	
	ОбъектХДТО.Цены	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(СпрВыборка,ИмяТЧ),ИмяТипаХДТО+".Цены");
	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Контрагенты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Контрагенты_РегистрСведений_СкидкиКонтрагентов_Документ_ЦеныПоставщика(СпрВыборка)
	
	//////////////////// ВХОД ////////////////////////////////////////////////////////////////
	
	ВхПараметр = РазобратьВходнойПараметр(СпрВыборка, "Справочник.Контрагенты");
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ = ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Документ.ЦеныПоставщика");
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	НаВходеВыборка = (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));         
	ТекСсылка      = ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	/////////////////// ВЫХОД ////////////////////////////////////////////////////////////////
	ИмяТипаХДТО                 = "Документ.ЦеныПоставщика";
	
	ОбъектХДТО    = СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,СпрВыборка);
	ОбъектХДТО.Дата         = НачалоДня(ТекущаяДата());
	
	ОбъектХДТО.Подразделение = ПодразделениеКонтрагента(РеквизитыШ.Ссылка);
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);
	
	////////////// ВЫГРУЗИМ РС СкидкиКонтрагентов ////////////////////////////////////////////
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведущий", ТекСсылка.Ведущий);
	Запрос.Текст =
	"ВЫБРАТЬ
	|             СкидкиКонтрагентов.Контрагент КАК Контрагент,
	|             СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
	|             СкидкиКонтрагентов.Номенклатура КАК Номенклатура,
	|             СкидкиКонтрагентов.Скидка КАК Скидка,
	|             СкидкиКонтрагентов.Наценка КАК Наценка,
	|             СкидкиКонтрагентов.ТипТовара КАК ТипТовара,
	|             СкидкиКонтрагентов.Брэнд КАК Брэнд,
	|             СкидкиКонтрагентов.Модель КАК Модель,
	|             СкидкиКонтрагентов.Статус КАК Статус,
	|             СкидкиКонтрагентов.ПричинаИзменийУсловийРаботы КАК ПричинаИзменийУсловийРаботы
	|ИЗ
	|             РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|             СкидкиКонтрагентов.Контрагент = &Ведущий";
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаРС = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбъектХДТО.Цены       = ВыгрузитьТЧвХДТО(ВыборкаРС, ИмяТипаХДТО+".Цены");
	
	Возврат ОбъектХДТО;
	
КонецФункции

Функция Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(Валюта,Договор=Неопределено,МенятьКонтаргентаИОрганизацию=Ложь)
	СвойстваXDTO	= СоздатьОбъектХДТО("ОбщиеСвойстваДанныеВзаиморасчетов");
	
	Если Договор<>Неопределено Тогда
		СвойстваXDTO.Договор	= ВыгрузитьСпр_Договоры_Элемент_КС(Договор,МенятьКонтаргентаИОрганизацию);			
	КонецЕсли; 
	
	СвойстваXDTO.ВалютаВзаиморасчетов				= ВыгрузитьСпр_Валюты_КС(Валюта);
	СвойстваXDTO.КурсВзаиморасчетов					= 1;
	СвойстваXDTO.КратностьВзаиморасчетов			= 1;	
	СвойстваXDTO.РасчетыВУсловныхЕдиницах			= СериализаторXDTO.XMLСтрока(Ложь);
	СвойстваXDTO.СчетУчетаРасчетовСКонтрагентом		= "62.01";
	СвойстваXDTO.СчетУчетаРасчетовПоАвансам			= "62.02";	
	
	Возврат СвойстваXDTO;
КонецФункции //Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(Валюта,Фабрика) 
 
Функция Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(Номенклатура,Характеристика=Неопределено)	
	Если Номенклатура=NULL Тогда Возврат Неопределено КонецЕсли;
	
	СвойстваXDTO					= СоздатьОбъектХДТО("ОбщиеСвойстваДанныеНоменклатуры");
	
	СвойстваXDTO.Номенклатура		= ВыгрузитьСпр_Номенклатура_Элемент_КС(Номенклатура);
	СвойстваXDTO.Характеристика		= ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_КС(Характеристика);	
	
	Возврат СвойстваXDTO;
КонецФункции //Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(Номенклатура,Фабрика)

Функция Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД)
	СвойстваXDTO						= СоздатьОбъектХДТО("ОбщиеСвойстваДанныеНомераГТД");
	СвойстваXDTO.НомерГТД   			= СокрЛП(Лев(""+ГТД,30));
	СвойстваXDTO.СтранаПроисхождения    = ВыгрузитьСпр_СтраныМира_КС(ГТД.СтранаПроисхождения);
	
	Возврат СвойстваXDTO;
КонецФункции //Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД,СтранаПроисхождения)

Функция ВыгрузитьСпр_Кассы_Элемент_КС(Ссылка)	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат Неопределено КонецЕсли;
	ИмяТаблицы	= "Справочник.Кассы";
	
	ОбъектХДТО	= ПолучитьИзКэша(Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО	= Неопределено Тогда
		ОбъектХДТО				= СоздатьОбъектХДТО("КлючевыеСвойстваКассыККМ");
		ОбъектХДТО.Ссылка		= СериализаторXDTO.XMLСтрока(Ссылка);	
		ОбъектХДТО.Наименование	= СериализаторXDTO.XMLСтрока(Ссылка.Наименование);
		ОбъектХДТО.Организация	= ВыгрузитьСпр_Организации_КС(Ссылка.Организация);			
		
		ВставитьВКэш(Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Кассы_Элемент_КС(Ссылка)

Функция ВыгрузитьСпр_Кассы_Элемент(СпрВыборка)	
	Возврат ВыгрузитьСпр_СТАНДАРТНО(Справочники.Кассы,СпрВыборка,"Ложь");
КонецФункции //ВыгрузитьСпр_Кассы_Элемент(Ссылка)

Функция ВыгрузитьСпр_Кассы_Элемент_ЕД(СпрВыборка)	
	ИмяТаблицы		= "Справочник.Кассы";
	ИмяОбъектаХДТО  = "Справочник.КассыККМ";
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяОбъектаХДТО,ПространствоИмен_ЕД);
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_Кассы_Элемент_КС(Реквизиты.Ссылка);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,	Реквизиты.Код,					"Код", 				"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,	Реквизиты.ПодключенФР,			"ПодключенФР", 		"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,	Реквизиты.ПодключенТерминал,	"ПодключенТерминал","boolean",	ПространствоИмен_СТ);	
	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"РозничныйСклад",	ВыгрузитьСпр_Склады_Элемент_КС(Реквизиты.РозничныйСклад));
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"Владелец",		ВыгрузитьСпр_Подразделения_Элемент_КС(Реквизиты.Владелец));
	
	ДобавитьЭлементХДТО(ОбъектХДТО,	Реквизиты.ПометкаУдаления,		"ПометкаУдаления","boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Кассы_Элемент(Ссылка)

Функция ВыгрузитьСпр_МатериалыСостав_Элемент(СпрВыборка)	
	ИмяТаблицы	= "Справочник.МатериалыСостав";
	ИмяУзлаХДТО	= "Справочник.МатериалыСостава.Элемент";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты								= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	ОбъектХДТО								= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);
		
	ОбъектХДТО.КлючевыеСвойства				= ВыгрузитьСпр_МатериалыСостав_КС(ВхПараметр.Ссылка);
		
	УстановитьСвойствоХДТО(ОбъектХДТО,"НаименованиеПолное",		Реквизиты.НаименованиеПолное);
	УстановитьСвойствоХДТО(ОбъектХДТО,"Наименование_Английский",Реквизиты.Наименование_Английский);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления","boolean",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ВидыКонтактнойИнформации_Элемент(СпрСсылка)

Функция ВыгрузитьСпр_МатериалыСостав_Группа(СпрВыборка)	
	ИмяТаблицы	= "Справочник.МатериалыСостав";
	ИмяУзлаХДТО	= "Справочник.МатериалыСостава.Группа";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты								= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	ОбъектХДТО								= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);
		
	ОбъектХДТО.КлючевыеСвойства				= ВыгрузитьСпр_МатериалыСостав_КС(ВхПараметр.Ссылка);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления","boolean",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ВидыКонтактнойИнформации_Группа(СпрСсылка)

Функция ВыгрузитьСпр_МатериалыСостав_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочник.МатериалыСостав";
	ИмяУзлаХДТО	= "Справочник.МатериалыСостава.КС";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда	Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);
	Если ОбъектХДТО	= Неопределено И ВхПараметр.Результат Тогда
		Реквизиты					= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент.КС");
		ОбъектХДТО					= СоздатьОбъектХДТО(ИмяУзлаХДТО,ПространствоИмен_ЕЕ);
		
		ОбъектХДТО.Ссылка			= XMLСтрока(ВхПараметр.Ссылка);
		ОбъектХДТО.Код				= Реквизиты.Код;
		ОбъектХДТО.Наименование		= Реквизиты.Наименование;
		
		УстановитьСвойствоХДТО(ОбъектХДТО,"Группа",ВыгрузитьСпр_МатериалыСостав_КС(Реквизиты.Родитель));		
		
		ВставитьВКэш(ВхПараметр.Ссылка,ОбъектХДТО);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_МатериалыСостав_Элемент_КС(СпрСсылка)

Функция ВыгрузитьСпр_Номенклатура_Элемент_КС(СпрВыборка,КраткийФормат=Истина)	
	ОбъектХДТО	= Неопределено;
	Если СпрВыборка	= Неопределено ИЛИ СпрВыборка	= Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат ОбъектХДТО;
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	ОбъектХДТО	= ПолучитьИзКэша(ТекСсылка);		
	Если ОбъектХДТО	= Неопределено Тогда		
		Если НаВходеВыборка Тогда
			Реквизиты	= СпрВыборка;
		Иначе
			Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Родитель,Код,Наименование,КодПроизводителя");		
		КонецЕсли;		
		
		ОбъектХДТО					= СоздатьОбъектХДТО("КлючевыеСвойстваНоменклатура");		
		
		ОбъектХДТО.Ссылка			= XMLСтрока(ТекСсылка);	
		
		Если НЕ КраткийФормат Тогда
			ОбъектХДТО.НаименованиеПолное	= Реквизиты.Наименование;
			ОбъектХДТО.КодВПрограмме		= Реквизиты.Код;	
			ОбъектХДТО.Артикул				= Реквизиты.КодПроизводителя;	
		КонецЕсли;
		
		ОбъектХДТО.Наименование		= Реквизиты.Наименование;
		
		Если НЕ КраткийФормат Тогда			
			УстановитьСвойствоХДТО(ОбъектХДТО,"Группа",ВыгрузитьСпр_Номенклатура_Группа_КС(Реквизиты.Родитель));
		КонецЕсли;
		
		ВставитьВКэш(ТекСсылка,ОбъектХДТО);
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(Номенклатура,Фабрика)

Функция ВыгрузитьСпр_Номенклатура_Элемент_ЕД(СпрВыборка)
	ОбъектХДТО	= Неопределено;
	Если СпрВыборка	= Неопределено ИЛИ СпрВыборка	= Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат ОбъектХДТО;
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	Если НаВходеВыборка Тогда
		Реквизиты	= СпрВыборка;
	Иначе
		Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Родитель,Код,СтавкаНДС,Наименование,ОписаниеТовараДляСайта");		
	КонецЕсли;		
	
	ОбъектХДТО					= СоздатьОбъектХДТО("Справочник.Номенклатура");
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_Номенклатура_Элемент_КС(СпрВыборка,Ложь);
	ОбъектХДТО.ТипНоменклатуры	= "Товар";
	ОбъектХДТО.Описание 		= Реквизиты.ОписаниеТовараДляСайта;	
	ОбъектХДТО.ЕдиницаИзмерения	= ВыгрузитьСпр_Единицы_Элемент_КС(Ед_Штука);
	
	Если ЗначениеЗаполнено(Реквизиты.СтавкаНДС) Тогда
		ОбъектХДТО.СтавкаНДС	= ВыгрузитьПер_СтавкаНДС(Реквизиты.СтавкаНДС);	
	КонецЕсли;	
	
	ДобавитьСвойствоХДТО(ОбъектХДТО,ВыгрузитьСпр_Номенклатура_Элемент_СоставНоменклатуры(ТекСсылка),"Состав",ПространствоИмен_ЕЕ);		
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.РусскоеНаименование,			"НаименованиеДляЭтикетки",	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ТипТовара,						"ТипТовара",				"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.ВидНоменклатуры),	"ВидНоменклатурыЕЕ",		"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.СнятСПроизводства,				"СнятСПроизводства",		"boolean",	ПространствоИмен_СТ);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,				"ПометкаУдаления",			"boolean", 	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_Номенклатура_Элемент_Объект(СпрВыборка)

Функция ВыгрузитьСпр_Номенклатура_Элемент(СпрВыборка)
	ИмяТаблицы	= Метаданные.Справочники.Номенклатура.ПолноеИмя();
	ОбъектХДТО	= Неопределено;
	Если СпрВыборка	= Неопределено ИЛИ СпрВыборка	= Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат ОбъектХДТО;
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	Если НаВходеВыборка Тогда
		Реквизиты	= СпрВыборка;
	Иначе
		Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Родитель,Код,СтавкаНДС,Наименование,ОписаниеТовараДляСайта");		
	КонецЕсли;		
	
	ОбъектХДТО					= СоздатьОбъектХДТО("Справочник.Номенклатура.Элемент",ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,СпрВыборка,,"СоставНоменклатуры,ВидНоменклатуры");
	
	ОбъектХДТО.НаименованиеДляЭтикетки	= Реквизиты.РусскоеНаименование;
	ОбъектХДТО.Артикул					= Реквизиты.КодПроизводителя;
	ОбъектХДТО.ВидНоменклатуры			= Реквизиты.ФР_ВидНоменклатуры;
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ТипТовара,						"ТипТовара",				"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.ВидНоменклатуры),	"ВидНоменклатурыЕЕ",		"string",	ПространствоИмен_СТ);	
	
	
	ИмяТЧ			= "СоставНоменклатуры";
	ТЧ_ХДТО			= СоздатьОбъектХДТО(ИмяТаблицы+"."+ИмяТЧ,ПространствоИмен_ЕЕ);		
	ВыборкаПоТЧ		= ПолучитьВыборкуТЧ(СпрВыборка,ИмяТЧ);		
	
	Пока ВыборкаПоТЧ.Следующий() Цикл		
		СтрокаТЧ_ХДТО				= СоздатьОбъектХДТО(СтрШаблон("%1.%2.%3",ИмяТаблицы,ИмяТЧ,"Строка"),ПространствоИмен_ЕЕ);				
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ);		
			
		ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
	КонецЦикла;		
	
	Если ТЧ_ХДТО.Строка.Количество()>0 Тогда
		ОбъектХДТО[ИмяТЧ]=ТЧ_ХДТО;
	КонецЕсли;

	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_Номенклатура_Элемент_Объект(СпрВыборка)

Функция ВыгрузитьСпр_Номенклатура_Группа_КС(СпрВыборка)
	ИмяТаблиы	= "Справочник.Номенклатура";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблиы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	КС_XDTO	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблиы);
	
	Если КС_XDTO=Неопределено Тогда	
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Группа.КС");
	
		Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
		КС_XDTO					= СоздатьОбъектХДТО("КлючевыеСвойстваНоменклатураГруппа");
	
		КС_XDTO.Ссылка			= XMLСтрока(РеквизитыШ.Ссылка);	
		КС_XDTO.Наименование	= РеквизитыШ.Наименование;
		КС_XDTO.КодВПрограмме	= РеквизитыШ.Код;		
		
		Если ЗначениеЗаполнено(РеквизитыШ.Родитель) Тогда
			КС_XDTO.Группа	= ВыгрузитьСпр_Номенклатура_Группа_КС(РеквизитыШ.Родитель);	
		КонецЕсли;
		
		ВставитьВКэш(РеквизитыШ.Ссылка,КС_XDTO,ИмяТаблиы);
	КонецЕсли;	
	
	Возврат КС_XDTO;
КонецФункции //ВыгрузитьСпр_Номенклатура_Группа_КС(СпрВыборка)

Функция ВыгрузитьСпр_Номенклатура_Группа(СпрВыборка)
	ОбъектХДТО	= Неопределено;
	Если СпрВыборка	= Неопределено ИЛИ СпрВыборка = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат ОбъектХДТО;
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	Если НаВходеВыборка Тогда
		Реквизиты	= СпрВыборка;
	Иначе
		Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,РеквизитыШапок.Получить("Справочник.Номенклатура_Группа"));
	КонецЕсли;			
	
	ОбъектХДТО					= СоздатьОбъектХДТО("Справочник.НоменклатураГруппа",ПространствоИмен_ЕД);
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_Номенклатура_Группа_КС(СпрВыборка);		
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_Номенклатура_Группа_Объект(Ссылка)

Функция ВыгрузитьСпр_Номенклатура_Группа_Корень()
	СвойстваXDTO					= СоздатьОбъектХДТО("КлючевыеСвойстваНоменклатураГруппа");
	
	СвойстваXDTO.Ссылка				= СериализаторXDTO.XMLСтрока(Новый УникальныйИдентификатор("b80145a5-e351-11e9-b7f3-cf347837b296"));		
	СвойстваXDTO.Наименование		= "СтильПарк";
	СвойстваXDTO.КодВПрограмме		= "БП-00000229";	
	
	Возврат СвойстваXDTO;
КонецФункции // ()

Функция ВыгрузитьСпр_Номенклатура_Элемент_СоставНоменклатуры(Ссылка)
	Запрос		 = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	МатериалСостав,
	|	Процент
	|ИЗ
	|	Справочник.Номенклатура.СоставНоменклатуры
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Процент>0
	|";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		СоставXDTO	= СоздатьОбъектХДТО("Справочник.Номенклатура.Состав",ПространствоИмен_ЕЕ);
		Пока Выборка.Следующий() Цикл
			СтрокаСоставаXDTO	= СоздатьОбъектХДТО("Справочник.Номенклатура.Состав.Строка",ПространствоИмен_ЕЕ);			
			ЗаполнитьЗначенияСвойств(СтрокаСоставаXDTO,Выборка);
			
			СоставXDTO.Строка.Добавить(СтрокаСоставаXDTO);
		КонецЦикла; 		
	Иначе
		СоставXDTO	= Неопределено;
	КонецЕсли;
	
	Возврат СоставXDTO;
КонецФункции // ()

Функция ВыгрузитьСпр_ФР_НоменклатурныеГруппы_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ФР_НоменклатурныеГруппы,СпрВыборка,"Справочник.НоменклатурныеГруппы");
КонецФункции // ()

Функция ВыгрузитьСпр_Организации_КС(КонтрагентСсылка)
	ИмяТаблицы	= "Справочник.Организации";
	ОбъектХДТО	= ПолучитьИзКэша(КонтрагентСсылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда
		РеквизитыШапки				= ПолучитьРеквизитыШапки(КонтрагентСсылка,"Ссылка,Код,Наименование,ИНН,КПП","Справочник");
	
		//ОрганизацияXDTO			= СоздатьОбъектХДТО("Справочник.Организации"));	
		ОбъектХДТО					= СоздатьОбъектХДТО("КлючевыеСвойстваОрганизация");
		
		ОбъектХДТО.Ссылка			= СериализаторXDTO.XMLСтрока(КонтрагентСсылка);
		ОбъектХДТО.Наименование		= КонтрагентСсылка.Наименование;
		
		Если ТипЗнч(КонтрагентСсылка)=Тип("СправочникСсылка.Контрагенты") Тогда
			ОбъектХДТО.НаименованиеПолное = КонтрагентСсылка.ПолноеНаименование;
		Иначе
			ОбъектХДТО.НаименованиеПолное = КонтрагентСсылка.НаименованиеПолное;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(РеквизитыШапки.ИНН) Тогда
			ОбъектХДТО.ИНН=СокрЛП(РеквизитыШапки.ИНН);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыШапки.КПП) Тогда
			ОбъектХДТО.КПП=СокрЛП(РеквизитыШапки.КПП);
		КонецЕсли;
		//+ HELP-1058 20241002 Михайловский
		Попытка
		//- HELP-1058 20241002 Михайловский
			ОбъектХДТО.ЮридическоеФизическоеЛицо 	= ВыгрузитьПер_ЮрФизЛицо_КС(КонтрагентСсылка);
		//+ HELP-1058 20241002 Михайловский
		Исключение
		КонецПопытки;
		//- HELP-1058 20241002 Михайловский
		//ОрганизацияXDTO.КлючевыеСвойства=КлючевыеСвойстваXDTO;
		ВставитьВКэш(КонтрагентСсылка,ОбъектХДТО,"Справочник.Организации");
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_Организация(КонтрагентСсылка,Фабрика)

Функция ВыгрузитьСпр_Организации_Элемент(СпрВыборка)
	МетаОбъект	= Метаданные.Справочники.Организации;
	ИмяТаблицы	= МетаОбъект.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы+".Элемент";
	
	ВхПараметры = РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметры.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметры,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean", 	ПространствоИмен_СТ);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Организации_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Организации_Контрагенты_Элемент(СпрВыборка)
	МетаОбъект	= Метаданные.Справочники.Контрагенты;
	ИмяТаблицы	= МетаОбъект.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы+".Элемент";
	
	ВхПараметры = РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметры.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметры,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean", 	ПространствоИмен_СТ);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Организации_Контрагенты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Организации_Элемент_ЕД(СпрВыборка)
	ИмяТаблицы	= "Справочник.Организации";
	ИмяТипаХДТО	= "Справочник.Организации";
	
	ВхПараметры = РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметры.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметры,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО);
	
	ОбъектХДТО.КлючевыеСвойства = ВыгрузитьСпр_Организации_КС(Реквизиты.Ссылка);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.Код,				"Код",				"string", 	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,	"ПометкаУдаления",	"boolean", 	ПространствоИмен_СТ);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Организации_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ПодарочныеСертификаты_Элемент(СпрВыборка)
	ИмяТаблицы		= "Справочник.ПодарочныеСертификаты";
	ИмяТипаХДТО		= "Справочник.ПодарочныеСертификаты.Элемент";
	ПространствоИмен= ПространствоИмен_ЕЕ;
	
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"ВидСертификата");	
	
	Если РеквизитыШ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.Содексо Тогда
		ОбъектХДТО.ВидСертификата="Сторонний";
	ИначеЕсли РеквизитыШ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕ Тогда		
		ОбъектХДТО.ВидСертификата="Собственный";
	ИначеЕсли РеквизитыШ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека Тогда
		ОбъектХДТО.ВидСертификата="СертификатИзЧека";
	ИначеЕсли РеквизитыШ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека2011 Тогда			
		ОбъектХДТО.ВидСертификата="СертификатИзЧека";
	ИначеЕсли РеквизитыШ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.КупонНаСкидку Тогда
		ОбъектХДТО.ВидСертификата="КупонНаСкидку";
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ПодарочныеСертификаты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ПодарочныеСертификаты_Элемент_ЕД(СпрВыборка)
	ИмяТаблицы		= "Справочник.ПодарочныеСертификаты";
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 	
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= ВыгрузитьСпр_ПодарочныеСертификаты_КС(РеквизитыШ);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Использован,		"Использован",	     	"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Номинал,			"Номинал",		     	"decimal",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.СрокДействия,		"СрокДействия",     	"decimal",	ПространствоИмен_СТ);
	
	Если ЗначениеЗаполнено(РеквизитыШ.ПодразделениеВыдачи) Тогда
		ПодрХДТО	= ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШ.ПодразделениеВыдачи);
		ДобавитьСвойствоХДТО(ОбъектХДТО,ПодрХДТО,"ПодразделениеВыдачи",ПространствоИмен_ЕЕ);	
	КонецЕсли; 
	Если ЗначениеЗаполнено(РеквизитыШ.ПодразделениеПредъявления) Тогда
		ПодрХДТО	= ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШ.ПодразделениеПредъявления);
		ДобавитьСвойствоХДТО(ОбъектХДТО,ПодрХДТО,"ПодразделениеПредъявления",ПространствоИмен_ЕЕ);	
	КонецЕсли;	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.НачалоДействия,	"НачалоДействия",  	 	"date",		ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ОкончаниеДействия,"ОкончаниеДействия",	"date",		ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ДатаВыдачи,		"ДатаВыдачи",			"date",		ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ДатаПогашения,	"ДатаПогашения",    	"date",		ПространствоИмен_СТ);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.НомерЧекаВыдачи,				"НомерЧекаВыдачи",				"string", ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.НомерЧекаПогашения,			"НомерЧекаПогашения",			"string", ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Подарок,						"Подарок",						"boolean", ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.МинимальнаяСуммаЧекаПогашения,"МинимальнаяСуммаЧекаПогашения","string", ПространствоИмен_СТ);		
	//ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ВидСертификата,				"ВидСертификата",				"string", ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(РеквизитыШ.Акция),				"Акция",						"string", ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ОплатаНеБолее30Процентов,		"ОплатаНеБолее30Процентов",		"boolean", ПространствоИмен_СТ);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",		"boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ПодарочныеСертификаты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ПодарочныеСертификаты_КС(СпрВыборка)
	ИмяТаблицы	= "Справочник.ПодарочныеСертификаты";
	ИмяТипаХДТО	= "ОбщиеСвойстваДанныеПодарочногоСертификата";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"КС");
	
	Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= ПолучитьИзКэша(РеквизитыШ.Ссылка,ИмяТаблицы+".КС");
	
	Если ОбъектХДТО = Неопределено Тогда		
		ОбъектХДТО							= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕД);
		
		ОбъектХДТО.СерийныйНомер			= РеквизитыШ.Код;
		ОбъектХДТО.Штрихкод					= РеквизитыШ.КодСертификата;
		ОбъектХДТО.ВидПодарочногоСертификата= ВыгрузитьСпр_ВидыПодарочныхСертификатов_КС(РеквизитыШ.ВидСертификата);
		ОбъектХДТО.ДействителенДо			= РеквизитыШ.ОкончаниеДействия;		
		
		ДобавитьЭлементХДТО(ОбъектХДТО,СериализаторXDTO.XMLСтрока(РеквизитыШ.Ссылка),				"Ссылка",	"string", ПространствоИмен_СТ);		
		ДобавитьЭлементХДТО(ОбъектХДТО,СериализаторXDTO.XMLСтрока(РеквизитыШ.Владелец_Родитель),	"Владелец",	"string", ПространствоИмен_СТ);	
		
		ВставитьВКэш(РеквизитыШ.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ПодарочныеСертификаты_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Пользователи_Элемент(СпрВыборка)
	ОбъектХДТО	= Неопределено;
	
	Если СпрВыборка	= Неопределено ИЛИ СпрВыборка = Справочники.Пользователи.ПустаяСсылка() Тогда
		Возврат ОбъектХДТО;
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	ОбъектХДТО	= ПолучитьИзКэша(ТекСсылка,"Справочник.Пользователи");
	
	Если ОбъектХДТО = Неопределено Тогда
		Если НаВходеВыборка Тогда		
			Реквизиты					= СпрВыборка;
		Иначе
			Реквизиты					= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Родитель,Код,Наименование");			
		КонецЕсли;		
	
		ОбъектХДТО						= СоздатьОбъектХДТО("Справочник.Пользователи");		
		
		ОбъектХДТО.КлючевыеСвойства		= ВыгрузитьСпр_Пользователи_Элемент_КС(СпрВыборка);
		ДобавитьСвойствоХДТО(ОбъектХДТО,XMLСтрока(СпрВыборка.Подразделение_ДР),"Подразделение",ПространствоИмен_ЕЕ);		
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Пользователи_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Пользователи_Элемент_КС(Ссылка)	
	ОбъектХДТО	= ВыгрузитьСпр_КС(Ссылка,"Пользователи","Наименование","КлючевыеСвойстваПользователь");
	Если ЗначениеЗаполнено(Ссылка.ФизЛицо) Тогда
		ОбъектХДТО.ФизическоеЛицо=ВыгрузитьСпр_ФизическиеЛица_Элемент_КС(Ссылка.ФизЛицо);			
	КонецЕсли; 
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_Пользователь(Ссылка)

Функция ВыгрузитьСпр_ПричиныРекламаций_Группа(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Группа(Справочники.ПричиныРекламаций, СпрВыборка);
КонецФункции //ВыгрузитьСпр_Пользователи_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ПричиныРекламаций_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ПричиныРекламаций, СпрВыборка);
КонецФункции //ВыгрузитьСпр_Пользователи_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Подразделения_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.Подразделения,СпрВыборка);
КонецФункции //ВыгрузитьСпр_Подразделения_Элемент(Ссылка)

Функция ВыгрузитьСпр_Подразделения_Элемент_ЕД(СпрВыборка)
	ИмяТаблицы	= "Справочник.Подразделения";
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если Реквизиты.ВерсияДанных="" Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТаблицы);
	
	ОбъектХДТО.КлючевыеСвойства = ВыгрузитьСпр_Подразделения_Элемент_КС(Реквизиты.Ссылка);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.Код,"Код","string",ПространствоИмен_СТ);
	
	СкладХДТО	= ВыгрузитьСпр_КС(Реквизиты.ОсновнойСклад,"Склады","Наименование","КлючевыеСвойстваСклад");
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕД,"ОсновнойСклад",СкладХДТО);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Подразделения_Элемент(Ссылка)

Функция ВыгрузитьСпр_Подразделения_Элемент_КС(Ссылка,Знач ДатаВыгрузки=Неопределено)	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат Неопределено КонецЕсли;	
	
	ИмяТаблицы	= "Справочник.Подразделения";
	
	ОбъектХДТО	= ПолучитьИзКэша(Ссылка,ИмяТаблицы);	
	
	Если ОбъектХДТО	= Неопределено Тогда	
		Если ОбъектСуществует(Ссылка,ИмяТаблицы) Тогда
			ОбъектХДТО	= ВыгрузитьСпр_КС(Ссылка,"Подразделения","Наименование","КлючевыеСвойстваПодразделение");
		
			Если ДатаВыгрузки=Неопределено Тогда
				ДатаВыгрузки=ТекущаяДата();	
			КонецЕсли; 
			
			Организация	= РегистрыСведений.ФР_ЮрЛицаПодразделений.ПолучитьЮрЛицо(Ссылка,ДатаВыгрузки);
			
			ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Организация),"Организация","string",ПространствоИмен_СТ);		
		КонецЕсли;		
		
		ВставитьВКэш(Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Подразделения_Элемент_КС(Ссылка)

Функция ВыгрузитьСпр_Размеры_Элемент(СпрВыборка)		
	ИмяТаблицы		= "Справочник.Размеры";
	ВариантВыгрузки = "Элемент";
	ИмяОбъектаХДТО	= ИмяТаблицы+"."+ВариантВыгрузки;
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяОбъектаХДТО,ПространствоИмен_ЕЕ);	
	ОбъектХДТО.КлючевыеСвойства = ВыгрузитьСпр_Размеры_КС(СпрВыборка);	
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ВариантВыгрузки);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления","string",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Размеры_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_Размеры_КС(СпрВыборка)		
	ИмяТаблицы	= "Справочник.Размеры";	
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);	
	
	Если ОбъектХДТО=Неопределено Тогда	
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");	
		
		Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
		
		ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТаблицы+".КС",ПространствоИмен_ЕЕ);	
				
		ОбъектХДТО.Ссылка		= XMLСтрока(РеквизитыШ.Ссылка);
		ОбъектХДТО.Код			= РеквизитыШ.Код;
		ОбъектХДТО.Наименование	= РеквизитыШ.Наименование;
				
		Если ЗначениеЗаполнено(РеквизитыШ.Родитель) Тогда
			ОбъектХДТО.Группа	= ВыгрузитьСпр_Размеры_КС(РеквизитыШ.Родитель);
		КонецЕсли;
		
		ВставитьВКэш(ВхПараметр.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Размеры_КС(Размер)

Функция ВыгрузитьСпр_Размеры_Группа(СпрВыборка)
	ИмяТаблицы		= "Справочник.Размеры";
	ВариантВыгрузки = "Группа";
	ИмяОбъектаХДТО	= ИмяТаблицы+"."+ВариантВыгрузки;
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяОбъектаХДТО,ПространствоИмен_ЕЕ);	
	ОбъектХДТО.КлючевыеСвойства = ВыгрузитьСпр_Размеры_КС(СпрВыборка);
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ВариантВыгрузки);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления","string",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Размеры_Группа(СпрВыборка)

Функция ВыгрузитьСпр_РазмерыЧашки_Элемент(СпрВыборка)	
	Возврат Неопределено;
КонецФункции

Функция ВыгрузитьСпр_Склады_Элемент(СпрВыборка)
	ОбъектХДТО	= Неопределено;
	
	Если СпрВыборка	= Неопределено ИЛИ СпрВыборка = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат ОбъектХДТО;
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	КС_ХДТО			= ПолучитьИзКэша(ТекСсылка,"Справочник.Склады");
	
	Если КС_ХДТО = Неопределено Тогда
		КС_ХДТО	= ВыгрузитьСпр_Склады_Элемент_КС(СпрВыборка);		
	КонецЕсли;	
	
	Если НаВходеВыборка Тогда		
		Реквизиты					= СпрВыборка;
	Иначе
		Реквизиты					= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Родитель,Код,Наименование,Подразделение");			
	КонецЕсли;		

	ОбъектХДТО						= СоздатьОбъектХДТО("Справочник.Склады");		
	
	ОбъектХДТО.КлючевыеСвойства		= КС_ХДТО;		
	Если ЗначениеЗаполнено(Реквизиты.Родитель) Тогда
		ОбъектХДТО.Группа			= ВыгрузитьСпр_Склады_Группа_КС(Реквизиты.Родитель);						
	КонецЕсли;
	УстановитьСвойствоХДТО(ОбъектХДТО,"Подразделение",ВыгрузитьСпр_Подразделения_Элемент_КС(Реквизиты.Подразделение));
	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.Код),"Код","string",ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления",		"boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСправочник_Склады_Элемент(Ссылка)

Функция ВыгрузитьСпр_Склады_Группа(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Склады";
	ИмяТипаХДТО = "Справочник.СкладыГруппа";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Группа");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяТипаХДТО);
	
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_Склады_Группа_КС(СпрВыборка);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.Код),"Код","string",ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Склады_Группа(СпрВыборка)

Функция ВыгрузитьСпр_Склады_Элемент_КС(СпрВыборка)
	ИмяТаблицы	= "Справочник.Склады";	
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда
		Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
		
		ОбъектХДТО						= СоздатьОбъектХДТО("КлючевыеСвойстваСклад");
	
		ОбъектХДТО.Ссылка				= XMLСтрока(Реквизиты.Ссылка);			
		ОбъектХДТО.Наименование			= Реквизиты.Наименование;
		ОбъектХДТО.ТипСклада			= "Оптовый";		
		
		ВставитьВКэш(ВхПараметр.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьСправочник_Склады_Элемент_КС(Ссылка)

Функция ВыгрузитьСпр_Склады_Группа_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Склады";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Группа.КС");
	
	Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= ПолучитьИзКэша(РеквизитыШ.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда	
		ОбъектХДТО						= СоздатьОбъектХДТО("КлючевыеСвойстваСкладГруппа");
	
		ОбъектХДТО.Ссылка				= XMLСтрока(РеквизитыШ.Ссылка);		
		Если ЗначениеЗаполнено(РеквизитыШ.Родитель) Тогда
			ОбъектХДТО.Группа			= ВыгрузитьСпр_Склады_Группа_КС(РеквизитыШ.Родитель);						
		КонецЕсли;
		ОбъектХДТО.Наименование			= РеквизитыШ.Наименование;
		
		ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(РеквизитыШ.Код),"Код","string",ПространствоИмен_СТ);
		
		ВставитьВКэш(РеквизитыШ.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьСправочник_Склады_Группа_КС(СпрВыборка)

Функция ВыгрузитьСпр_СтатьиЗатрат_Элемент(СпрВыборка)
	ИмяТаблицы		= "Справочник.СтатьиЗатрат";
	ИмяОбъектаХДТО	= "Справочник.СтатьиРасходов";
	
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяОбъектаХДТО);	
	ОбъектХДТО.КлючевыеСвойства = ВыгрузитьСпр_СтатьиЗатрат_Элемент_КС(СпрВыборка);		
	
	ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,"ПометкаУдаления",		"boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_СтатьиЗатрат_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_СтатьиЗатрат_Элемент_КС(СпрВыборка)
	ИмяТаблицы		= "Справочник.СтатьиЗатрат";
	
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО 		= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент.КС");		
		
		Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
		
		ОбъектХДТО					= СоздатьОбъектХДТО("КлючевыеСвойстваСтатьяРасходов");
		
		ОбъектХДТО.Ссылка			= СериализаторXDTO.XMLСтрока(РеквизитыШ.Ссылка);
		ОбъектХДТО.КодВПрограмме	= РеквизитыШ.Код;
		ОбъектХДТО.Наименование		= РеквизитыШ.Наименование;		
		
		ВставитьВКэш(РеквизитыШ.Ссылка,ОбъектХДТО,ИмяТаблицы);		
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_СтатьиЗатрат_Элемент_КС(КонтрагентСсылка,Фабрика)

Функция ВыгрузитьСпр_СтраныМира_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО(Справочники.КлассификаторСтранМира,СпрВыборка,Ложь,"Справочник.СтраныМира");	
КонецФункции //ВыгрузитьСпр_СтраныМира_Элемент(СпрСсылка)

Функция ВыгрузитьСпр_СтраныМира_Элемент_ЕД(СпрВыборка)
	ИмяТаблицы		= Метаданные.Справочники.КлассификаторСтранМира.ПолноеИмя();	
	ИмяТипаХДТО		= "Справочник.СтраныМира";
	ВариантВыгрузки = "Элемент";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО);
	
	ОбъектХДТО.КлючевыеСвойства		= ВыгрузитьСпр_СтраныМира_КС(СпрВыборка);	
	ОбъектХДТО.НаименованиеПолное	= РеквизитыШ.НаименованиеПолное;	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,"ПометкаУдаления",		"boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_СтраныМира_Элемент(СпрСсылка)

Функция ВыгрузитьСпр_СтраныМира_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочники.КлассификаторСтранМира";	
	ИмяТипаХДТО	= "КлючевыеСвойстваСтранаМира";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);	
	
	Если ОбъектХДТО=Неопределено Тогда		
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"КС");	
	
		Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
		ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО);	
				
		ОбъектХДТО.Ссылка		= XMLСтрока(РеквизитыШ.Ссылка);
		ОбъектХДТО.Код			= РеквизитыШ.Код;
		ОбъектХДТО.Наименование	= РеквизитыШ.Наименование;		
		
		ВставитьВКэш(ВхПараметр.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьСпр_СтраныМира_КС(Страна)

Функция ВыгрузитьСпр_ТНВЭД_Группа(СпрВыборка)	
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Группа(Справочники.ТНВЭД, СпрВыборка, "Справочник.КлассификаторТНВЭД");
КонецФункции //ВыгрузитьСпр_ТНВЭД_Группа(СпрСсылка)

Функция ВыгрузитьСпр_ТНВЭД_Элемент(СпрВыборка)	
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ТНВЭД, СпрВыборка, "Справочник.КлассификаторТНВЭД");
КонецФункции //ВыгрузитьСпр_ТНВЭД_Элемент(СпрСсылка)

Функция ВыгрузитьСпр_Цвета_Элемент(СпрВыборка)
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.Цвета,СпрВыборка);
КонецФункции //ВыгрузитьСпр_Цвета_Элемент(Номенклатура)

Функция ВыгрузитьСпр_Цвета_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочник.Цвета";
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);	
	
	Если ОбъектХДТО=Неопределено Тогда		
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"КС");	
	
		Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
		ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТаблицы+".КС",ПространствоИмен_ЕЕ);	
				
		ОбъектХДТО.Ссылка		= XMLСтрока(РеквизитыШ.Ссылка);
		ОбъектХДТО.Код			= РеквизитыШ.Код;
		ОбъектХДТО.Наименование	= РеквизитыШ.Наименование;
				
		Если ЗначениеЗаполнено(РеквизитыШ.Родитель) Тогда
			ОбъектХДТО.Группа	= ВыгрузитьСпр_Цвета_КС(РеквизитыШ.Родитель);
		КонецЕсли;
		
		ВставитьВКэш(ВхПараметр.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_Цвета_КС(СпрВыборка)

Функция ВыгрузитьСпр_Цвета_Группа(СпрВыборка)	
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Группа(Справочники.Цвета,СпрВыборка);
КонецФункции //ВыгрузитьСпр_Цвета_Группа(Номенклатура)

Функция Выгрузить_Справочник_Ссылка(Вид,Ссылка)	
	ОбъектХДТО = Фабрика.Создать(Фабрика.Тип(ПространствоИмен_ЕЕ,"Справочник."+Вид+".Ссылка"),XMLСтрока(Ссылка));	
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_Справочник_Ссылка(Вид,УИД)	

Функция ВыгрузитьСпр_ШтрихКоды_Элемент(СпрВыборка) Экспорт
	Если 1=2 Тогда
		СпрОбъект=Справочники.ШтрихКоды.СоздатьЭлемент()	
	КонецЕсли; 
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	Если НаВходеВыборка Тогда
		Реквизиты	= СпрВыборка;
	Иначе
		Реквизиты	= РеквизитыШапок.Получить("Справочник.ШтрихКоды");		
	КонецЕсли;
	
	ОбъектХДТО						= СоздатьОбъектХДТО("Справочник.ШтрихкодыНоменклатуры");	
		
	ОбъектХДТО.ШтрихкодОтбор		= Реквизиты.Наименование;	
	
	ОбъектХДТО.ХарактеристикаОтбор	= ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_КС(Реквизиты.Владелец);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.ТипШК),		"ТипШК", 	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.ВидШК),		"ВидШК", 	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.ФорматШК), 	"ФорматШК", "string",	ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(Реквизиты.Ссылка), 	"Ссылка",   "string",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ШтрихКоды_Элемент(СпрВыборка) Экспорт

Функция ВыгрузитьСпр_ТипыЦен_Элемент(СпрВыборка)		
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ТипыЦен,СпрВыборка);	
КонецФункции //Выгрузить_КС_ТипыЦен(Ссылка)

Функция ВыгрузитьСпр_ТипыЦен_Элемент_ЕД(СпрВыборка)
	ИмяТаблицы		= "Справочник.ТипыЦен";
	ВариантВыгрузки = "Элемент";
	ИмяОбъектаХДТО	= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяОбъектаХДТО);
	
	ОбъектХДТО.КлючевыеСвойства		= ВыгрузитьСпр_ТипыЦен_Элемент_КС(СпрВыборка);
	ОбъектХДТО.ЦенаВключаетНДС		= Истина;	
	ОбъектХДТО.ТочностьОкругления	= РеквизитыШ.ТочностьОкругления;	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Код,		"Код",		"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.sale,		"sale",		"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Розничный,"Розничный","boolean",	ПространствоИмен_СТ);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,"ПометкаУдаления", "boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;	
КонецФункции //Выгрузить_КС_ТипыЦен(Ссылка)

Функция ВыгрузитьСпр_ТипыЦен_Элемент_КС(СпрВыборка)		
	ИмяТаблицы	= "Справочник.ТипыЦен";
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);	
	
	Если ОбъектХДТО=Неопределено Тогда
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"КС");
		
		Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
		ОбъектХДТО	= ВыгрузитьСпр_КС(РеквизитыШ.Ссылка,"ТипыЦен","Наименование","КлючевыеСвойстваТипЦен");	
		ОбъектХДТО.ВалютаЦены	= ВыгрузитьСпр_Валюты_КС(РеквизитыШ.Валюта);
		
		ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Код,"Код","string",ПространствоИмен_СТ);
	КонецЕсли;
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьСпр_ТипыЦен_Элемент_КС(СпрВыборка)

Функция ВыгрузитьСпр_ТипыСкидок_Элемент(СпрВыборка)	
	ИмяТаблицы	= Метаданные.Справочники.ТипыСкидок.ПолноеИмя();	
	ИмяТипаХДТО = ИмяТаблицы+".Элемент";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,СпрВыборка);
	
	Возврат ОбъектХДТО;		
КонецФункции //ВыгрузитьСпр_ТипыСкидок_Элемент(Ссылка)

Функция ВыгрузитьСпр_ФизическиеЛица_Элемент(СпрВыборка)	
	ИмяТаблицы	= "Справочник.ФизическиеЛица";	
	ИмяТипаХДТО = ИмяТаблицы+".Элемент";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,СпрВыборка);
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьСпр_ФизическиеЛица_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ФизическиеЛица_Элемент_ЕД(СпрВыборка)	
	ИмяТаблицы	= "Справочник.ФизическиеЛица";	
	ИмяТипаХДТО = "Справочник.ФизическиеЛица";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяТипаХДТО);
	
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_ФизическиеЛица_Элемент_КС(СпрВыборка);			
		
	ДобавитьЭлементХДТО(ОбъектХДТО,СпрВыборка.Код,"Код","string",ПространствоИмен_СТ);
	
	Если ЗначениеЗаполнено(Реквизиты.Подразделение) Тогда
		ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"Подразделение",ВыгрузитьСпр_Подразделения_Элемент_КС(Реквизиты.Подразделение));
	КонецЕсли;
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьСпр_ФизическиеЛица_Элемент(СпрВыборка)

Функция ВыгрузитьСпр_ФизическиеЛица_Элемент_КС(СпрВыборка)
	ИмяТаблицы	= "Справочник.ФизическиеЛица";
	ИмяТипаХДТО	= "КлючевыеСвойстваФизическоеЛицо";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);	
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	ОбъектХДТО	= ПолучитьИзКэша(Реквизиты.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда		
		ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО);
		
		ОбъектХДТО.Ссылка		= XMLСтрока(Реквизиты.Ссылка);
		ОбъектХДТО.ФИО			= ?(ЗначениеЗаполнено(Реквизиты.Наименование),Реквизиты.Наименование,"");		
		
		Если ЗначениеЗаполнено(Реквизиты.ИНН) Тогда
			ОбъектХДТО.ИНН=СокрЛП(Реквизиты.ИНН);
		КонецЕсли;
		
		ВставитьВКэш(Реквизиты.Ссылка,ОбъектХДТО,ИмяТаблицы);		
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ФизическиеЛица_Элемент_КС(Ссылка)

Функция ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент(СпрВыборка)	
	ИмяТаблицы		= "Справочник.Номенклатура";
	ВхПараметр		= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент");
	
	ОбъектХДТО	= ПолучитьИзКэша(Реквизиты.Ссылка);
	Если ОбъектХДТО	= Неопределено Тогда				
		ОбъектХДТО = СоздатьОбъектХДТО("Справочник.ХарактеристикиНоменклатуры.Элемент",ПространствоИмен_ЕЕ);		
		
		ЗаполнитьЗначенияСвойств(ОбъектХДТО,Реквизиты);
		
		ОбъектХДТО.Владелец		= Реквизиты.Родитель;
		//Валетов + 07.11.2024 Выгрузка GTIN
		ОбъектХДТО.ГТИН			= Реквизиты.Ссылка.ГТИН;
		//Валетов -
		Если СпрВыборка.Родитель_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.МБП 
			ИЛИ СпрВыборка.Родитель_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ОсновноеСредство Тогда
			ОбъектХДТО.Наименование	= СпрВыборка.Наименование;
		Иначе			
			ОбъектХДТО.Наименование	= СокрЛП(СокрЛП(Реквизиты.Цвет_Наименование))+" "+(СокрЛП(Реквизиты.Размер_Наименование));
			Если ЗначениеЗаполнено(Реквизиты.ДопПараметрРазмера_Наименование) Тогда
				ОбъектХДТО.Наименование = СокрЛП(ОбъектХДТО.Наименование)+" "+СокрЛП(Реквизиты.ДопПараметрРазмера_Наименование);
			КонецЕсли;			
		КонецЕсли;		
		
		ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);		
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_ХарактеристикаНоменклатуры(ХарактеристикаНоменклатуры)

Функция ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_ЕД(СпрВыборка)	
	
	
	НаВходеВыборка	= (ТипЗнч(СпрВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ТекСсылка		= ?(НаВходеВыборка,СпрВыборка.Ссылка,СпрВыборка);
	
	ОбъектХДТО	= ПолучитьИзКэша(ТекСсылка);
	Если ОбъектХДТО	= Неопределено Тогда				
		ОбъектХДТО = СоздатьОбъектХДТО("Справочник.ХарактеристикиНоменклатуры");
		
		Если НаВходеВыборка Тогда
			Реквизиты	= СпрВыборка;
		Иначе
			Реквизиты	= ПолучитьРеквизитыШапки(ТекСсылка,"Ссылка,Код,Наименование,Цвет,Размер");			
		КонецЕсли;
		
		ТекСсылка	= Реквизиты.Ссылка;		
		
		ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_КС(Реквизиты);
		ОбъектХДТО.Наименование		= Реквизиты.Наименование;	
		
		ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.Код,				"Код",				"string",	ПространствоИмен_СТ);	
		ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.СнятСПроизводства,	"СнятСПроизводства","boolean",	ПространствоИмен_СТ);	
		ДобавитьЭлементХДТО(ОбъектХДТО,Реквизиты.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
		
		ДобавитьСвойствоХДТО(ОбъектХДТО,ВыгрузитьСпр_Цвета_КС(Реквизиты.Цвет),		"Цвет",		ПространствоИмен_ЕЕ);
		ДобавитьСвойствоХДТО(ОбъектХДТО,ВыгрузитьСпр_Размеры_КС(Реквизиты.Размер),	"Размер",	ПространствоИмен_ЕЕ);		
	КонецЕсли;
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_ЕД(ХарактеристикаНоменклатуры)

Функция ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_КС(СпрВыборка)	
	ИмяТаблицы	= "Справочник.ФР_ХарактеристикиНоменклатуры";
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= ПолучитьИзКэша(ВхПараметр.Ссылка,ИмяТаблицы);
	
	Если ОбъектХДТО = Неопределено Тогда	
		РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"Элемент.КС");	
		
		Если ПустаяСтрока(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;	
	
		ОбъектХДТО						= СоздатьОбъектХДТО("КлючевыеСвойстваХарактеристикаНоменклатуры");
	
		ОбъектХДТО.Ссылка				= XMLСтрока(РеквизитыШ.Ссылка);	
		ОбъектХДТО.Номенклатура			= ВыгрузитьСпр_Номенклатура_Элемент_КС(РеквизитыШ.Родитель,Истина);
		ОбъектХДТО.НаименованиеПолное	= РеквизитыШ.Наименование;	
		
		ВставитьВКэш(РеквизитыШ.Ссылка,ОбъектХДТО,ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции //Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(Номенклатура,Фабрика)

Функция ВыгрузитьСпр_ШтрихкодыУпаковокТоваров_Элемент(СпрВыборка) Экспорт
	Возврат ВыгрузитьСпр_СТАНДАРТНО_Элемент(Справочники.ШтрихкодыУпаковокТоваров, СпрВыборка, "Справочник.ШтрихкодыУпаковокТоваров");
КонецФункции //ВыгрузитьСпр_ШтрихкодыУпаковокТоваров_Элемент(СпрВыборка) Экспорт


Функция ВыгрузитьСпр_СТАНДАРТНО_Элемент(Менеджер,СпрВыборка,ИмяТаблицыПолучатель="")	
	Возврат ВыгрузитьСпр_СТАНДАРТНО(Менеджер,СпрВыборка,Ложь,ИмяТаблицыПолучатель);
КонецФункции //ВыгрузитьСпр_СТАНДАРТНО_Элемент(Менеджер,СпрВыборка,ИмяТаблицыПолучатель="")

Функция ВыгрузитьСпр_СТАНДАРТНО_Группа(Менеджер,СпрВыборка,ИмяТаблицыПолучатель="")	
	Возврат ВыгрузитьСпр_СТАНДАРТНО(Менеджер,СпрВыборка,Истина,ИмяТаблицыПолучатель);
КонецФункции //ВыгрузитьСпр_СТАНДАРТНО_Элемент(Менеджер,СпрВыборка,ИмяТаблицыПолучатель="")

Функция ВыгрузитьСпр_СТАНДАРТНО(Менеджер,СпрВыборка,ЭтоГруппа,Знач ИмяТипаХДТО="")	
	ИмяТаблицы	= Менеджер.ПустаяСсылка().Метаданные().ПолноеИмя();
	ИмяТипаХДТО	= ?(ПустаяСтрока(ИмяТипаХДТО),ИмяТаблицы,ИмяТипаХДТО);
	
	ВхПараметр	= РазобратьВходнойПараметр(СпрВыборка,ИмяТаблицы);
	
	Суффикс	= ?(ЭтоГруппа,"Группа","Элемент");
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	Реквизиты	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,Суффикс);
	//+HELP-3612 20250325 Михайловский до релиза фр!! пока так пусть
	Попытка
		Если ИмяТипаХДТО="Справочник.ШтрихкодыУпаковокТоваров" Тогда
			Если Реквизиты.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.ПокупкаВРФ Тогда
				Реквизиты.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт;
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	//-HELP-3612 20250325 Михайловский
	ОбъектХДТО = СоздатьОбъектХДТО(ИмяТипаХДТО+"."+Суффикс,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,Реквизиты);	
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьСпр_СТАНДАРТНО_Элемент(Менеджер,СпрВыборка,ИмяТаблицыПолучатель="")

#КонецОбласти


#Область Выгрузка_Перечисления

Функция ВыгрузитьПер_СтавкаНДС(СтавкаНДС)
	Если СтавкаНДС=Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат "БезНДС";
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат "НДС0";				
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат "НДС10";
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат "НДС18";
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат "НДС20";
	//+SNL-77 20260111 Михайловский	
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС22 Тогда
		Возврат "НДС22";
	//-SNL-77 20260111 Михайловский	
	//+HELP-2538 20250115 Михайловский
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС5 Тогда
		Возврат "НДС5";
	ИначеЕсли СтавкаНДС=Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат "НДС7";
	//-HELP-2538 20250115 Михайловский
	Иначе
		Возврат "НДС20";
	КонецЕсли; 
КонецФункции // ()

Функция ВыгрузитьПер_ЮрФизЛицо_КС(Значение)
	Возврат ?(Значение=Перечисления.ЮрФизЛицо.ЮрЛицо,"ЮридическоеЛицо","ФизическоеЛицо");
КонецФункции // ()

Функция ВыгрузитьПер_СостояниеСогласования(ЗначениеПеречисления)
	Если ЗначениеПеречисления=Перечисления.СостоянияСогласования.ПустаяСсылка() Тогда		
		Возврат Неопределено;
	ИначеЕсли ЗначениеПеречисления=Перечисления.СостоянияСогласования.НаСогласованииЦО Тогда
		Возврат "НаСогласовании";				
	ИначеЕсли ЗначениеПеречисления=Перечисления.СостоянияСогласования.НаСогласованииКонтрагент Тогда
		Возврат "НаСогласовании";				
	ИначеЕсли ЗначениеПеречисления=Перечисления.СостоянияСогласования.ОтмененКонтрагент Тогда
		Возврат "НеСогласовано";	
	ИначеЕсли ЗначениеПеречисления=Перечисления.СостоянияСогласования.ОтмененЦО Тогда
		Возврат "НеСогласовано";	
	ИначеЕсли ЗначениеПеречисления=Перечисления.СостоянияСогласования.Согласован Тогда
		Возврат "Согласовано";	
	Иначе
		Возврат "ВРаботе";		
	КонецЕсли;	
КонецФункции //ВыгрузитьПер_СостояниеСогласования(ЗначениеПеречисления)

#КонецОбласти


#Область Выгрузка_Документы


Процедура ВыгрузитьДокументы(РежимВыгрузки,Получатель) Экспорт			
	Выборка	= ПолучитьВыборкуДокументовКВыгрузке(ВыбранныеВариантыКВыгрузке());
	
	ТО=РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Сч	= Выборка.Количество();
	Сообщить_("К выгрузке: "+Сч);
	Пока Выборка.Следующий() Цикл		
		ОбработкаПрерыванияПользователя_();
		
		СтрокаТО				= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка	= Выборка.ОбъектСсылка;
		СтрокаТО.ВариантВыгрузки= Выборка.ВариантВыгрузки;
		
		Если ТипЗнч(СтрокаТО.ОбъектСсылка)=Тип("ДокументСсылка.ПрайсЛист") Тогда
			СтрокаТО	= ТО.Добавить();
			СтрокаТО.ОбъектСсылка		= Выборка.ОбъектСсылка;					
			СтрокаТО.ВариантВыгрузки	= "РегистрСведений.ЦеныНоменклатуры";
		КонецЕсли; 
		
		//СписокОбъектов.Добавить(Выборка.ОбъектСсылка);
	
		//Состояние_("Выгрузка: "+Выборка.ОбъектСсылка);				
		//
		//ОбъектХДТО	= ВыгрузитьДокумент(Выборка.СсылкаНаОбъект,Выборка.Получатель);
		//Если ОбъектХДТО<>Неопределено Тогда
		//	Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
		//КонецЕсли;
		//
		//Сч=Сч-1;
		Если Сч%100=0 Тогда			
			Состояние_(Сч);				
		КонецЕсли; 
	КонецЦикла;	
		
	ВыгрузитьПакетом(РежимВыгрузки,Новый Структура("СписокОбъектов,Получатель",ТО,Получатель));
		
	Состояние_("");
КонецПроцедуры

Функция ВсеВариантыВыгрузки() Экспорт
	ВариантыВыгрузки	= "ВводОстатковТМЦ,РНК_ПНК,ПНК,ПНК_ВЗВ,ПРМ_ПНК,ПРМ_ПРМ,ПРМ_РНК,ОКС,ЧекККМ,ПС,РКО,ПКО,ПрайсЛист,УстановкаСкидок,ОПР,СПН,ИНВ";
	
	Возврат СтрРазделить(ВариантыВыгрузки,",");
КонецФункции //ВсеВариантыВыгрузки()
 

Функция ВыбранныеВариантыКВыгрузке()
	ВариантыВыгрузки	= ВсеВариантыВыгрузки();
	ВыбранныеВарианты	= Новый Массив;
	
	Для Каждого ВариантВыгрузки Из ВариантыВыгрузки Цикл
		Если ЭтотОбъект["ф"+ВариантВыгрузки] Тогда
			ВыбранныеВарианты.Добавить(ВариантВыгрузки);					
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ВыбранныеВарианты;
КонецФункции // ()
 

Функция ВыгрузитьДокумент(ДокСсылка,ДопИнфо=Неопределено)		
	ОбъектХДТО	= Неопределено;
	
	ВидДокумента=ДокСсылка.Метаданные().Имя;
	Если ВидДокумента="ПриходнаяНакладная" Тогда
		Если ДокСсылка.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
			ОбъектХДТО	= ВыгрузитьДок_ПНК_ВЗВ(ДокСсылка);
		Иначе
			ОбъектХДТО	= ВыгрузитьДок_ПНК(ДокСсылка);
		КонецЕсли;		
	ИначеЕсли ВидДокумента="Перемещение" Тогда
		//+HELP-1380 20241015 Михайловский
		//вместо
		//Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка,"Склад.Подразделение,Склад.Подразделение.ВидПодразделения,СкладПолучатель.Подразделение,СкладПолучатель.Подразделение.ВидПодразделения","Документ");
		Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка,"Склад.Подразделение,Склад.Подразделение.ВидПодразделения,СкладПолучатель.Подразделение,СкладПолучатель.Подразделение.ВидПодразделения, Склад.ТипСклада, СкладПолучатель.ТипСклада","Документ");

		//вместо 
		//Если Реквизиты.Склад_Подразделение=Реквизиты.СкладПолучатель_Подразделение Тогда
		ДопУсловие = Ложь;
		Попытка
			//Склад.ТипСклада 
			Если (Реквизиты.СкладПолучатель_ТипСклада = Перечисления.ТипСклада.РозничныйТЦ) ИЛИ (Реквизиты.Склад_ТипСклада = Перечисления.ТипСклада.РозничныйТЦ)
				ИЛИ (Реквизиты.СкладПолучатель_ТипСклада = Перечисления.ТипСклада.Филиал) ИЛИ (Реквизиты.СкладПолучатель_ТипСклада = Перечисления.ТипСклада.Филиал) Тогда
				ДопУсловие = Истина;
			КонецЕсли;	
		Исключение
			//это просто заглушка нет сообщения
		КонецПопытки;
		Если Реквизиты.Склад_Подразделение=Реквизиты.СкладПолучатель_Подразделение И ДопУсловие Тогда
		//-HELP-1380 20241015 Михайловский
			ОбъектХДТО	= ВыгрузитьДок_ПРМ_ПРМ_ЕЕ(ДокСсылка); //Обычное перемещение			
		Иначе			
			Если Реквизиты.Склад_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
				Если Реквизиты.СкладПолучатель_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
					//Вообще странная ситуация.....перемещение в другой франч - такого в принципе быть не должно
					ОбъектХДТО	= ВыгрузитьДок_ПРМ_ПРМ_ЕЕ(ДокСсылка);
				Иначе
					ОбъектХДТО	= ВыгрузитьДок_ПРМ_РНК_ЕЕ(ДокСсылка); //Возврат в ЕЕ
				КонецЕсли;			
			ИначеЕсли Реквизиты.СкладПолучатель_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
				ОбъектХДТО	= ВыгрузитьДок_ПРМ_ПНК_ЕЕ(ДокСсылка);	//Приход во франч
			КонецЕсли;
		КонецЕсли;				
	ИначеЕсли ВидДокумента="ОтчетКассовойСмены" Тогда		
		ОбъектХДТО	= ВыгрузитьДок_ОКС(ДокСсылка);	
	ИначеЕсли ВидДокумента="Чек" Тогда		
		ОбъектХДТО	= ВыгрузитьДок_Чек(ДокСсылка);
	ИначеЕсли ВидДокумента="ОприходованиеТМЦ" Тогда
		ОбъектХДТО	= ВыгрузитьДок_ОПР(ДокСсылка);
	ИначеЕсли ВидДокумента="СписаниеТМЦ" Тогда
		ОбъектХДТО	= ВыгрузитьДок_СПН(ДокСсылка);
	ИначеЕсли ВидДокумента="Инвентаризация" Тогда
		ОбъектХДТО	= ВыгрузитьДок_ИНВ(ДокСсылка);
	ИначеЕсли ВидДокумента="ПрайсЛист" Тогда		
		ОбъектХДТО	= ВыгрузитьДок_ПрайсЛист(ДокСсылка,ДопИнфо);
	ИначеЕсли ВидДокумента="РасходнаяНакладная" Тогда
		ОбъектХДТО	= ВыгрузитьДок_РНК_ПНК(ДокСсылка);
	КонецЕсли;	
	
	Возврат ОбъектХДТО;
КонецФункции

Процедура ЗарегистрироватьДокументыКВыгрузке() Экспорт
	Выборка		= ПолучитьВыборкуДокументовКВыгрузке(ВыбранныеВариантыКВыгрузке());	
	ВсегоСтрок	= Выборка.Количество();
	
	Сообщить_("К регистрации: "+ВсегоСтрок+" документов.");
	
	ТД			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Сч			= 0;
	
	ВыгруженныеПрайсы	= Новый Массив;
	
	Пока Выборка.Следующий() Цикл	
		ОбработкаПрерыванияПользователя_(); 
		
		Сч=Сч+1;
		
		СтрокаТД	= ТД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТД,Выборка);	
		
		ДокСсылка		= СтрокаТД.ОбъектСсылка;
		ТипДокумента	= ТипЗнч(ДокСсылка);
		
		Если ТипДокумента=Тип("ДокументСсылка.ПрайсЛист") Тогда
			ЗарегистрироватьНЗ_ЦеныНоменклатуры(ДокСсылка);
		ИначеЕсли ТипДокумента=Тип("ДокументСсылка.УстановкаСкидок") Тогда			
			ЗарегистрироватьНЗ_СкидкиНоменклатуры(ДокСсылка);
		КонецЕсли; 
		
		Если Сч%100=0 Тогда
			РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТД);
			
			ТД.Очистить();		
			
			Состояние_(ВсегоСтрок-Сч);
		КонецЕсли;			
	КонецЦикла; 
	
	Если ТД.Количество()>0 Тогда
		РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТД);
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗарегистрироватьНЗ_ЦеныНоменклатуры(ДокСсылка) Экспорт
	НЗ	= РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НЗ.Отбор.Прайс.Установить(ДокСсылка,Истина);
	НЗ.Отбор.ТипЦен.Установить(ДокСсылка.ТипЦен,Истина);
	
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(НЗ);
КонецФункции // ()

Функция ЗарегистрироватьНЗ_СкидкиНоменклатуры(ДокСсылка) Экспорт
	НЗ	= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(ДокСсылка,Истина);
	НЗ.Отбор.ТипСкидок.Установить(ДокСсылка.ТипСкидок,Истина);
	
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(НЗ);
КонецФункции // ()
		
Функция ТекстЗапроса_СписокДоковПоВиду(ВидДокумента,Знач Фильтр=Неопределено,Знач ПолеПолучателя=Неопределено,ВариантВыгрузки="",ОбратныйПорядок=Ложь)
	Если Фильтр=Неопределено Тогда
		Фильтр="
		|	НЕ Склад.Подразделение=ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	И (
		|			Склад.Подразделение	= &ПодразделениеТек 
		|			ИЛИ (
		|				&ПодразделениеТек	= ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|				И Склад.Подразделение.ВидПодразделения	= ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
		|			)
		|	)
		|";
	КонецЕсли;	
	
	Если ПолеПолучателя=Неопределено Тогда
		ПолеПолучателя="Склад.Подразделение";
	КонецЕсли; 
	
	Текст="
	|ВЫБРАТЬ "+?(ОбратныйПорядок,"ПЕРВЫЕ 1","")+"
	|	Ссылка,
	|	Дата,
	|	"+ПолеПолучателя+"		КАК Получатель,
	|	"""+ВариантВыгрузки+"""	КАК ВариантВыгрузки,
	|	Неопределено 			КАК ДокОснование
	|ИЗ
	|	Документ."+ВидДокумента+"
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	"+?(ВидДокумента="Чек","","И Проведен")+"	
	|	И "+Фильтр+"
	|	И (Ссылка=&ВыбДок ИЛИ &ВыбДок=Неопределено)
	|"+?(ОбратныйПорядок,"УПОРЯДОЧИТЬ ПО Дата УБЫВ","");	
	
	Возврат Текст;	
КонецФункции // ()

Функция ТекстЗапроса_РНК_ПНК(ОбратныйПорядок)
	Текст="
	|ВЫБРАТЬ "+?(ОбратныйПорядок,"ПЕРВЫЕ 1","")+"
	|	ДокОснование 					КАК Ссылка,
	|	ВЫРАЗИТЬ(ДокОснование 			КАК Документ.РасходнаяНакладная).Дата	КАК Дата,
	|   СкладПолучатель.Подразделение 	КАК Получатель,
	|	""РНК_ПНК""						КАК ВариантВыгрузки,
	|	Ссылка							КАК ДокОснование
	|ИЗ
	|	Документ.Перемещение
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Проведен
	|	И СостояниеНакладной	= ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена)	
	|	И "+ТекстФильтраПоФранчПодразделению("СкладПолучатель")+"
	|	И НЕ ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Номер ЕСТЬ NULL	
	|	И (ДокОснование=&ВыбДок ИЛИ &ВыбДок=Неопределено)
	|"+?(ОбратныйПорядок,"УПОРЯДОЧИТЬ ПО Дата УБЫВ","")+"
	|";	
	
	Возврат Текст;
КонецФункции //ТекстЗапроса_РНК_ПНК()

Функция ТекстЗапроса_Прайс(ОбратныйПорядок) Экспорт				
	Текст="	
	|ВЫБРАТЬ  "+?(ОбратныйПорядок,"ПЕРВЫЕ 1","")+" 
	|	Ссылка,
	|	Дата,
	|	ВТ_ТипыЦен.Подразделение	КАК Получатель,
	|	""""						КАК ВариантВыгрузки,
	|	Неопределено 				КАК ДокОснование
	|ИЗ
	|	Документ.ПрайсЛист КАК Прайс
	|ПРАВОЕ СОЕДИНЕНИЕ
	|(
	|ВЫБРАТЬ
	|	Ссылка 						КАК Подразделение,
	|	РозничныйТипЦен 			КАК ТипЦен,
	|	РозничныйТипЦен.Базовый		КАК ТипЦенБазовый,
	|	РозничныйТипЦенРаспродажа 	КАК ТипЦенРаспродажа,
	|	РозничныйТипЦенРаспродажа.Базовый,
	|	РозничныйТипСкидок 			КАК ТипСкидок,	
	|	
	|	Подразделения.ВидПодразделения КАК ВидПодразделения	
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	ВидПодразделения	= ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И (Ссылка	= &ПодразделениеТек ИЛИ &ПодразделениеТек	= ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	)
	|) КАК ВТ_ТипыЦен
	|ПО
	|	Прайс.ТипЦен		=  ВТ_ТипыЦен.ТипЦен
	|	ИЛИ Прайс.ТипЦен	=  ВТ_ТипыЦен.ТипЦенРаспродажа
	|	ИЛИ Прайс.ТипЦен	=  ВТ_ТипыЦен.ТипЦенБазовый
	|	ИЛИ Прайс.ТипЦен	= &ТипЦенЧЛ	 
	|ГДЕ
	|	Дата2 >= &Дата1
	|	И Проведен	
	|	И (Ссылка=&ВыбДок ИЛИ &ВыбДок=Неопределено)
	|"+?(ОбратныйПорядок,"УПОРЯДОЧИТЬ ПО Дата УБЫВ","")+"
	|";
	
	Возврат Текст;	
КонецФункции // ()

Функция ТекстФильтраПоФранчПодразделению(ИмяРеквизита)
	Возврат "
	|	("+ИмяРеквизита+".Подразделение = &ПодразделениеТек 
	|		ИЛИ (
	|			 &ПодразделениеТек=ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			 И 	"+ИмяРеквизита+".Подразделение.ВидПодразделения	= ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|		)
	|	)
	|";
КонецФункции // ()

Функция ПолучитьВыборкуДокументовКВыгрузке(Знач ВариантыВыгрузки,ОбратныйПорядок=Ложь) Экспорт
	МД				= Новый Массив;
	
	ТекстыЗапроса	= Новый Массив;	
	
	Запрос	= Новый ("Запрос");
	
	Если ТипЗнч(ВариантыВыгрузки)=Тип("Массив") Тогда
		МассивВариантов=ВариантыВыгрузки; 
	Иначе		
		МассивВариантов=СтрРазделить(ВариантыВыгрузки,",");
	КонецЕсли; 
	
	Для Каждого ВариантВыгрузки Из МассивВариантов Цикл
		Если ВариантВыгрузки="ВводОстатковТМЦ" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ВводОстатковТМЦ",,,,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ПРМ_ПНК" Тогда
			Фильтр	= "
			|	Склад.Подразделение = &ПодразделениеЦО
			|	И "+ТекстФильтраПоФранчПодразделению("СкладПолучатель")+"
			|	И ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Номер ЕСТЬ NULL
			|";
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("Перемещение",Фильтр,"СкладПолучатель.Подразделение","ПРМ_ПНК",ОбратныйПорядок));		
		ИначеЕсли ВариантВыгрузки="ПРМ_РНК" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("Перемещение","СкладПолучатель.Подразделение = &ПодразделениеЦО И Склад.Подразделение = &ПодразделениеТек","Склад.Подразделение","ПРМ_РНК",ОбратныйПорядок));	
		ИначеЕсли ВариантВыгрузки="ПРМ_ПРМ" Тогда			
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("Перемещение","СкладПолучатель.Подразделение = &ПодразделениеТек И Склад.Подразделение = &ПодразделениеТек","Склад.Подразделение","ПРМ_ПРМ",ОбратныйПорядок));	
		ИначеЕсли ВариантВыгрузки="РНК_ПНК" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_РНК_ПНК(ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="РНК_ПНК" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_РНК_ПНК(ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ПНК" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ПриходнаяНакладная","Склад.Подразделение=&ПодразделениеТек И КодОперации<>ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)",,,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ПНК_ВЗВ" Тогда
			Фильтра="
			|	Склад.Подразделение.ВидПодразделения	= ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
			|	И КодОперации							= ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)
			|	И Склад.Подразделение=&ПодразделениеТек ИЛИ &ПодразделениеТек=ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			|";
			
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ПриходнаяНакладная",Фильтр,,"ПНК_ВЗВ",ОбратныйПорядок));			
		ИначеЕсли ВариантВыгрузки="ОКС" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ОтчетКассовойСмены",,,,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ЧекККМ" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("Чек",,,,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ОПР" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ОприходованиеТМЦ",,,,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="СПН" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("СписаниеТМЦ",,,,ОбратныйПорядок));			
		ИначеЕсли ВариантВыгрузки="ИНВ" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("Инвентаризация",,,,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ПрайсЛист" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_Прайс(ОбратныйПорядок));					
			Запрос.УстановитьПараметр("ТипЦенЧЛ",ТипЦенЧЛ);			
		ИначеЕсли ВариантВыгрузки="УстановкаСкидок" Тогда			
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("УстановкаСкидок","ТипСкидок.Розничный=ИСТИНА","&ПодразделениеТек",,ОбратныйПорядок));	
		ИначеЕсли ВариантВыгрузки="ПС" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ПереводСредств","(Источник_Подразделение=&ПодразделениеТек ИЛИ Получатель_Подразделение=&ПодразделениеТек)","Получатель_Подразделение",,ОбратныйПорядок));			
		ИначеЕсли ВариантВыгрузки="РКО" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("РасходныйКассовыйОрдер","Подразделение=&ПодразделениеТек","Подразделение",,ОбратныйПорядок));
		ИначеЕсли ВариантВыгрузки="ПКО" Тогда
			ТекстыЗапроса.Добавить(ТекстЗапроса_СписокДоковПоВиду("ПриходныйКассовыйОрдер","Подразделение=&ПодразделениеТек","Подразделение",,ОбратныйПорядок));
		КонецЕсли;		
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("ПодразделениеТек",		ПодразделениеПолучатель);
	Запрос.УстановитьПараметр("ПодразделениеЦО",		ПодразделениеЦО);	
	
	Если ЗначениеЗаполнено(ВыбДок) Тогда
		Запрос.УстановитьПараметр("ВыбДок",ВыбДок);
	Иначе
		Запрос.УстановитьПараметр("ВыбДок",Неопределено);
	КонецЕсли; 
	
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Ссылка КАК ОбъектСсылка,
	|	Дата,
	|	Получатель,
	|	ВариантВыгрузки,
	|	ДокОснование	
	|ИЗ 
	|	("+СтрСоединить(ТекстыЗапроса," ОБЪЕДИНИТЬ "+Символы.ПС)+") 
	|КАК Сводный
	|УПОРЯДОЧИТЬ ПО Дата
	|";	
	
	Выборка	= Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка;
КонецФункции //ПолучитьВыборкуДокументовКВыгрузке() Экспорт


Функция НайтиХПС(ДокОснование)	
	Результат		= Документы.ХранилищеПодарочныхСертификатов.ПустаяСсылка();
	
	Запрос			= Новый Запрос;
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Запрос.Текст	= "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХПС.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Перемещение КАК Перемещение
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Документ.ХранилищеПодарочныхСертификатов КАК ХПС
		|ПО
		|	ХПС.ДокОБъект=Перемещение.Ссылка
		|ГДЕ
		|	Перемещение.ДокОснование = &ДокОснование	
		|	И НЕ ХПС.ПометкаУдаления
		|	И ХПС.ВерсияДанных<>""""	
		|";	
	Иначе
		Запрос.Текст	= "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Документ.ХранилищеПодарочныхСертификатов.Сертификаты
		|ГДЕ
		|	Ссылка.ДокОбъект = &ДокОснование	
		|	И НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.ВерсияДанных<>""""	
		|";	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат	= Выборка.Ссылка;							
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьХДС(ДокОснование)
 


Функция УстановитьСвойствоХДТО(ОбъектХДТО,Имя,Значение) //По чудо логике разработчиков 1С - неопределено присваивать НЕЛЬЗЯ !!! 
	Если НЕ (Значение=Неопределено ИЛИ Значение="") Тогда
		ОбъектХДТО[Имя]=Значение;	
	КонецЕсли;
КонецФункции //УстановитьСвойствоХДТО(ОбъектХДТО,Имя,Значение)

Функция ПолучитьВыборкуТЧДокумента(ДокСсылка,ИмяТЧ)
	ТипДокумента	= ТипЗнч(ДокСсылка);
	ТипЗнчСтрВнутр	= ЗначениеВСтрокуВнутр(ТипДокумента);
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	"+ФР_ОбщегоНазначения_ПИ.ИмяТипа(ТипЗнчСтрВнутр)+"."+ИмяТЧ+"
	|ГДЕ
	|	Ссылка=&Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка",ДокСсылка);
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции //ПолучитьВыборкуТЧДокумента(ДокСсылка,ИмяТЧ)

Функция ВыгрузитьДок_БлокировкаАкции(ДокВыборка)	
	ИмяТаблицы		= "Документ.БлокировкаАкции";	
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);	
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_БлокировкаАкции(ДокВыборка)

Функция ВыгрузитьДок_ВводОстатковТМЦ(ДокВыборка)
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,"Ссылка,Номер,Дата,Валюта,Курс,Склад,СуммаДокумента");	
		РеквизитыШапки.Вставить("Подразделение",ПолучитьРеквизитШапки(РеквизитыШапки.Склад,"Подразделение"));
	КонецЕсли;	
	
	
	ЮрЛицоФранча				= РегистрыСведений.ФР_ЮрЛицаПодразделений.ПолучитьЮрЛицо(РеквизитыШапки.Подразделение,РеквизитыШапки.Дата);
	
	ОбъектХДТО					= СоздатьОбъектХДТО("Документ.ОстаткиСобственныхТМЦ");	
	
	ОбъектХДТО.Дата			= РеквизитыШапки.Дата;	
	ОбъектХДТО.Организация	= ВыгрузитьСпр_Организации_КС(ЮрЛицоФранча);
	ОбъектХДТО.Склад		= ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШапки.Склад);
	
	ТоварыXDTO	= СоздатьОбъектХДТО("Документ.ОстаткиСобственныхТМЦ.ТМЦ");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл	
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		ПроцентНДС			= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);
		
		СтрокаXDTO			= СоздатьОбъектХДТО("Документ.ОстаткиСобственныхТМЦ.ТМЦ.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		СтрокаXDTO.ВидЗапасов			= "СобственныеТовары";		
		ТекЕдиница						= ?(ЗначениеЗаполнено(ВыборкаПоТЧ.Единица),ВыборкаПоТЧ.Единица,Ед_Штука);
		СтрокаXDTO.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(ТекЕдиница);		
		
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		
		СтрокаXDTO.СуммаБезНДС			= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.КоличествоУпаковок	= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);		
		
		Если ПроцентНДС<>0 Тогда	
			СтрокаXDTO.СуммаНДС          = Окр(ВыборкаПоТЧ.Всего*ПроцентНДС/(1+ПроцентНДС),2,1);
			СтрокаXDTO.СуммаБезНДС		 = СтрокаXDTO.СуммаБезНДС-СтрокаXDTO.СуммаНДС;
		КонецЕсли;		
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;		
		
		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ОбъектХДТО.ТМЦ				= ТоварыXDTO;
	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(РеквизитыШапки.Ссылка),"Ссылка","ДокументСсылка.ПоступлениеТоваровУслуг",ПространствоИмен_ЕД);
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(РеквизитыШапки.Номер),"Номер","string",ПространствоИмен_СТ);
	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕД,"Ответственный",ВыгрузитьСпр_Пользователи_Элемент_КС(РеквизитыШапки.Автор));	
	
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ЗПК_ЗПС(ДокВыборка)	
	ИмяТаблицы		= "Документ.Заказ";	
	ИмяТипаХДТО		= "Документ.ЗаказПоставщику";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекСклад				= ?(ЗначениеЗаполнено(ДокВыборка.СкладПолучатель_ДИ),ДокВыборка.СкладПолучатель_ДИ,ДокВыборка.СкладПолучатель);
	ТекОрганизация 			= ?(ЗначениеЗаполнено(ТекСклад),ПолучитьРеквизитШапки(ТекСклад,"Организация"),РеквизитыШ.Контрагент);	
	ТекПодразделение		= ДокВыборка.Подразделение;	
	
	Если НЕ ЗначениеЗаполнено(ТекПодразделение) Тогда
		ТекПодразделение	= ФранчПодразделениеСсылки(РеквизитыШ.ПунктДоставки);			
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ТекСклад) Тогда
		ТекСклад	= ПолучитьРеквизитШапки(ТекПодразделение,"ОсновнойСклад","Справочник");	
	КонецЕсли; 
	
	ОбъектХДТО					= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"Товары");
	
	//ОбъектХДТО.Ссылка			= РеквизитыШ.Ссылка;
	//
	//ОбъектХДТО.Дата				= РеквизитыШ.Дата;
	//ОбъектХДТО.Номер			= РеквизитыШ.Номер;				
	//
	//
	//ОбъектХДТО.Подразделение	= ТекПодразделение;		
	//ОбъектХДТО.Склад			= ТекСклад;
	//
	//ОбъектХДТО.Договор			= РеквизитыШ.Договор;	
	//
	//ОбъектХДТО.Валюта			= ДокВыборка.Валюта;
	//ОбъектХДТО.Курс				= ДокВыборка.Курс;
	//
	//ОбъектХДТО.КоличествоДокумента  = РеквизитыШ.КоличествоДокумента;
	//ОбъектХДТО.Комментарий			= РеквизитыШ.Комментарий;	
	//
	//ОбъектХДТО.МенеджерЦО			= РеквизитыШ.Менеджер;
	//ОбъектХДТО.Автор				= РеквизитыШ.Автор;
	
	ОбъектХДТО.Организация		= Справочники.Организации.ПолучитьСсылку(ТекОрганизация.УникальныйИдентификатор());
	ОбъектХДТО.Контрагент		= Справочники.Контрагенты.ПолучитьСсылку(РеквизитыШ.Организация.УникальныйИдентификатор());
	
	ТоварыXDTO					= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары",ПространствоИмен_ЕЕ);	
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Номенклатура = Null Тогда Продолжить КонецЕсли; 
		Если ВыборкаПоТЧ.Заявка=0 И ВыборкаПоТЧ.ПодтвержденнаяЗаявка=0 И ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;	
		
		СтрокаТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары.Строка",ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ,,"Единица");
		СтрокаТЧ_ХДТО.Единица	= Ед_Штука;		
		
		ПроцентНДС	= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);
		
		СтрокаТЧ_ХДТО.Всего			= ВыборкаПоТЧ.Всего;
		СтрокаТЧ_ХДТО.Цена			= Окр(?(ВыборкаПоТЧ.Количество=0,0,СтрокаТЧ_ХДТО.Всего/ВыборкаПоТЧ.Количество),2,1);
		//+HELP-2538 20250115 Михайловский
		//меняю
		//СтрокаТЧ_ХДТО.СуммаБезНДС	= СтрокаТЧ_ХДТО.Всего*ПроцентНДС/(1+ПроцентНДС);
		//СтрокаТЧ_ХДТО.НДС			= СтрокаТЧ_ХДТО.Всего-СтрокаТЧ_ХДТО.СуммаБезНДС;
		//нга
		СтрокаТЧ_ХДТО.НДС	= СтрокаТЧ_ХДТО.Всего * ПроцентНДС /(1 + ПроцентНДС);
		СтрокаТЧ_ХДТО.СуммаБезНДС			= СтрокаТЧ_ХДТО.Всего - СтрокаТЧ_ХДТО.НДС;
		//-HELP-2538 20250115 Михайловский
		ТоварыXDTO.Строка.Добавить(СтрокаТЧ_ХДТО);		
	КонецЦикла;
	
	ОбъектХДТО.Товары				= ТоварыXDTO;	
	
	СостСогласования	= ДокВыборка.СостояниеСогласования;
	Если ЗначениеЗаполнено(СостСогласования) Тогда	
		Если СостСогласования=Перечисления.СостоянияСогласования.Согласован Тогда		
			СостСоглПоставщик	= "Согласовано";
			СостСоглПокупатель	= "Согласовано";			
		ИначеЕсли СостСогласования	= Перечисления.СостоянияСогласования.НаСогласованииЦО Тогда		
			СостСоглПоставщик	= "НаСогласовании";
			СостСоглПокупатель	= "ВРаботе";
		ИначеЕсли ДокВыборка.СостояниеСогласования=Перечисления.СостоянияСогласования.НаСогласованииКонтрагент Тогда		
			СостСоглПоставщик	= "Согласовано";
			СостСоглПокупатель	= "НаСогласовании";			
		ИначеЕсли ДокВыборка.СостояниеСогласования=Перечисления.СостоянияСогласования.ОтмененЦО Тогда		
			СостСоглПоставщик	= "НеСогласовано";
			СостСоглПокупатель	= "ВРаботе";			
		ИначеЕсли ДокВыборка.СостояниеСогласования=Перечисления.СостоянияСогласования.ОтмененКонтрагент Тогда		
			СостСоглПоставщик	= "ВРаботе";
			СостСоглПокупатель	= "НеСогласовано";
		Иначе
			СостСоглПоставщик	= "ВРаботе";
			СостСоглПокупатель	= "ВРаботе";
		КонецЕсли;
		
		ОбъектХДТО.СостояниеСогласования_Поставщик		= СостСоглПоставщик;
		ОбъектХДТО.СостояниеСогласования_Покупатель_ЦО	= СостСоглПокупатель;		
	КонецЕсли;	
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_ЗПК_ЗПС

Функция ВыгрузитьДок_ЗНВПок(ДокВыборка)	
	ИмяТаблицы		= "Документ.ЗаявкаНаВозвратОтПокупателя";	
	ИмяТипаХДТО		= "Документ.ЗаявкаНаВозвратОтПокупателя";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекПодразделение		= РеквизитыШ.Подразделение;	
	ТекОрганизация 			= ОрганизацияПодразделения(ТекПодразделение);
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"Товары,СостояниеСогласования_Поставщик,СостояниеСогласования_Покупатель");
	
	ОбъектХДТО.Подразделение	= ТекПодразделение;		
	ОбъектХДТО.Организация		= Справочники.Организации.ПолучитьСсылку(ТекОрганизация.УникальныйИдентификатор());
	ОбъектХДТО.Контрагент		= Справочники.Контрагенты.ПолучитьСсылку(РеквизитыШ.Организация.УникальныйИдентификатор());		
	
	ОбъектХДТО.Склад			= РеквизитыШ.СкладПриемки;
	
	ОбъектХДТО.СостояниеСогласования_Покупатель	= ВыгрузитьПер_СостояниеСогласования(РеквизитыШ.СостояниеСогласования_Покупатель);
	ОбъектХДТО.СостояниеСогласования_Поставщик	= ВыгрузитьПер_СостояниеСогласования(РеквизитыШ.СостояниеСогласования_Поставщик);	
	
	ИмяТЧ	= "Товары";
	ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТипаХДТО+"."+ИмяТЧ);
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_ЗНВПок

Функция ВыгрузитьДок_ЗРК_АКТ(ДокВыборка)	
	ИмяТаблицы		= "Документ.ЗаявкаНаРекламацию";	
	ИмяТипаХДТО		= "Документ.АктОРасхождениях";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"Товары");
	
	ОбъектХДТО.Подразделение	= РеквизитыШ.ПодразделениеФР;
	ОбъектХДТО.Организация	    = ПолучитьОрганизациюКонтрагента(РеквизитыШ.КонтрагентФР);	
	
	Если РеквизитыШ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.ВРаботе Тогда
		ОбъектХДТО.Статус = "ВРаботе";
	ИначеЕсли РеквизитыШ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Отклонена Тогда		
		ОбъектХДТО.Статус = "Отклонен";
	ИначеЕсли РеквизитыШ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Принята Тогда		
		ОбъектХДТО.Статус = "Согласован";
	ИначеЕсли РеквизитыШ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена Тогда		
		ОбъектХДТО.Статус = "Согласован";
	ИначеЕсли РеквизитыШ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.ПринятаЧастично Тогда		
		ОбъектХДТО.Статус = "СогласованЧастично";	
	КонецЕсли; 
	
	ИмяТЧ	= "Товары";
	ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТипаХДТО+"."+ИмяТЧ);
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_ЗРК_АКТ

Функция ВыгрузитьДок_ИНВ_КС(РеквизитыШапки)
	
	КС_XDTO				= СоздатьОбъектХДТО("КлючевыеСвойстваИнвентаризацияТоваров");	
	
	КС_XDTO.Ссылка		= СериализаторXDTO.XMLСтрока(РеквизитыШапки.Ссылка);
	КС_XDTO.Дата		= РеквизитыШапки.Дата;
	КС_XDTO.Номер		= РеквизитыШапки.Номер; 
	КС_XDTO.Организация	= ВыгрузитьСпр_Организации_КС(РеквизитыШапки.Склад_Организация);
	
	Возврат КС_XDTO;
	
КонецФункции //ВыгрузитьДок_ИНВ_КС(ДокСсылка)

Функция ВыгрузитьДок_ИНВ(ДокВыборка)
	Если 1=2 Тогда
		ДокСсылка=Документы.Инвентаризация.ПустаяСсылка();	
	КонецЕсли;
	
	ВидДокумента	= "ИнвентаризацияТоваров";
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		ИменаРеквизитов	= РеквизитыШапок.Получить("Документ.Инвентаризация");			
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,ИменаРеквизитов);		
	КонецЕсли;
	
	МетаОбъект	= ДокСсылка.Метаданные();
	
	ОбъектХДТО						= СоздатьОбъектХДТО("Документ."+ВидДокумента);	
	
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьДок_ИНВ_КС(РеквизитыШапки);		
	// + HELP-2150 20241118 Михайловский
	//ОбъектХДТО.Ответственный	= ВыгрузитьСпр_Пользователи_Элемент_КС(ДокСсылка.Автор);
	Попытка
		ОбъектХДТО.Ответственный	= ВыгрузитьСпр_Пользователи_Элемент_КС(ДокСсылка.Автор);
	Исключение
	КонецПопытки;
	// - HELP-2150 20241118 Михайловский
	ОбъектХДТО.Подразделение	= ВыгрузитьСпр_Подразделения_Элемент_КС(ДокСсылка.Склад.Подразделение);	
	ОбъектХДТО.Склад			= ВыгрузитьСпр_Склады_Элемент_КС(ДокСсылка.Склад);
	Если ЗначениеЗаполнено(ДокСсылка.Комментарий) Тогда
		ОбъектХДТО.Комментарий		= ДокСсылка.Комментарий;	
	КонецЕсли;	
	
	ТоварыХДТО	= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары");	
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл	
		СтрокаХДТО						= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары.Строка");			
		
		СтрокаХДТО.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		СтрокаХДТО.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(ВыборкаПоТЧ.Единица);
		
		СтрокаХДТО.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаХДТО.КоличествоУчет		= ВыборкаПоТЧ.КоличествоРасч;
		
		СтрокаХДТО.Сумма				= ВыборкаПоТЧ.Цена*ВыборкаПоТЧ.КоличествоФакт;
		СтрокаХДТО.СуммаУчет			= ВыборкаПоТЧ.Цена*ВыборкаПоТЧ.КоличествоРасч;
		
		СтрокаХДТО.Цена					= ВыборкаПоТЧ.Цена;			
		СтрокаХДТО.ЦенаВРознице			= ВыборкаПоТЧ.Цена;
		СтрокаХДТО.ЦенаЗаУпаковку		= ВыборкаПоТЧ.Цена;			
		
		СтрокаХДТО.ТипЗапасов			= "СобственныеТовары";		
		
		ДобавитьЭлементХДТО(СтрокаХДТО,	ВыборкаПоТЧ.КоличествоФакт,	    "КоличествоФакт", 		"decimal", ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаХДТО,	ВыборкаПоТЧ.ЦенаОприходования,	"ЦенаОприходования",	"decimal", ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаХДТО,	ВыборкаПоТЧ.КоличествоОпр,		"КоличествоОпр", 	 	"decimal", ПространствоИмен_СТ);
		
		ТоварыХДТО.Строка.Добавить(СтрокаХДТО);		
	КонецЦикла;
		
	Если ТоварыХДТО.Строка.Количество()>0 Тогда
		ОбъектХДТО.Товары	= ТоварыХДТО;		
	КонецЕсли; 
	
	ДобавитьСостояниеНакладной(ОбъектХДТО, ДокСсылка.СостояниеНакладной);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,ДокСсылка.ГруппыТоваров,		"ГруппыТоваров",	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,ДокСсылка.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,ДокСсылка.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;	
КонецФункции

Функция ВыгрузитьДок_ОПР(ДокВыборка)
	ИмяТаблицы	= Метаданные.Документы.ОприходованиеТМЦ.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы;
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ДокСсылка	= ВхПараметр.Ссылка;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "Товары";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ);		
	
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты",ПространствоИмен_ЕЕ);	
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты.Строка",ПространствоИмен_ЕЕ);
			СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоТЧ.Сертификат;			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
		КонецЦикла;
		
		ОбъектХДТО.Сертификаты=ТЧ_ХДТО;		
	КонецЕсли;
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьДокумент_ОПР(ДокВыборка)

Функция ВыгрузитьДок_ОПР_КС(РеквизитыШапки)
	
	КС_XDTO				= СоздатьОбъектХДТО("КлючевыеСвойстваОприходованиеТоваров");	
	
	КС_XDTO.Ссылка		= СериализаторXDTO.XMLСтрока(РеквизитыШапки.Ссылка);
	КС_XDTO.Дата		= РеквизитыШапки.Дата;
	КС_XDTO.Номер		= РеквизитыШапки.Номер; 
	КС_XDTO.Организация	= ВыгрузитьСпр_Организации_КС(РеквизитыШапки.Организация);
	
	Возврат КС_XDTO;
	
КонецФункции //ВыгрузитьДокумент_КС_ОПР(ДокСсылка)

Функция ВыгрузитьДок_ОПР_ЕД(ДокВыборка)
	ВидДокумента= "ОприходованиеТоваров";
	
	Если 1=2 Тогда
		ДокСсылка=Документы.ОприходованиеТоваров.ПустаяСсылка();	
	КонецЕсли;	
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		ИменаРеквизитов	= РеквизитыШапок.Получить("Документ.ОприходованиеТМЦ");			
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,ИменаРеквизитов);		
	КонецЕсли;	
	
	ОбъектХДТО					= СоздатьОбъектХДТО("Документ."+ВидДокумента);	
	
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьДок_ОПР_КС(РеквизитыШапки);		
	
	УстановитьСвойствоХДТО(ОбъектХДТО,"Ответственный",ВыгрузитьСпр_Пользователи_Элемент_КС(РеквизитыШапки.Автор));
	ОбъектХДТО.Комментарий			= РеквизитыШапки.Комментарий;
	УстановитьСвойствоХДТО(ОбъектХДТО,"Подразделение",	ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШапки.Подразделение));
	УстановитьСвойствоХДТО(ОбъектХДТО,"Склад",			ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШапки.Склад));
	
	ТоварыХДТО	= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл	
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаXDTO			= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		СтрокаXDTO.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(ВыборкаПоТЧ.Единица);
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.Цена					= ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество;		
		
		СтрокаXDTO.ТипЗапасов			= "СобственныеТовары";
		
		ТоварыХДТО.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;	
	
	ОбъектХДТО.Товары	= ТоварыХДТО;
	
	ДобавитьСостояниеНакладной(ОбъектХДТО,ДокСсылка.СостояниеНакладной);
	
	ВалютаХДТО			= ВыгрузитьСпр_Валюты_КС(ДокВыборка.Валюта);
	ПодразделениеХДТО	= ВыгрузитьСпр_Подразделения_Элемент_КС(ДокВыборка.Подразделение);
	СтатьяЗатратХДТО	= ВыгрузитьСпр_СтатьиЗатрат_Элемент_КС(РеквизитыШапки.СтатьяЗатрат);
	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"Валюта",			ВалютаХДТО);	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"Подразделение",	ПодразделениеХДТО);	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"СтатьяЗатрат",	СтатьяЗатратХДТО);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.Курс,				"Курс",				"decimal",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.ГруппыТоваров,	"ГруппыТоваров",	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.Комментарий,		"Комментарий",		"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДокумент_ОПР(ДокВыборка)

Функция ВыгрузитьДок_ПКО(ДокВыборка)	
	ИмяТаблицы		= "Документ.ПриходныйКассовыйОрдер";	
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"ВидОперации");
	
	УстановитьСвойствоХДТО(ОбъектХДТО,"ВидОперации",XMLСтрока(РеквизитыШ.ВидОперации));
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_РКО(ДокВыборка)

Функция ВыгрузитьДок_ПНК_КС(ДокСсылка,ВидДокумента)
	КС_XDTO				= СоздатьОбъектХДТО("КлючевыеСвойства"+ВидДокумента);	
	
	КС_XDTO.Ссылка		= СериализаторXDTO.XMLСтрока(ДокСсылка);
	КС_XDTO.Дата		= ДокСсылка.Дата;
	КС_XDTO.Номер		= ДокСсылка.Номер; 
	КС_XDTO.Организация	= ВыгрузитьСпр_Организации_КС(ДокСсылка.Организация);
	КС_XDTO.Контрагент	= ВыгрузитьСпр_Контрагенты_Элемент_КС(ПоставщикДляПеремещений);
	
	Возврат КС_XDTO;
КонецФункции //Выгрузить_КС_ПНК(ДокСсылка,ВидДокумента)

Функция ВыгрузитьДок_ПНК(ДокСсылка)
	Если 1=2 Тогда
		ДокСсылка=Документы.ПриходнаяНакладная.ПустаяСсылка();	
	КонецЕсли;
	
	ВидДокумента="ПоступлениеТоваровУслуг";
	
	МетаОбъект	= ДокСсылка.Метаданные();	
	
	ОбъектХДТО						= СоздатьОбъектХДТО("Документ."+ВидДокумента);
	
	ОбъектХДТО.КлючевыеСвойства		= ВыгрузитьДок_ПНК_КС(ДокСсылка,ВидДокумента);		
	
	ТоварыXDTO						= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары");
	
	Товары	= ПолучитьВыборкуТЧ(ДокСсылка);
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаXDTO			= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(СтрокаТЧ.ДанныеНоменклатуры);
		СтрокаXDTO.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(СтрокаТЧ.ДанныеОКЕИ);
		СтрокаXDTO.Количество			= СтрокаТЧ.Количество;
		СтрокаXDTO.Сумма				= СтрокаТЧ.Всего;
		СтрокаXDTO.Цена					= Окр(СтрокаТЧ.Всего/СтрокаТЧ.Количество,2,1);
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(СтрокаТЧ.СтавкаНДС);
		СтрокаXDTO.СуммаНДС				= СтрокаТЧ.НДС;
		
		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ОбъектХДТО.Товары				= ТоварыXDTO;
	
	ОбъектХДТО.Валюта				= ВыгрузитьСпр_Валюты_КС(ДокСсылка.Валюта);
	ОбъектХДТО.ВидОперации			= "ПокупкаУПоставщика";
	ОбъектХДТО.Сумма				= ДокСсылка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС		= СериализаторXDTO.XMLСтрока(Истина);
	ОбъектХДТО.Подразделение		= ВыгрузитьСпр_Подразделения_Элемент_КС(ДокСсылка.Подразделение);	
	
	ОбъектХДТО.Склад				= ВыгрузитьСпр_Склады_Элемент_КС(ДокСсылка.Склад);
	ОбъектХДТО.ДанныеВзаиморасчетов	= Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(ДокСсылка.Валюта);
	
	ДобавитьСостояниеНакладной(ОбъектХДТО,ДокСсылка.СостояниеНакладной);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,ДокСсылка.Проведен,			"Проведен",			"boolean",ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,ДокСсылка.ПометкаУдаления,	"ПометкаУдаления",	"boolean",ПространствоИмен_СТ);
		
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ПНК_ВЗВ(ДокВыборка)
	Если 1=2 Тогда
		ДокСсылка=Документы.ПриходнаяНакладная.ПустаяСсылка();	
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		РеквизитыШапки	= РеквизитыШапок.Получить("Документ.ПриходнаяНакладная");	
	КонецЕсли;	
	
	ОбъектХДТО				= СоздатьОбъектХДТО("Документ.ВозвратТоваровОтПокупателя");
	КлючевыеСвойстваXDTO	= СоздатьОбъектХДТО("КлючевыеСвойстваВозвратТоваровОтПокупателя");	
	
	КлючевыеСвойстваXDTO.Ссылка			= СериализаторXDTO.XMLСтрока(РеквизитыШапки.Ссылка);
	КлючевыеСвойстваXDTO.Дата			= РеквизитыШапки.Дата;
	КлючевыеСвойстваXDTO.Номер			= РеквизитыШапки.Номер; 
	КлючевыеСвойстваXDTO.Организация	= ВыгрузитьСпр_Организации_КС(РеквизитыШапки.Организация);	
	
	ОбъектХДТО.КлючевыеСвойства			= КлючевыеСвойстваXDTO;		
	ОбъектХДТО.ВидОперации				= "ВозвратОтРозничногоПокупателя";	
		
	ОбъектХДТО.Валюта					= ВыгрузитьСпр_Валюты_КС(РеквизитыШапки.Валюта);
	ОбъектХДТО.Сумма					= ДокСсылка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС		= СериализаторXDTO.XMLСтрока(Истина);
	ОбъектХДТО.Подразделение			= ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШапки.Подразделение);
	ОбъектХДТО.Склад					= ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШапки.Склад);
	ОбъектХДТО.Контрагент				= ВыгрузитьСпр_Контрагенты_Элемент_КС(РеквизитыШапки.Контрагент);
	ОбъектХДТО.ДанныеВзаиморасчетов	= Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(РеквизитыШапки.Валюта);
	
	Если ЗначениеЗаполнено(РеквизитыШапки.ДокОснование) И ТипЗнч(РеквизитыШапки.ДокОснование)=Тип("ДокументСсылка.Чек") Тогда
		ОКС=НайтиОКСпоЧеку(РеквизитыШапки.ДокОснование);			
		Если ЗначениеЗаполнено(ОКС) Тогда		
			ДокументРеализацииОТ 								= ОбъектХДТО.Свойства().Получить("ДокументРеализации");			
			
    		ДокументРеализацииXDTO 								= Фабрика.Создать(ДокументРеализацииОТ.Тип);
			ДокументРеализацииXDTO.ОтчетОРозничныхПродажахСсылка= ВыгрузитьДок_ОКС_КС(ОКС);			
    		
    		ОбъектХДТО.ДокументРеализации 						= ДокументРеализацииXDTO;			
		КонецЕсли; 
	КонецЕсли; 
	
	ТоварыXDTO	= СоздатьОбъектХДТО("Документ.ВозвратТоваровОтПокупателя.Товары");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаXDTO						= СоздатьОбъектХДТО("Документ.ВозвратТоваровОтПокупателя.Товары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		СтрокаXDTO.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(Ед_Штука);
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.Цена					= ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество;
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);
		СтрокаXDTO.СуммаНДС				= ВыборкаПоТЧ.НДС;
		СтрокаXDTO.ВозвратПодДеятельность = "ОблагаетсяНДС";		
		
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.Количество,"Заявка","decimal",ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.Количество,"ПодтвержденнаяЗаявка","decimal",ПространствоИмен_СТ);
		
		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;	
	
	КодОперацииXDTO	= СоздатьЗначениеХДТО("КодыОперацийОстатки","ВозвратОтПокупателя",ПространствоИмен_ЕЕ);	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"КодОперации",КодОперацииXDTO);
	
	ДобавитьСостояниеНакладной(ОбъектХДТО,ДокСсылка.СостояниеНакладной);			
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.Проведен,			"Проведен",			"boolean",ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.ПометкаУдаления,	"ПометкаУдаления",	"boolean",ПространствоИмен_СТ);
		
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ПРМ_ПНК_ЕЕ(ДокВыборка)	
	ИмяТаблицы		= "Документ.Перемещение";	
	ИмяТипаХДТО		= "Документ.ПриходнаяНакладная";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекСклад				= ?(ЗначениеЗаполнено(ДокВыборка.СкладПолучатель_ДИ),ДокВыборка.СкладПолучатель_ДИ,ДокВыборка.СкладПолучатель);
	ТекОрганизация 			= ?(ЗначениеЗаполнено(ТекСклад),ПолучитьРеквизитШапки(ТекСклад,"Организация"),РеквизитыШ.Контрагент);	
	ТекПодразделение		= ?(ЗначениеЗаполнено(ДокВыборка.ПодразделениеПолучатель_ДИ),ДокВыборка.ПодразделениеПолучатель_ДИ,ДокВыборка.Подразделение);	
	
	Если НЕ ЗначениеЗаполнено(ТекПодразделение) Тогда
		ТекПодразделение	= ФранчПодразделениеСсылки(РеквизитыШ.ПунктДоставки);			
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ТекСклад) Тогда
		ТекСклад	= ПолучитьРеквизитШапки(ТекПодразделение,"ОсновнойСклад","Справочник");	
	КонецЕсли; 
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ОбъектХДТО.Ссылка		= РеквизитыШ.Ссылка;
	
	ОбъектХДТО.Дата							= РеквизитыШ.Дата;
	ОбъектХДТО.Номер						= РеквизитыШ.Номер;	
	ОбъектХДТО.ДатаВходящегоДокумента		= РеквизитыШ.Дата;
	ОбъектХДТО.НомерВходящегоДокумента		= РеквизитыШ.Номер;	
	ОбъектХДТО.ВидВходящегоДокумента		= "ПРМ";
	ОбъектХДТО.СостояниеНакладнойУПоставщика = РеквизитыШ.СостояниеНакладной;	
	
	ОбъектХДТО.Организация		= Справочники.Организации.ПолучитьСсылку(ТекОрганизация.УникальныйИдентификатор());
	ОбъектХДТО.Подразделение	= ТекПодразделение;		
	ОбъектХДТО.Склад			= ТекСклад;		
	
	Если ЗначениеЗаполнено(РеквизитыШ.Контрагент) Тогда	
		ОбъектХДТО.Контрагент	= РеквизитыШ.Контрагент;	
	Иначе		
		ОбъектХДТО.Контрагент	= Справочники.Контрагенты.ПолучитьСсылку(РеквизитыШ.Организация.УникальныйИдентификатор());
	КонецЕсли; 
	
	//ОбъектХДТО.Договор		= РеквизитыШ.Договор;	
	
	ОбъектХДТО.Валюта		= ДокВыборка.Валюта;
	ОбъектХДТО.Курс			= ДокВыборка.Курс;
	
	ОбъектХДТО.Комментарий	= РеквизитыШ.Комментарий;	
	
	ОбъектХДТО.Менеджер		= РеквизитыШ.Менеджер;
	ОбъектХДТО.Автор		= РеквизитыШ.Автор;
	
	СуммаДокумента			= 0;
	ТоварыXDTO				= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары",ПространствоИмен_ЕЕ);	
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;	
		
		СтрокаТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары.Строка",ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ,,"Единица");
		СтрокаТЧ_ХДТО.Единица	= Ед_Штука;
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;
		
		
		ПроцентНДС	= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);
		
		СтрокаТЧ_ХДТО.Цена			= Окр(?(ВыборкаПоТЧ.Количество=0,0,ВыборкаПоТЧ.Себестоимость/ВыборкаПоТЧ.Количество),2,1);		
		СтрокаТЧ_ХДТО.Всего			= ВыборкаПоТЧ.Себестоимость;
		//+HELP-2538 20250115 Михайловский
		//меняю
		//СтрокаТЧ_ХДТО.СуммаБезНДС	= ВыборкаПоТЧ.Себестоимость*ПроцентНДС/(1+ПроцентНДС);
		//СтрокаТЧ_ХДТО.НДС			= СтрокаТЧ_ХДТО.Всего-СтрокаТЧ_ХДТО.СуммаБезНДС;
		
		СтрокаТЧ_ХДТО.НДС	= ВыборкаПоТЧ.Себестоимость * ПроцентНДС /(1 + ПроцентНДС);
		СтрокаТЧ_ХДТО.СуммаБезНДС			= СтрокаТЧ_ХДТО.Всего - СтрокаТЧ_ХДТО.НДС;
		//-HELP-2538 20250115 Михайловский
		СуммаДокумента	= СуммаДокумента+ВыборкаПоТЧ.Себестоимость;
		
		ТоварыXDTO.Строка.Добавить(СтрокаТЧ_ХДТО);		
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;	
	
	ОбъектХДТО.КодОперации				= Перечисления.КодыОперацийОстатки.Закупка;
	ОбъектХДТО.Сумма					= ДокВыборка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС			= СериализаторXDTO.XMLСтрока(Истина);	
	
	ОбъектХДТО.СуммаДокумента			= СуммаДокумента;	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты",ПространствоИмен_ЕЕ);	
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты.Строка",ПространствоИмен_ЕЕ);
			СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоТЧ.Сертификат;			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
		КонецЦикла;
		
		ОбъектХДТО.Сертификаты=ТЧ_ХДТО;		
	КонецЕсли; 
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_РНК_ПНК_ЕЕ

Функция ВыгрузитьДок_ПРМ_ПНК_ЕД(ДокВыборка)
	ИмяТаблицы		= "Документ.Перемещение";
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"ПРМ_ПНК");	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	//ЮрЛицоФранча	= РегистрыСведений.ФР_ЮрЛицаПодразделений.ПолучитьЮрЛицо(РеквизитыШапки.Подразделение,РеквизитыШапки.Дата);
	
	ОбъектХДТО						= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг");
	КС_XDTO							= СоздатьОбъектХДТО("КлючевыеСвойстваПоступлениеТоваровУслуг");	
	
	КС_XDTO.Ссылка					= СериализаторXDTO.XMLСтрока(РеквизитыШ.Ссылка);
	КС_XDTO.Дата					= РеквизитыШ.Дата;
	КС_XDTO.Номер					= РеквизитыШ.Номер;	
	
	КС_XDTO.Организация	= ВыгрузитьСпр_Организации_КС(РеквизитыШ.СкладПолучатель_Организация);
	КС_XDTO.Контрагент	= ВыгрузитьСпр_Контрагенты_Элемент_КС(РеквизитыШ.Контрагент);
	
	ОбъектХДТО.КлючевыеСвойства		= КС_XDTO;	
	
	СуммаДокумента	=0; 
	
	ТоварыXDTO	= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг.Товары");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл	
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		ПроцентНДС			= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);
		
		СтрокаХДТО			= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг.Товары.Строка");
		
		СтрокаХДТО.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		
		ТекЕдиница						= ?(ЗначениеЗаполнено(ВыборкаПоТЧ.Единица),ВыборкаПоТЧ.Единица,Ед_Штука);
		СтрокаХДТО.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(ТекЕдиница);		
		
		СтрокаХДТО.Количество			= ВыборкаПоТЧ.Количество;
		
		СтрокаХДТО.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаХДТО.Цена					= ВыборкаПоТЧ.Цена;
		СтрокаХДТО.ЦенаЗаУпаковку		= Окр(ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество,2,1);
		СтрокаХДТО.КоличествоУпаковок	= ВыборкаПоТЧ.Количество;
		СтрокаХДТО.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);
		СтрокаХДТО.СуммаНДС				= ВыборкаПоТЧ.НДС;
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;		
		
		ДобавитьЭлементХДТО(СтрокаХДТО,ВыборкаПоТЧ.Заявка,				"Заявка",				"decimal",ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаХДТО,ВыборкаПоТЧ.ПодтвержденнаяЗаявка,"ПодтвержденнаяЗаявка",	"decimal",ПространствоИмен_СТ);
		
		ТоварыXDTO.Строка.Добавить(СтрокаХДТО);		
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;
	
	ОбъектХДТО.Валюта					= ВыгрузитьСпр_Валюты_КС(РеквизитыШ.Валюта);
	ОбъектХДТО.ВидОперации				= "ПокупкаУПоставщика";
	ОбъектХДТО.Сумма					= ДокВыборка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС			= СериализаторXDTO.XMLСтрока(Истина);
	ОбъектХДТО.Подразделение			= ВыгрузитьСпр_Подразделения_Элемент_КС(ДокВыборка.Подразделение);
	ОбъектХДТО.Склад					= ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШ.СкладПолучатель);
	ОбъектХДТО.ДанныеВзаиморасчетов		= Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(РеквизитыШ.Валюта);	
	
	КодОперацииXDTO	= Фабрика.Создать(Фабрика.Тип(ПространствоИмен_ЕЕ,"КодыОперацийОстатки"),"Закупка");	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"КодОперации",КодОперацииXDTO);	
		
	ДобавитьСостояниеНакладной(ОбъектХДТО,РеквизитыШ.СостояниеНакладной,"УПоставщика");
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ГруппыТоваров,	"ГруппыТоваров",	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Комментарий,		"Комментарий",		"string",	ПространствоИмен_СТ);
	ДобавитьСвойствоХДТО(ОбъектХДТО,ВыгрузитьСпр_Пользователи_Элемент_КС(РеквизитыШ.Автор),"Автор",	ПространствоИмен_ЕД);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
		
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ПРМ_ПРМ_ЕД(ДокСсылка)
	Если 1=2 Тогда
		ДокСсылка=Документы.Перемещение.ПустаяСсылка();	
	КонецЕсли;
	
	МетаОбъект	= ДокСсылка.Метаданные();
	
	ВидДокумента="ПеремещениеТоваров";		
	
	ЭлементXDTO				= СоздатьОбъектХДТО("Документ."+ВидДокумента);
	КлючевыеСвойстваXDTO	= СоздатьОбъектХДТО("КлючевыеСвойства"+ВидДокумента);	
	
	КлючевыеСвойстваXDTO.Ссылка			= СериализаторXDTO.XMLСтрока(ДокСсылка);
	КлючевыеСвойстваXDTO.Дата			= ДокСсылка.Дата;
	КлючевыеСвойстваXDTO.Номер			= ДокСсылка.Номер; 
	КлючевыеСвойстваXDTO.Организация	= ВыгрузитьСпр_Организации_КС(ДокСсылка.Организация);	
	
	ЭлементXDTO.КлючевыеСвойства		= КлючевыеСвойстваXDTO;	
	
	ЭлементXDTO.Комментарий				= ДокСсылка.Комментарий;
	
	ЭлементXDTO.СкладОтправитель		= ВыгрузитьСпр_Склады_Элемент_КС(ДокСсылка.Склад);
	ЭлементXDTO.СкладПолучатель			= ВыгрузитьСпр_Склады_Элемент_КС(ДокСсылка.СкладПолучатель);
	Товары		= ПолучитьВыборкуТЧ(ДокСсылка);
	ТоварыXDTO	= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары");
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		ПроцентНДС			= ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
		
		СтрокаXDTO			= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(СтрокаТЧ.ДанныеНоменклатуры);
		ЕдиницаИзмерения				= ВыгрузитьСпр_Единицы_Элемент_КС(СтрокаТЧ.ДанныеОКЕИ);
		Если ЕдиницаИзмерения<>Неопределено Тогда
			СтрокаXDTO.ЕдиницаИзмерения	= ЕдиницаИзмерения;		
		Иначе
			Сообщить_("Ай ай ! "+ДокСсылка+" "+СтрокаТЧ.Количество,СтатусСообщения.Важное);
			СтрокаXDTO.ЕдиницаИзмерения	= ВыгрузитьСпр_Единицы_Элемент_КС(ДанныеШтуки);
		КонецЕсли;
		
		СтрокаXDTO.Количество			= СтрокаТЧ.Количество;
		СтрокаXDTO.КоличествоУпаковок	= СтрокаТЧ.Количество;		
		
		СтрокаXDTO.ТипЗапасов			= "СобственныеТовары";
		
		СтрокаXDTO.ЦенаВРознице			= Окр(СтрокаТЧ.Цена,2,1);		
		СтрокаXDTO.СуммаВРознице		= СтрокаТЧ.Цена*СтрокаТЧ.Количество;
		СтрокаXDTO.СтавкаНДСВРознице	= ВыгрузитьПер_СтавкаНДС(СтрокаТЧ.СтавкаНДС);
		
		//СтрокаXDTO.Цена					= Окр(СтрокаXDTO.Сумма/СтрокаТЧ.Количество,2,1);		
		//СтрокаXDTO.СуммаНДС				= Окр(СтрокаXDTO.Сумма*ПроцентНДС/(100+ПроцентНДС),2,1);
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;
		
		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ЭлементXDTO.Товары					= ТоварыXDTO;	

	//+ HELP-1519 20241015 Михайловский
	//ДобавитьСостояниеНакладной(ЭлементXDTO,ДокСсылка.СостояниеНакладной);	
	//ДобавитьСостояниеНакладной(ЭлементXDTO,ДокСсылка.СостояниеНакладнойУПолучателя,"УПолучателя");
	ДобавитьСостояниеНакладной(ЭлементXDTO,XMLСтрока(ДокСсылка.СостояниеНакладной));	
	ДобавитьСостояниеНакладной(ЭлементXDTO,XMLСтрока(ДокСсылка.СостояниеНакладнойУПолучателя),"УПолучателя");
	//- HELP-1519 20241015 Михайловский
		
	Возврат ЭлементXDTO;
КонецФункции

Функция ВыгрузитьДок_ПРМ_ПРМ_ЕЕ(ДокВыборка)	
	ИмяТаблицы		= "Документ.Перемещение";	
	ИмяТипаХДТО		= "Документ.Перемещение";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка		= ВхПараметр.Ссылка;
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	ИменаТЧ			= "Товары";
	//+ HELP-1519 20241015 Михайловский
	//ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ+",СостояниеНакладной,СостояниеНакладнойУПолучателя");
	ОбъектХДТО.СостояниеНакладной				= XMLСтрока(ДокСсылка.СостояниеНакладной);
	ОбъектХДТО.СостояниеНакладнойУПолучателя	= XMLСтрока(ДокСсылка.СостояниеНакладнойУПолучателя);
	//- HELP-1519 20241015 Михайловский
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты",ПространствоИмен_ЕЕ);	
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты.Строка",ПространствоИмен_ЕЕ);
			СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоТЧ.Сертификат;			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
		КонецЦикла;
		
		ОбъектХДТО.Сертификаты=ТЧ_ХДТО;		
	КонецЕсли;
			
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_ПРМ_ПРМ_ЕЕ

Функция ВыгрузитьДок_ПРМ_РНК_ЕД(ДокВыборка)
	Если 1=2 Тогда
		ДокСсылка=Документы.Перемещение.ПустаяСсылка();	
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		РеквизитыШапки	= РеквизитыШапок.Получить("Документ.Перемещение_ПРМ_РНК");	
	КонецЕсли;
	
	ВидДокумента	= "РеализацияТоваровУслуг";
	
	ЭлементXDTO				= СоздатьОбъектХДТО("Документ."+ВидДокумента);
	КлючевыеСвойстваXDTO	= СоздатьОбъектХДТО("КлючевыеСвойства"+ВидДокумента);	
	
	КлючевыеСвойстваXDTO.Ссылка			= СериализаторXDTO.XMLСтрока(РеквизитыШапки.Ссылка);
	КлючевыеСвойстваXDTO.Дата			= РеквизитыШапки.Дата;
	КлючевыеСвойстваXDTO.Номер			= РеквизитыШапки.Номер; 
	КлючевыеСвойстваXDTO.Организация	= ВыгрузитьСпр_Организации_КС(РеквизитыШапки.Контрагент);	
	
	ЭлементXDTO.КлючевыеСвойства		= КлючевыеСвойстваXDTO;	
	
	ЭлементXDTO.ВидОперации				= "РеализацияКлиенту";
	ЭлементXDTO.Валюта					= ВыгрузитьСпр_Валюты_КС(РеквизитыШапки.Валюта);
	ЭлементXDTO.Сумма					= РеквизитыШапки.СуммаДокумента;	
	ЭлементXDTO.Склад					= ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШапки.Склад);
	ЭлементXDTO.Контрагент				= ВыгрузитьСпр_Контрагенты_Элемент_КС(РеквизитыШапки.Организация);
	ЭлементXDTO.ДанныеВзаиморасчетов	= Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(РеквизитыШапки.Валюта);
		
	СтрокаТЧ		= ПолучитьВыборкуТЧ(ДокВыборка.Ссылка);
	ТоварыXDTO		= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары");
	Пока СтрокаТЧ.Следующий() Цикл	
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		ПроцентНДС			= ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
		
		СтрокаXDTO			= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(СтрокаТЧ.Номенклатура,СтрокаТЧ.Характеристика);		
		СтрокаXDTO.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(Ед_Штука);
		
		СтрокаXDTO.Количество			= СтрокаТЧ.Количество;
		
		Сумма							= СтрокаТЧ.Себестоимость;
		
		СтрокаXDTO.Сумма				= Сумма;
		СтрокаXDTO.Цена					= Окр(Сумма/СтрокаТЧ.Количество,2,1);
		СтрокаXDTO.ЦенаЗаУпаковку		= Окр(Сумма/СтрокаТЧ.Количество,2,1);
		СтрокаXDTO.КоличествоУпаковок	= СтрокаТЧ.Количество;
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(СтрокаТЧ.СтавкаНДС);
		СтрокаXDTO.СуммаНДС				= Окр(Сумма*ПроцентНДС/(100+ПроцентНДС),2,1);
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;
		
		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ЭлементXDTO.Товары	= ТоварыXDTO;		
	
	ДобавитьСостояниеНакладной(ЭлементXDTO,РеквизитыШапки.СостояниеНакладной);
	ДобавитьЭлементХДТО(ЭлементXDTO,РеквизитыШапки.Проведен,		"Проведен",			"boolean",ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ЭлементXDTO,РеквизитыШапки.ПометкаУдаления, "ПометкаУдаления",	"boolean",ПространствоИмен_СТ);
	
	Возврат ЭлементXDTO;
КонецФункции

Функция ВыгрузитьДок_ПРМ_РНК_ЕЕ(ДокВыборка)	
	ИмяТаблицы		= "Документ.Перемещение";	
	ИмяТипаХДТО		= "Документ.РасходнаяНакладная";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекСклад				= РеквизитыШ.Склад;
	ТекОрганизация 			= ?(ЗначениеЗаполнено(ТекСклад),ПолучитьРеквизитШапки(ТекСклад,"Организация"),РеквизитыШ.Контрагент);
	ТекПодразделение		= ДокВыборка.Склад_Подразделение;	
	
	Если НЕ ЗначениеЗаполнено(ТекПодразделение) Тогда
		ТекПодразделение	= ПолучитьРеквизитШапки(ТекСклад,"Подразделение");;			
	КонецЕсли;	
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ОбъектХДТО.Ссылка		= РеквизитыШ.Ссылка;
	
	ОбъектХДТО.Дата							= РеквизитыШ.Дата;
	ОбъектХДТО.Номер						= РеквизитыШ.Номер;	
	ОбъектХДТО.ДатаВходящегоДокумента		= РеквизитыШ.Дата;
	ОбъектХДТО.НомерВходящегоДокумента		= РеквизитыШ.Номер;	
	ОбъектХДТО.ВидВходящегоДокумента		= "ПРМ";
	ОбъектХДТО.СостояниеНакладной			= РеквизитыШ.СостояниеНакладной;	
	
	ОбъектХДТО.Организация		= Справочники.Организации.ПолучитьСсылку(ТекОрганизация.УникальныйИдентификатор());
	ОбъектХДТО.Подразделение	= ТекПодразделение;		
	ОбъектХДТО.Склад			= ТекСклад;		
	
	ОбъектХДТО.Контрагент		= Справочники.Контрагенты.ПолучитьСсылку(РеквизитыШ.СкладПолучатель_Организация.УникальныйИдентификатор());	
	//ОбъектХДТО.Договор		= РеквизитыШ.Договор;	
	
	ОбъектХДТО.Валюта		= ДокВыборка.Валюта;
	ОбъектХДТО.Курс			= ДокВыборка.Курс;
	
	ОбъектХДТО.Комментарий	= РеквизитыШ.Комментарий;	
	
	ОбъектХДТО.Менеджер		= РеквизитыШ.Автор_ФизЛицо;
	ОбъектХДТО.Автор		= РеквизитыШ.Автор;
	
	СуммаДокумента			= 0;
	ТоварыXDTO				= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары",ПространствоИмен_ЕЕ);	
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;	
		
		СтрокаТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары.Строка",ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ,,"Единица");
		СтрокаТЧ_ХДТО.Единица	= Ед_Штука;
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;
		
		
		ПроцентНДС	= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);
		
		СтрокаТЧ_ХДТО.Цена			= Окр(?(ВыборкаПоТЧ.Количество=0,0,ВыборкаПоТЧ.Себестоимость/ВыборкаПоТЧ.Количество),2,1);		
		СтрокаТЧ_ХДТО.Всего			= ВыборкаПоТЧ.Себестоимость;
		//+HELP-2538 20250115 Михайловский
		//меняю
		//СтрокаТЧ_ХДТО.СуммаБезНДС	= ВыборкаПоТЧ.Себестоимость*ПроцентНДС/(1+ПроцентНДС);
		//СтрокаТЧ_ХДТО.НДС			= СтрокаТЧ_ХДТО.Всего-СтрокаТЧ_ХДТО.СуммаБезНДС;
		СтрокаТЧ_ХДТО.НДС = ВыборкаПоТЧ.Себестоимость * ПроцентНДС/(1 + ПроцентНДС);
		СтрокаТЧ_ХДТО.СуммаБезНДС			= СтрокаТЧ_ХДТО.Всего - СтрокаТЧ_ХДТО.НДС;
		//-HELP-2538 20250115 Михайловский
		СуммаДокумента	= СуммаДокумента+ВыборкаПоТЧ.Себестоимость;
		
		ТоварыXDTO.Строка.Добавить(СтрокаТЧ_ХДТО);		
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;	
	
	ОбъектХДТО.КодОперации				= Перечисления.КодыОперацийОстатки.ВозвратПоставщику;
	ОбъектХДТО.Сумма					= ДокВыборка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС			= СериализаторXDTO.XMLСтрока(Истина);	
	
	ОбъектХДТО.СуммаДокумента			= СуммаДокумента;	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".ПодарочныеСертификаты",ПространствоИмен_ЕЕ);	
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".ПодарочныеСертификаты.Строка",ПространствоИмен_ЕЕ);
			СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоТЧ.Сертификат;			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
		КонецЦикла;
		
		ОбъектХДТО.ПодарочныеСертификаты=ТЧ_ХДТО;		
	КонецЕсли; 
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_ПРМ_РНК_ЕЕ

Функция ВыгрузитьДок_ПС_КС(ДокВыборка)
	ИмяТаблицы	= "Документ.ПереводСредств";
	ИмяТипаХДТО	= "Документ.ПеремещениеДС.КС";
	
	Если 1=2 Тогда
		ДокСсылка=Документы.ПереводСредств.ПустаяСсылка();	
	КонецЕсли;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"КС");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО	= ПолучитьИзКэша(РеквизитыШ.Ссылка,ИмяТаблицы);
	Если ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда
		ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
		
		ОбъектХДТО.Ссылка	= РеквизитыШ.Ссылка;
		ОбъектХДТО.Номер	= РеквизитыШ.Номер;
		ОбъектХДТО.Дата		= РеквизитыШ.Дата;
		
		ВставитьВКэш(ДокСсылка,ОбъектХДТО,ИмяТаблицы);		
	КонецЕсли; 
	
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_ПС_КС(ДокВыборка)

Функция ВыгрузитьДок_ПС(ДокВыборка)
	ИмяТаблицы	= "Документ.ПереводСредств";
	ИмяТипаХДТО	= "Документ.ПеремещениеДенежныхСредств";
	
	Если 1=2 Тогда
		ДокСсылка=Документы.ПереводСредств.ПустаяСсылка();	
	КонецЕсли;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;	
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО							= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ОбъектХДТО.Ссылка					= РеквизитыШ.Ссылка;		
	ОбъектХДТО.Дата						= РеквизитыШ.Дата;		
	ОбъектХДТО.Номер					= РеквизитыШ.Номер;
	ОбъектХДТО.Автор					= РеквизитыШ.Автор;
	ОбъектХДТО.Организация				= РеквизитыШ.Организация;	
	ОбъектХДТО.СтатьяДДС				= РеквизитыШ.СтатьяДДС;
	
	ОбъектХДТО.СуммаДокумента			= РеквизитыШ.СуммаДокумента;
	ОбъектХДТО.Валюта					= РеквизитыШ.Валюта;
	ОбъектХДТО.Курс						= РеквизитыШ.Курс;
	
	ОбъектХДТО.Источник_Подразделение	= РеквизитыШ.Источник_Подразделение;
	ОбъектХДТО.Источник_Касса			= РеквизитыШ.Источник_Касса;
	
	ОбъектХДТО.Получатель_Подразделение	= РеквизитыШ.Получатель_Подразделение;
	ОбъектХДТО.Получатель_Касса			= РеквизитыШ.Получатель_Касса;
	
	ОбъектХДТО.Комментарий				= РеквизитыШ.Комментарий;	
	ОбъектХДТО.ВидОперации				= РеквизитыШ.ВидОперации;
	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
			
	Возврат ОбъектХДТО;	
КонецФункции

Функция ВыгрузитьДок_РНК_ПНК(ДокВыборка)	
	ИмяТаблицы		= "Документ.РасходнаяНакладная";	
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекСклад				= ?(ЗначениеЗаполнено(ДокВыборка.СкладПолучатель_ДИ),ДокВыборка.СкладПолучатель_ДИ,ДокВыборка.Склад);
	ТекОрганизация 			= ?(ЗначениеЗаполнено(ТекСклад),ПолучитьРеквизитШапки(ТекСклад,"Организация"),РеквизитыШ.Контрагент);	
	
	ОбъектХДТО				= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг");
	КлючевыеСвойстваXDTO	= СоздатьОбъектХДТО("КлючевыеСвойстваПоступлениеТоваровУслуг");	
	
	КлючевыеСвойстваXDTO.Ссылка			= СериализаторXDTO.XMLСтрока(РеквизитыШ.Ссылка);
	КлючевыеСвойстваXDTO.Дата			= РеквизитыШ.Дата;
	КлючевыеСвойстваXDTO.Номер			= РеквизитыШ.Номер; 
	КлючевыеСвойстваXDTO.Организация	= ВыгрузитьСпр_Организации_КС(ТекОрганизация);
	КлючевыеСвойстваXDTO.Контрагент		= ВыгрузитьСпр_Контрагенты_Элемент_КС(РеквизитыШ.Организация);
	
	ОбъектХДТО.КлючевыеСвойства			= КлючевыеСвойстваXDTO;	
	
	СуммаДокумента	= 0; 
	
	
	ТоварыXDTO	= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг.Товары");	
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		ПроцентНДС			= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);
		
		СтрокаХДТО						= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг.Товары.Строка");
		
		СтрокаХДТО.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		
		ТекЕдиница						= ?(ЗначениеЗаполнено(ВыборкаПоТЧ.Единица),ВыборкаПоТЧ.Единица,Ед_Штука);		
		
		Если ВыборкаПоТЧ.Характеристика.Родитель.Код<>ВыборкаПоТЧ.Номенклатура.Код Тогда
			Сообщить_("ой ой");		
		КонецЕсли; 
		
		СтрокаХДТО.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(ТекЕдиница);		
		
		СтрокаХДТО.Количество			= ВыборкаПоТЧ.Количество;
		
		СтрокаХДТО.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаХДТО.Цена					= Окр(ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество,2,1);
		СтрокаХДТО.ЦенаЗаУпаковку		= Окр(ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество,2,1);
		СтрокаХДТО.КоличествоУпаковок	= ВыборкаПоТЧ.Количество;
		СтрокаХДТО.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);
		СтрокаХДТО.СуммаНДС				= ВыборкаПоТЧ.НДС;
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;
		
		ДобавитьЭлементХДТО(СтрокаХДТО,ВыборкаПоТЧ.Заявка,				"Заявка",				"decimal",ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаХДТО,ВыборкаПоТЧ.ПодтвержденнаяЗаявка,"ПодтвержденнаяЗаявка",	"decimal",ПространствоИмен_СТ);		
		
		СуммаДокумента	= СуммаДокумента+ВыборкаПоТЧ.Всего;
		
		ТоварыXDTO.Строка.Добавить(СтрокаХДТО);		
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;
	
	ОбъектХДТО.Валюта					= ВыгрузитьСпр_Валюты_КС(ДокВыборка.Валюта);
	ОбъектХДТО.ВидОперации				= "ПокупкаУПоставщика";
	ОбъектХДТО.Сумма					= ДокВыборка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС			= СериализаторXDTO.XMLСтрока(Истина);	
	
	ТекПодразделение					= ?(ЗначениеЗаполнено(ДокВыборка.ПодразделениеПолучатель_ДИ),ДокВыборка.ПодразделениеПолучатель_ДИ,ДокВыборка.Подразделение);
	УстановитьСвойствоХДТО(ОбъектХДТО,"Подразделение",ВыгрузитьСпр_Подразделения_Элемент_КС(ТекПодразделение));	
	
	УстановитьСвойствоХДТО(ОбъектХДТО,"Склад",ВыгрузитьСпр_Склады_Элемент_КС(ТекСклад));	
	
	ОбъектХДТО.ДанныеВзаиморасчетов		= Выгрузить_ОбщиеСвойстваДанныеВзаиморасчетов(РеквизитыШ.Валюта,РеквизитыШ.Договор,Истина);
	ОбъектХДТО.Комментарий				= РеквизитыШ.Комментарий;
	
	КодОперацииXDTO	= Фабрика.Создать(Фабрика.Тип(ПространствоИмен_ЕЕ,"КодыОперацийОстатки"),"Закупка");	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"КодОперации",КодОперацииXDTO);
	
	СуммаДокументаXDTO = Фабрика.Создать(Фабрика.Тип(ПространствоИмен_СТ,"float"),СуммаДокумента);
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"СуммаДокумента",СуммаДокументаXDTO);
		
	ДобавитьСостояниеНакладной(ОбъектХДТО,РеквизитыШ.СостояниеНакладной,"УПоставщика");	
	
	ДобавитьСвойствоХДТО(ОбъектХДТО,ВыгрузитьСпр_ФизическиеЛица_Элемент_КС(РеквизитыШ.Менеджер),"Менеджер",	ПространствоИмен_ЕД);
	ДобавитьСвойствоХДТО(ОбъектХДТО,ВыгрузитьСпр_Пользователи_Элемент_КС(РеквизитыШ.Автор),		"Автор",	ПространствоИмен_ЕД);
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ХПС_ОбъектХДТО	= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг.Сертификаты",ПространствоИмен_ЕЕ);
		
		ХПС_Объект		= ХПС_Ссылка.ПолучитьОбъект();
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл
			ОбработкаПрерыванияПользователя_();
			
			СертификатХДТО			= ВыгрузитьСпр_ПодарочныеСертификаты_КС(ВыборкаПоТЧ.Сертификат);
			Если СертификатХДТО<>Неопределено Тогда
				СтрокаХДТО				= СоздатьОбъектХДТО("Документ.ПоступлениеТоваровУслуг.Сертификаты.Строка",ПространствоИмен_ЕЕ);			
				СтрокаХДТО.Сертификат	= СертификатХДТО;
			
				ХПС_ОбъектХДТО.Строка.Добавить(СтрокаХДТО);			
			КонецЕсли;			
		КонецЦикла;
		
		ДобавитьСвойствоХДТО(ОбъектХДТО,ХПС_ОбъектХДТО,"Сертификаты",ПространствоИмен_ЕЕ);		
	КонецЕсли; 
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_РНК_ПНК

Функция ВыгрузитьДок_РНК_ПНК_ЕЕ(ДокВыборка)	
	ИмяТаблицы		= "Документ.РасходнаяНакладная";	
	ИмяТипаХДТО		= "Документ.ПриходнаяНакладная";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекСклад				= ПрочитатьЗначениеСвойства(ДокСсылка,СВ_СкладПолРНК);	
	ТекПодразделение		= ПрочитатьЗначениеСвойства(ДокСсылка,СВ_ПодразделениеРНК);	
	Если НЕ ЗначениеЗаполнено(ТекПодразделение) Тогда
		ТекПодразделение	= ФранчПодразделениеСсылки(РеквизитыШ.ПунктДоставки);		
	КонецЕсли;	
	ТекОрганизация 			= ПрочитатьЗначениеСвойства(РеквизитыШ.Контрагент,СВ_ОрганизацияКонтр);
	Если НЕ ЗначениеЗаполнено(ТекОрганизация) Тогда	
		ТекОрганизация		= ОрганизацияПодразделения(ТекПодразделение);
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТекСклад) И ЗначениеЗаполнено(ТекПодразделение) Тогда //Из подчиненных документов брать нельзя - там каша иногда
		ТекСклад	= ПолучитьРеквизитШапки(ТекПодразделение,"ОсновнойСклад","Справочник");	
	КонецЕсли; 
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ОбъектХДТО.Ссылка		= РеквизитыШ.Ссылка;
	
	ОбъектХДТО.Дата							= РеквизитыШ.Дата;
	ОбъектХДТО.Номер						= РеквизитыШ.Номер;	
	ОбъектХДТО.ДатаВходящегоДокумента		= РеквизитыШ.Дата;
	ОбъектХДТО.НомерВходящегоДокумента		= РеквизитыШ.Номер;	
	ОбъектХДТО.ВидВходящегоДокумента		= "РНК";	
	ОбъектХДТО.СостояниеНакладнойУПоставщика = РеквизитыШ.СостояниеНакладной;	
	
	ОбъектХДТО.Организация		= Справочники.Организации.ПолучитьСсылку(ТекОрганизация.УникальныйИдентификатор());
	ОбъектХДТО.Подразделение	= ТекПодразделение;		
	ОбъектХДТО.Склад			= ТекСклад;		
	
	ОбъектХДТО.Контрагент	= Справочники.Контрагенты.ПолучитьСсылку(РеквизитыШ.Организация.УникальныйИдентификатор());	
	ОбъектХДТО.Договор		= РеквизитыШ.Договор;	
	
	ОбъектХДТО.Валюта		= ДокВыборка.Валюта;
	ОбъектХДТО.Курс			= ДокВыборка.Курс;
	
	ОбъектХДТО.Комментарий	= РеквизитыШ.Комментарий;	
	
	ОбъектХДТО.Менеджер		= РеквизитыШ.Менеджер;
	ОбъектХДТО.Автор		= РеквизитыШ.Автор;
	ОбъектХДТО.ГруппыТоваров= РеквизитыШ.ГруппыТоваров;
	
	СуммаДокумента			= 0;
	ТоварыXDTO				= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары",ПространствоИмен_ЕЕ);	
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;	
		
		СтрокаТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары.Строка",ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ,,"Единица");
		СтрокаТЧ_ХДТО.Единица	= Ед_Штука;
		
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЧ.Номенклатура.Родитель,"НомерГТД",ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли;
		
		СуммаДокумента	= СуммаДокумента+ВыборкаПоТЧ.Всего;
		
		ТоварыXDTO.Строка.Добавить(СтрокаТЧ_ХДТО);		
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;	
	
	ОбъектХДТО.КодОперации				= Перечисления.КодыОперацийОстатки.Закупка;
	ОбъектХДТО.Сумма					= ДокВыборка.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС			= СериализаторXDTO.XMLСтрока(Истина);	
	
	ОбъектХДТО.СуммаДокумента			= СуммаДокумента;	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты",ПространствоИмен_ЕЕ);	
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты.Строка",ПространствоИмен_ЕЕ);
			СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоТЧ.Сертификат;			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
		КонецЦикла;
		
		ОбъектХДТО.Сертификаты=ТЧ_ХДТО;		
	КонецЕсли; 
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_РНК_ПНК_ЕЕ

Функция ВыгрузитьДок_РКМ_КП(ДокВыборка)	
	ИмяТаблицы		= "Документ.РекламационнаяНакладная";	
	ИмяТипаХДТО		= "Документ.КорректировкаПоступления";
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	ДокСсылка				= ВхПараметр.Ссылка;
	РеквизитыШ				= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	ТекПодразделение		= ФранчПодразделениеСсылки(РеквизитыШ.ПунктДоставки);
	ТекОрганизация 			= ОрганизацияПодразделения(ТекПодразделение);	
	
	ОбъектХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "Товары";	
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ+",Номер");
	
	ОбъектХДТО.ДатаВходящегоДокумента	= РеквизитыШ.Дата;
	ОбъектХДТО.НомерВходящегоДокумента	= РеквизитыШ.Номер;	
	ОбъектХДТО.ВидВходящегоДокумента	= ""+ДокСсылка.Метаданные();	
	
	ОбъектХДТО.Организация		= Справочники.Организации.ПолучитьСсылку(ТекОрганизация.УникальныйИдентификатор());
	ОбъектХДТО.Подразделение	= ТекПодразделение;	
	
	ОбъектХДТО.Контрагент	= Справочники.Контрагенты.ПолучитьСсылку(РеквизитыШ.Организация.УникальныйИдентификатор());
	ОбъектХДТО.ВидОперации	= "СогласованноеИзменение";	
	
	ОбъектХДТО.АктОРасхождениях = РеквизитыШ.ЗаявкаНаРекламацию;
	
	ТоварыXDTO				= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары",ПространствоИмен_ЕЕ);	
	
	КоличествоДокумента		= 0;
	КоличествоРасхождений	= 0;
	
	СуммаДокумента			= 0;
	СуммаРасхождений		= 0;
	
	ВыборкаПоТЧ				= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		//Если ВыборкаПоТЧ.Количество=ВыборкаПоТЧ.КоличествоДоИзменения Тогда Продолжить КонецЕсли;	
		
		СтрокаТЧ_ХДТО		= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары.Строка",ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаПоТЧ);		
		
		Всего				= ВыборкаПоТЧ.Количество			*ВыборкаПоТЧ.Цена;
		ВсегоДоИзменения 	= ВыборкаПоТЧ.КоличествоДоИзменения	*ВыборкаПоТЧ.Цена;
		
		СтрокаТЧ_ХДТО.ВсегоДоИзменения 	= ВсегоДоИзменения;
		СтрокаТЧ_ХДТО.Всего 			= Всего;
		
		СтрокаТЧ_ХДТО.Единица			= Ед_Штука;	
		
		ПроцентНДС						= ПроцентНДСпоСтавке(ВыборкаПоТЧ.СтавкаНДС);		
		Если ПроцентНДС<>0 Тогда	
			СтрокаТЧ_ХДТО.НДС          	= Окр(Всего*ПроцентНДС/(1+ПроцентНДС),2,1);
			СтрокаТЧ_ХДТО.СуммаБезНДС	= Всего	- СтрокаТЧ_ХДТО.НДС;
			
			СтрокаТЧ_ХДТО.НДСДоИзменения			= Окр(ВсегоДоИзменения*ПроцентНДС/(1+ПроцентНДС),2,1);
			СтрокаТЧ_ХДТО.СуммаБезНДСДоИзменения	= ВсегоДоИзменения-СтрокаТЧ_ХДТО.НДСДоИзменения;;
		КонецЕсли;
		
		ТоварыXDTO.Строка.Добавить(СтрокаТЧ_ХДТО);		
		
		КоличествоДокумента		= КоличествоДокумента	+ ВыборкаПоТЧ.Количество;
		СуммаДокумента			= СуммаДокумента		+ Всего;	
		
		КоличествоРасхождений   = КоличествоРасхождений	+ (ВыборкаПоТЧ.Количество - ВыборкаПоТЧ.КоличествоДоИзменения);
		СуммаРасхождений		= СуммаРасхождений		+ (Всего-ВсегоДоИзменения);
	КонецЦикла;
	
	ОбъектХДТО.Товары					= ТоварыXDTO;	
	
	ОбъектХДТО.СуммаДокумента			= СуммаДокумента;
	ОбъектХДТО.КоличествоДокумента		= КоличествоДокумента;
	
	ОбъектХДТО.СуммаРасхождений			= СуммаРасхождений;
	ОбъектХДТО.КоличествоРасхождений	= КоличествоРасхождений;
	
	
	
	//ОбъектХДТО.КодОперации			= Перечисления.КодыОперацийОстатки.Закупка;	
	ОбъектХДТО.СуммаВключаетНДС			= СериализаторXDTO.XMLСтрока(Истина);	
			
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_РКМ_КП

Функция ВыгрузитьДок_РКО(ДокВыборка)	
	ИмяТаблицы		= "Документ.РасходныйКассовыйОрдер";	
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"ВидОперации");
	
	УстановитьСвойствоХДТО(ОбъектХДТО,"ВидОперации",XMLСтрока(РеквизитыШ.ВидОперации));
		
	Возврат ОбъектХДТО;
КонецФункции //ВыгрузитьДок_РКО(ДокВыборка)

Функция ВыгрузитьДок_СВД(ДокВыборка)
	ИмяТаблицы	= Метаданные.Документы.СверкаДанных.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы;
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "Данные";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ);
	
	ОбъектХДТО.ИмяПланаОбмена = "ОбменСЕЕ";
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьДок_СВД(ДокВыборка) 

Функция ВыгрузитьДок_СПН(ДокВыборка)
	ИмяТаблицы	= Метаданные.Документы.СписаниеТМЦ.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы;
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	ДокСсылка	= ВхПараметр.Ссылка;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "Товары";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ);		
	
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	ХПС_Ссылка	= НайтиХПС(ДокСсылка);
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты",ПространствоИмен_ЕЕ);	
		
		ВыборкаПоТЧ	= ПолучитьВыборкуТЧДокумента(ХПС_Ссылка,"Сертификаты");
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты.Строка",ПространствоИмен_ЕЕ);
			СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоТЧ.Сертификат;			
			ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
		КонецЦикла;
		
		ОбъектХДТО.Сертификаты=ТЧ_ХДТО;		
	КонецЕсли;
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьДок_СПН(ДокВыборка)

Функция ВыгрузитьДок_СПН_ЕД(ДокВыборка)
	Если 1=2 Тогда
		ДокСсылка=Документы.СписаниеТМЦ.ПустаяСсылка();	
	КонецЕсли;
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		ИменаРеквизитов	= РеквизитыШапок.Получить("Документ.СписаниеТМЦ");			
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,ИменаРеквизитов);		
	КонецЕсли;	
	
	ВидДокумента= "СписаниеЗапасов";
	
	МетаОбъект	= ДокСсылка.Метаданные();
	
	ОбъектХДТО						= СоздатьОбъектХДТО("Документ."+ВидДокумента);	
	
	ОбъектХДТО.КлючевыеСвойства	= ВыгрузитьДок_СПН_КС(РеквизитыШапки);		
	УстановитьСвойствоХДТО(ОбъектХДТО,"Ответственный",	ВыгрузитьСпр_Пользователи_Элемент_КС(РеквизитыШапки.Автор));
	ОбъектХДТО.Комментарий		= РеквизитыШапки.Комментарий;
	УстановитьСвойствоХДТО(ОбъектХДТО,"Подразделение",	ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШапки.Подразделение));
	УстановитьСвойствоХДТО(ОбъектХДТО,"Склад",			ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШапки.Склад));
	
	ТоварыXDTO				= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаXDTO						= СоздатьОбъектХДТО("Документ."+ВидДокумента+".Товары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		СтрокаXDTO.ЕдиницаИзмерения		= ВыгрузитьСпр_Единицы_Элемент_КС(ВыборкаПоТЧ.Единица);
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.Цена					= Окр(ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество,2,1);		
		
		СтрокаXDTO.ТипЗапасов			= "СобственныеТовары";
		
		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;	
	
	ОбъектХДТО.Товары	= ТоварыXDTO;
	
	ДобавитьСостояниеНакладной(ОбъектХДТО,РеквизитыШапки.СостояниеНакладной);	
	
	ПодразделениеХДТО	= ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШапки.Подразделение);	
	СтатьяЗатратХДТО	= ВыгрузитьСпр_СтатьиЗатрат_Элемент_КС(РеквизитыШапки.СтатьяЗатрат);
	
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"Подразделение",	ПодразделениеХДТО);
	ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"СтатьяЗатрат",	СтатьяЗатратХДТО);	
	
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.ГруппыТоваров,	"ГруппыТоваров",	"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.Комментарий,		"Комментарий",		"string",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.Проведен,			"Проведен",			"boolean",	ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШапки.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
			
	Возврат ОбъектХДТО;	
КонецФункции

Функция ВыгрузитьДок_СПН_КС(ДокВыборка)
	
	КС_XDTO				= СоздатьОбъектХДТО("КлючевыеСвойстваСписаниеЗапасов");	
	
	КС_XDTO.Ссылка		= СериализаторXDTO.XMLСтрока(ДокВыборка.Ссылка);
	КС_XDTO.Дата		= ДокВыборка.Дата;
	КС_XDTO.Номер		= ДокВыборка.Номер; 
	КС_XDTO.Организация	= ВыгрузитьСпр_Организации_КС(ДокВыборка.Организация);
	
	Возврат КС_XDTO;
	
КонецФункции //ВыгрузитьДокумент_КС_ОПР(ДокСсылка)

Функция ВыгрузитьДок_ОКС(ДокВыборка)
	Если 1=2 Тогда
		ДокСсылка=Документы.ОтчетКассовойСмены.ПустаяСсылка();	
	КонецЕсли;
	КэшГТД								= Новый Соответствие;
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);	
	// + HELP-2150 20241118 Михайловский
	//ОбъектХДТО	= СоздатьОбъектХДТО("Документ.ОтчетОРозничныхПродажах");
	ОбъектХДТО	= СоздатьОбъектХДТО("Документ.ОтчетКассовойСмены");
	// - HELP-2150 20241118 Михайловский
	
	Если НаВходеВыборка Тогда
		РеквизитыШ	= ДокВыборка;
	Иначе
		РеквизитыШ	= ПолучитьРеквизитыШапки(ДокСсылка,РеквизитыШапок.Получить("Документ.ОтчетКассовойСмены"));	
	КонецЕсли;
	
	ОбъектХДТО.КлючевыеСвойства		= ВыгрузитьДок_ОКС_КС(РеквизитыШ);		
	
	УстановитьСвойствоХДТО(ОбъектХДТО,"Ответственный",	ВыгрузитьСпр_Пользователи_Элемент_КС(РеквизитыШ.Автор));	
	УстановитьСвойствоХДТО(ОбъектХДТО,"Валюта",			ВыгрузитьСпр_Валюты_КС(РеквизитыШ.Валюта));	
	ОбъектХДТО.Сумма				= РеквизитыШ.СуммаДокумента;	
	ОбъектХДТО.СуммаВключаетНДС		= СериализаторXDTO.XMLСтрока(Истина);
	ОбъектХДТО.Подразделение		= ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШ.Подразделение);
	ОбъектХДТО.Склад				= ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШ.Склад);
	ОбъектХДТО.КассаККМ				= ВыгрузитьСпр_Кассы_Элемент_КС(РеквизитыШ.Касса);
    ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.СуммаСдачиПодарочногоСертификата, "СуммаСдачиПодарочногоСертификата", "decimal", ПространствоИмен_СТ);
//            ОбъектХДТО.СуммаСдачиПодарочногоСертификата=РеквизитыШ.СуммаСдачиПодарочногоСертификата;

	
	Если РеквизитыШ.КодОперации	= Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
		ОбъектХДТО.ТоварыВозвратПродажи	= ВыгрузитьДок_ОКС_ТЧ_Возвраты(ДокВыборка);				
	Иначе
		ОбъектХДТО.ТоварыПродажа		= ВыгрузитьДок_ОКС_ТЧ_Товары(ДокВыборка);
	КонецЕсли;				
	
	Если РеквизитыШ.ВидОплаты=Перечисления.ВидыОплаты.БН Тогда		
		ОплатаПлатежнымиКартамиXDTO		= СоздатьОбъектХДТО("ОплатаПлатежнымиКартами");
		
		СтрокаXDTO						= СоздатьОбъектХДТО("ОплатаПлатежнымиКартами.Строка");
		
		Если РеквизитыШ.КодОперации	= Перечисления.КодыОперацийОстатки.Реализация Тогда
			СтрокаXDTO.СуммаОплаты		= РеквизитыШ.СуммаДокумента-РеквизитыШ.СуммаОплатыСертификатами;				
		Иначе
			СтрокаXDTO.СуммаОплаты		= -РеквизитыШ.СуммаДокумента; 				
		КонецЕсли;		
		
		СтрокаXDTO.НомерКарты           = "9999 9999 9999 9999 9999";
		СтрокаXDTO.Эквайрер             = ВыгрузитьСпр_Контрагенты_Элемент_КС(КонтрагентЭквайринг);
	
		ОплатаПлатежнымиКартамиXDTO.Строка.Добавить(СтрокаXDTO);	
	
		ОбъектХДТО.ОплатаПлатежнымиКартами=ОплатаПлатежнымиКартамиXDTO;		
	КонецЕсли;
	
	Если РеквизитыШ.СуммаОплатыСертификатами>0 Тогда
		ПодарочныеСертификатыXDTO=СоздатьОбъектХДТО("ПодарочныеСертификаты");
		
		ВыборкаПоТЧ	= ДокВыборка.ПодарочныеСертификаты.Выбрать();
		Пока ВыборкаПоТЧ.Следующий() Цикл		
			СтрокаXDTO						= СоздатьОбъектХДТО("ПодарочныеСертификаты.Строка");		
			
			СтрокаXDTO.ДанныеСертификата    = ВыгрузитьСпр_ПодарочныеСертификаты_КС(ВыборкаПоТЧ.Сертификат);
			СтрокаXDTO.Сумма				= ВыборкаПоТЧ.СуммаОплатыСертификатами;
			
			ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.НомерЧекаККМ,	"НомерЧекаККМ",	"string",ПространствоИмен_СТ);
			ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.НомерЧека,		"НомерЧека",	"string",ПространствоИмен_СТ);
			ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.СуммаЧека,		"СуммаЧека",	"decimal",ПространствоИмен_СТ);						
			ДобавитьСвойствоХДТО(СтрокаXDTO,ВыгрузитьСпр_Пользователи_Элемент_КС(ВыборкаПоТЧ.АвторЧека),"АвторЧека",ПространствоИмен_ЕЕ);
			
			ПодарочныеСертификатыXDTO.Строка.Добавить(СтрокаXDTO);	
		КонецЦикла; 
		
		ОбъектХДТО.ОплатаСертификатами=ПодарочныеСертификатыXDTO;
	КонецЕсли;
	
	ДобавитьЭлементХДТО(ОбъектХДТО,XMLСтрока(РеквизитыШ.КодОперации),	"КодОперации",		"КодыОперацийОстатки",	ПространствоИмен_ЕЕ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.Проведен,					"Проведен",			"boolean",				ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТО,РеквизитыШ.ПометкаУдаления,			"ПометкаУдаления",	"boolean",				ПространствоИмен_СТ);	
	
	Возврат ОбъектХДТО;	
КонецФункции

//+HELP-2306 20250220 Михайловский
Функция ВыгрузитьДок_ПСАЗ(ДокВыборка)
	ИмяТаблицы	= "Документ.ЗаявкаНаПостСторонАссорт";
	ИмяТипаХДТО	= "Документ.ЗаявкаНаПостСторонАссорт";
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "ИменаКолонок,ЗначенияКолонок,Товары,Брэнды,ВидыНоменклатуры,Цвета,Размеры,Коллекции";//,ПродажаПодарочныхСертификатов,ВозвратПодарочныхСертификатов";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"Состояние," + ИменаТЧ);		
	УстановитьСвойствоХДТО(ОбъектХДТО, "Состояние", XMLСтрока(РеквизитыШ.Состояние));
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	Возврат ОбъектХДТО;	
КонецФункции //-HELP-2306 20250220 Михайловский

Функция ВыгрузитьДок_ОКС_КС(ДокСсылка)
	Если ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.ОтчетКассовойСмены") Тогда
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,"Ссылка,Дата,Номер,Склад.Организация,Номер_Z_Отчета,Касса");
	Иначе
		РеквизитыШапки	= ДокСсылка;
	КонецЕсли;	
	
	КС_XDTO					= СоздатьОбъектХДТО("КлючевыеСвойстваОтчетОРозничныхПродажах");	
	
	КС_XDTO.Ссылка			= СериализаторXDTO.XMLСтрока(РеквизитыШапки.Ссылка);
	КС_XDTO.Дата			= РеквизитыШапки.Дата;
	КС_XDTO.Номер			= РеквизитыШапки.Номер; 
	КС_XDTO.Организация		= ВыгрузитьСпр_Организации_КС(РеквизитыШапки.Склад_Организация);
	
	КС_XDTO.КассоваяСмена	= ВыгрузитьДок_КС_КС(РеквизитыШапки);
	
	Возврат КС_XDTO;
КонецФункции //Выгрузить_КлючевыеСвойстваОтчетОРозничныхПродажах(ДокСсылка)

Функция ВыгрузитьДок_ОКС_ТЧ_Товары(ДокВыборка)
	// + HELP-2150 20241118 Михайловский
	//ТЧ_XDTO		= СоздатьОбъектХДТО("Документ.ОтчетОРозничныхПродажах.Товары");
	ТЧ_XDTO		= СоздатьОбъектХДТО("Документ.ОтчетКассовойСмены.Товары");
	// - HELP-2150 20241118 Михайловский
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл	
		Если ВыборкаПоТЧ.Количество	= 0 Тогда Продолжить КонецЕсли;
		// + HELP-2150 20241118 Михайловский
		//СтрокаXDTO			= СоздатьОбъектХДТО("Документ.ОтчетОРозничныхПродажах.Товары.Строка");  // ??
		СтрокаXDTO			= СоздатьОбъектХДТО("Документ.ОтчетКассовойСмены.Товары.Строка");
		// - HELP-2150 20241118 Михайловский
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		
		УстановитьСвойствоХДТО(СтрокаXDTO,"ЕдиницаИзмерения",ВыгрузитьСпр_Единицы_Элемент_КС(ВыборкаПоТЧ.Единица));
		
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.Цена					= Окр(ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество,2,1);		
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);
		// + HELP-2150 20241118 Михайловский
		//СтрокаXDTO.СуммаНДС				= ВыборкаПоТЧ.НДС;
		СтрокаXDTO.НДС				= ВыборкаПоТЧ.НДС;	
		
		//врем, надо переделать
		Попытка
		// - HELP-2150 20241118 Михайловский
			СтрокаXDTO.СуммаСкидкиПоКупону  = ВыборкаПоТЧ.СуммаСкидкиПоКупону;
		// + HELP-2150 20241118 Михайловский
		//врем, надо переделать
		Исключение
		КонецПопытки;
		// - HELP-2150 20241118 Михайловский
		
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.ВсегоБезСкидки,		"ВсегоБезСкидки",	"decimal",	ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.НомерЧекаККМ,		"НомерЧекаККМ",		"decimal",	ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаXDTO,XMLСтрока(ВыборкаПоТЧ.Продавец),	"Продавец",			"string",	ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаXDTO,XMLСтрока(ВыборкаПоТЧ.Акция),	"Акция",			"string",	ПространствоИмен_СТ);
		//////////////////////////////////////////////////////////////////////////////////////////////
		// + HELP-2150 20241118 Михайловский
		//врем, надо переделать
		Попытка
		// - HELP-2150 20241118 Михайловский
			ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.ВсегоОФД,			"ВсегоОФД",			"decimal",	ПространствоИмен_СТ);
		// + HELP-2150 20241118 Михайловский
		//врем, надо переделать
		Исключение
		КонецПопытки;
		// - HELP-2150 20241118 Михайловский
		//////////////////////////////////////////////////////////////////////////////////////////////
		
		ТЧ_XDTO.Строка.Добавить(СтрокаXDTO);
	КонецЦикла;
	
	Возврат ТЧ_XDTO;
КонецФункции //Выгрузить_ТЧ_ОтчетОРозничныхПродажах_Товары(ДокСсылка)


Функция ВыгрузитьДок_ОКС_ТЧ_Возвраты(ДокСсылка)	
	ТЧ_XDTO		= СоздатьОбъектХДТО("Документ.ОтчетОРозничныхПродажах.ВозвратТоваров");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокСсылка);	
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаXDTO						= СоздатьОбъектХДТО("Документ.ОтчетОРозничныхПродажах.ВозвратТоваров.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		УстановитьСвойствоХДТО(СтрокаXDTO,"ЕдиницаИзмерения",ВыгрузитьСпр_Единицы_Элемент_КС(ВыборкаПоТЧ.Единица));
		
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.Цена					= ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество;
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);
		СтрокаXDTO.СуммаНДС				= ВыборкаПоТЧ.НДС;
		СтрокаXDTO.НомерЧекаККМПродажи	= ВыборкаПоТЧ.НомерЧекаККМ;
		
		//ГТД=ПолучитьГТД(СтрокаТЧ.Номенклатура.Родитель,ДокСсылка.Дата);
		//Если ЗначениеЗаполнено(ГТД) Тогда
		//	СтрокаXDTO.ДанныеГТД		= Выгрузить_ОбщиеСвойстваДанныеНомераГТД(ГТД);	
		//КонецЕсли; 
		
		ТЧ_XDTO.Строка.Добавить(СтрокаXDTO);
	КонецЦикла;
	
	Возврат ТЧ_XDTO;
КонецФункции //Выгрузить_ТЧ_ОтчетОРозничныхПродажах_Возвраты(ДокСсылка)

Функция ВыгрузитьДок_ПрайсЛист(ДокВыборка,ДопИнфо=Неопределено)
	ИмяТаблицы	= Метаданные.Документы.ПрайсЛист.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы;
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ);	
	
	Если ЗначениеЗаполнено(ДокВыборка.ТипЦен_Базовый) Тогда
		ТипЦен			= ДокВыборка.ТипЦен_Базовый;
		Подразделение	= ПодразделениеТипаЦен(ДокВыборка.ТипЦен);
	Иначе	
		ТипЦен			= ДокВыборка.ТипЦен;
		Подразделение	= Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;	
	
	ОбъектХДТО.ТипЦен		 = ТипЦен;
	ОбъектХДТО.Подразделение = Подразделение;
	
	ОбъектХДТО.ДействителенПо= РеквизитыШ.Дата2; 
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьДок_ПрайсЛист(ДокВыборка,ДопИнфо=Неопределено)

Функция ВыгрузитьДок_ПрайсЛист_ЕД(ДокВыборка,ДопИнфо=Неопределено)
	Если 1=2 Тогда
		ДокСсылка=Документы.ПрайсЛист.ПустаяСсылка();	
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);	
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе
		ИменаРеквизитов	= РеквизитыШапок.Получить("Документ.ПрайсЛист");
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,ИменаРеквизитов);	
	КонецЕсли;	
	
	ДокОбъектХДТО					= СоздатьОбъектХДТО("Документ.УстановкаЦенНоменклатуры");	
	
	ДокОбъектХДТО.КлючевыеСвойства 	= ВыгрузитьДок_УстановкаЦенНоменклатуры_КС(ДокСсылка);		
	УстановитьСвойствоХДТО(ДокОбъектХДТО,"Ответственный", ВыгрузитьСпр_Пользователи_Элемент_КС(ДокСсылка.Автор));
	
	Если ЗначениеЗаполнено(ДокВыборка.ТипЦен_Базовый) Тогда
		ТипЦен			= ДокВыборка.ТипЦен_Базовый;
		Подразделение	= ПодразделениеТипаЦен(ДокВыборка.ТипЦен);
	Иначе	
		ТипЦен			= ДокВыборка.ТипЦен;
		Подразделение	= Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;	
	
	ДокОбъектХДТО.ТипЦен			= ВыгрузитьСпр_ТипыЦен_Элемент_КС(ТипЦен);	
	
	ДокОбъектХДТО.Комментарий		= РеквизитыШапки.Комментарий;
	
	Надо=Ложь;
	
	
	Если ТипЗнч(ДопИнфо)=Тип("Строка")  Тогда
		Товары	= ПолучитьДанныеТЧ_Прайс(ДокСсылка,ДопИнфо);
	Иначе
		Товары	= ПолучитьДанныеТЧ_Прайс(ДокСсылка);
	КонецЕсли; 
	
	Если Товары.Количество()>0 Тогда		
		ТоварыXDTO						= СоздатьОбъектХДТО("Документ.УстановкаЦенНоменклатуры.Товары");
		
		Для Каждого СтрокаТЧ Из Товары Цикл
			Если СтрокаТЧ.Цена = 0 Тогда Продолжить КонецЕсли;
			
			СтрокаXDTO					= СоздатьОбъектХДТО("Документ.УстановкаЦенНоменклатуры.Товары.Строка");
			
			СтрокаXDTO.Номенклатура		= ВыгрузитьСпр_Номенклатура_Элемент_КС(СтрокаТЧ.ДанныеНоменклатуры.Номенклатура.Ссылка);
			//СтрокаXDTO.Характеристика	= ДанныеНоменклатурыXDTO.Характеристика;
			
			СтрокаXDTO.Цена				= Окр(СтрокаТЧ.Цена,2,1);
			
			ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
			
			Надо	= Истина;
			
			Прервать;
		КонецЦикла;	
		
		ДокОбъектХДТО.Товары				= ТоварыXDTO;
	КонецЕсли; 

	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.Проведен,				"Проведен",			"boolean", 				ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.ПометкаУдаления,		"ПометкаУдаления",	"boolean", 				ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ДокОбъектХДТО,XMLСтрока(РеквизитыШапки.Дата2),		"ДействителенПо",	"dateTime",				ПространствоИмен_СТ);
	
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕД,"Валюта",ВыгрузитьСпр_Валюты_КС(РеквизитыШапки.Валюта));	
	
	//Сообщить_(""+РеквизитыШапки.Ссылка+" "+РеквизитыШапки.Комментарий);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПодразделениеXDTO	= ВыгрузитьСпр_Подразделения_Элемент_КС(Подразделение); 
		ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_СТ,"Подразделение",	ПодразделениеXDTO);
	КонецЕсли;	
	
	Если Надо=0 Тогда //Не читаются объекты без ТЧ
		ДокОбъектХДТО=Неопределено;		
	КонецЕсли;	
	
	Возврат ДокОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_КС_КС(ДокВыборка)
	КС_XDTO	= СоздатьОбъектХДТО("КлючевыеСвойстваОткрытиеКассовойСмены");
	
	КС_XDTO.Дата				= ДокВыборка.Дата;
	КС_XDTO.НомерКассовойСмены  = Номер_Z_Отчета(ДокВыборка.Дата,ДокВыборка.Касса);
	КС_XDTO.КассаККМ			= ВыгрузитьСпр_Кассы_Элемент_КС(ДокВыборка.Касса);
	
	Возврат КС_XDTO;	
КонецФункции //ВыгрузитьДок_КС_КС()

Функция ВыгрузитьДок_УстановкаСкидок(ДокВыборка,ДопИнфо=Неопределено)
	ИмяТаблицы	= "Документ.УстановкаСкидок";
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
			
	Если ЗначениеЗаполнено(РеквизитыШ.ТипСкидок_Базовый) Тогда
		ТипСкидок		= ДокВыборка.ТипСкидок_Базовый;
		Подразделение	= ПодразделениеТипаСкидок(ДокВыборка.ТипСкидок);
	Иначе	
		ТипСкидок		= ДокВыборка.ТипСкидок;
		Подразделение	= Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;
	
	ДокОбъектХДТО			= СоздатьОбъектХДТО("Документ.УстановкаСкидок",ПространствоИмен_ЕЕ);	
	
	ДокОбъектХДТО.Ссылка 			= СериализаторXDTO.XMLСтрока(РеквизитыШ.Ссылка);		
	ДокОбъектХДТО.Дата			    = РеквизитыШ.Дата;
	ДокОбъектХДТО.Номер				= РеквизитыШ.Номер;
	ДокОбъектХДТО.Автор				= РеквизитыШ.Автор;	
	ДокОбъектХДТО.ТипСкидок			= ТипСкидок;	
	ДокОбъектХДТО.ДействителенПо	= РеквизитыШ.ДействителенПо;	
	
	//Если ТипЗнч(ДопИнфо)=Тип("Строка")  Тогда
	//	Товары	= ПолучитьДанныеТЧ_УстановкаСкидок(РеквизитыШ.Ссылка,ДопИнфо);
	//Иначе
	//	Товары	= ПолучитьДанныеТЧ_УстановкаСкидок(РеквизитыШ.Ссылка);
	//КонецЕсли; 
	//
	//Если Товары.Количество()>0 Тогда		
	//	ТоварыXDTO						= СоздатьОбъектХДТО("Документ.УстановкаСкидок.Товары",ПространствоИмен_ЕЕ);
	//	
	//	Для Каждого СтрокаТЧ Из Товары Цикл
	//		Если СтрокаТЧ.Скидка = 0 Тогда Продолжить КонецЕсли;
	//		
	//		СтрокаXDTO					= СоздатьОбъектХДТО("Документ.УстановкаСкидок.Товары.Строка",ПространствоИмен_ЕЕ);
	//		
	//		СтрокаXDTO.Номенклатура		= СтрокаТЧ.Номенклатура;
	//		//СтрокаXDTO.Характеристика	= ДанныеНоменклатурыXDTO.Характеристика;
	//		
	//		СтрокаXDTO.Скидка			= Окр(СтрокаТЧ.Скидка,2,1);
	//		
	//		ТоварыXDTO.Строка.Добавить(СтрокаXDTO);		
	//		
	//		Надо	= Истина;
	//	КонецЦикла;	
	//	
	//	ДокОбъектХДТО.Товары				= ТоварыXDTO;
	//КонецЕсли; 

	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШ.Проведен,				"Проведен",			"boolean", 				ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШ.ПометкаУдаления,		"ПометкаУдаления",	"boolean", 				ПространствоИмен_СТ);
	
	ДокОбъектХДТО.Подразделение=СериализаторXDTO.XMLСтрока(Подразделение);
	
	
	//Если Товары.Количество()=0 Тогда //Не читаются объекты без ТЧ
	//	ДокОбъектХДТО=Неопределено;		
	//КонецЕсли;	
	
	Возврат ДокОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_УстановкаЦенНоменклатуры_КС(ДокСсылка)
	ОбектXDTO			= СоздатьОбъектХДТО("КлючевыеСвойстваУстановкаЦенНоменклатуры");	
	
	ОбектXDTO.Ссылка	= СериализаторXDTO.XMLСтрока(ДокСсылка);
	ОбектXDTO.Дата		= ДокСсылка.Дата;		
	ОбектXDTO.Номер		= ДокСсылка.Номер;	

	Возврат ОбектXDTO;
КонецФункции // ()

Функция ВыгрузитьДок_ХранилищеКодовМаркировки(ДокВыборка)
	ИмяТаблицы	= Метаданные.Документы.ХранилищеКодовМаркировки.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы;
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ДокСсылка	= ВхПараметр.Ссылка;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО, РеквизитыШ, , ИменаТЧ);		
	
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО, РеквизитыШ, "ДокОснование,Отправитель,Получатель");
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьДок_ХранилищеКодовМаркировки(ДокВыборка)

Функция ВыгрузитьДок_МКО(ДокВыборка)
	ИмяТаблицы	= Метаданные.Документы.МаркировкаОстатковТЦ.ПолноеИмя();
	ИмяТипаХДТО	= ИмяТаблицы;
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ДокСсылка	= ВхПараметр.Ссылка;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);	
	
	ИменаТЧ	= "Товары";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО, РеквизитыШ, , ИменаТЧ);		
	
	//Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
	//	ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	//КонецЦикла;
	//
	//ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО, РеквизитыШ, "ДокОснование,Отправитель,Получатель");
	
	Возврат ОбъектХДТО;	
КонецФункции

//+SNL-203 20260515 Михайловский
Функция ВыгрузитьТЧвХДТО1(ВыборкаТЧ,ИмяТипаХДТО,ПостоянныеРеквизитыТЧ=Неопределено)
	ОбъектХДТО_ТЧ		= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ИмяТипаХДТО_Строка	= ИмяТипаХДТО+".Строка";
	
	ЕстьПостоянныеРеквизиты	= (ЗначениеЗаполнено(ПостоянныеРеквизитыТЧ));
	
	Пока ВыборкаТЧ.Следующий() Цикл
		СтрокаТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО_Строка,ПространствоИмен_ЕЕ);
		
		Если Прав(ИмяТипаХДТО, 6) = "Товары" Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаТЧ, ,"СтавкаНДС");  
			
			Попытка
				УстановитьСвойствоХДТО(СтрокаТЧ_ХДТО, "СтавкаНДС", ВыгрузитьПер_СтавкаНДС(ВыборкаТЧ.СтавкаНДС));
			Исключение
			КонецПопытки;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаТЧ);
		КонецЕсли;
		
		Если ЕстьПостоянныеРеквизиты Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ПостоянныеРеквизитыТЧ);
		КонецЕсли;
			
		ОбъектХДТО_ТЧ.Строка.Добавить(СтрокаТЧ_ХДТО);
	КонецЦикла;	
	
	Возврат ОбъектХДТО_ТЧ;
КонецФункции

Функция ВыгрузитьДок_ЗаказИМ(ДокВыборка)	
	ИмяТаблицы		= Метаданные.Документы.ЗаказИМ.ПолноеИмя();	
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок,ШтрихкодыУпаковокВозврат,Возвраты";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО, РеквизитыШ, ,"Статус,УсловияОплаты," + ИменаТЧ); 
	
	//ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,"Состояние," + ИменаТЧ);		
	УстановитьСвойствоХДТО(ОбъектХДТО, "Статус", XMLСтрока(РеквизитыШ.Статус));
	УстановитьСвойствоХДТО(ОбъектХДТО, "УсловияОплаты", XMLСтрока(РеквизитыШ.УсловияОплаты));
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО1(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ВозвратИМ(ДокВыборка)	
	ИмяТаблицы		= Метаданные.Документы.ВозвратИМ.ПолноеИмя();
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО, РеквизитыШ, , ИменаТЧ);
	
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО1(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	//ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО, РеквизитыШ, "ДокОснование,Отправитель,Получатель");	
	
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ВыкупИМ(ДокВыборка)	
	ИмяТаблицы		= Метаданные.Документы.ВыкупИМ.ПолноеИмя();
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО, РеквизитыШ, , ИменаТЧ);
	
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО1(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	//ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО, РеквизитыШ, "ДокОснование,Отправитель,Получатель");	
	
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_Возврат1ИМ(ДокВыборка)	
	ИмяТаблицы		= Метаданные.Документы.Выкуп1ИМ.ПолноеИмя();
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО, РеквизитыШ, , ИменаТЧ);
	
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл	
		ОбъектХДТО[ИмяТЧ]	= ВыгрузитьТЧвХДТО1(ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ),ИмяТаблицы+"."+ИмяТЧ);
	КонецЦикла;
	
	//ВыгрузитьРеквизитыСМультиТипами(ОбъектХДТО, РеквизитыШ, "ДокОснование,Отправитель,Получатель");	
	
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ОплатаИМ(ДокВыборка)	
	ИмяТаблицы		= Метаданные.Документы.ОплатаИМ.ПолноеИмя();
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьДок_ВозвратОплатыИМ(ДокВыборка)	
	ИмяТаблицы		= Метаданные.Документы.ВозвратОплатыИМ.ПолноеИмя();
	ИмяТипаХДТО		= ИмяТаблицы;
	
	ВхПараметр		= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли;
	
	РеквизитыШ		= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,ИмяТаблицы);	
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли; 
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТаблицы,ПространствоИмен_ЕЕ);
	Возврат ОбъектХДТО;
КонецФункции //-SNL-203 20260515 Михайловский

Функция ВыгрузитьДок_Чек_КС(ДокСсылка)
	Если ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.Чек") Тогда
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,"Ссылка,Дата,Номер,НомерЧекаККМ,НомерСменыККМ,КассаККМ,Организация");
	Иначе
		РеквизитыШапки	= ДокСсылка;
	КонецЕсли;
	
	ОбектXDTO						= СоздатьОбъектХДТО("КлючевыеСвойстваЧекККМ");	
	
	ОбектXDTO.Ссылка				= СериализаторXDTO.XMLСтрока(РеквизитыШапки.Ссылка);
	ОбектXDTO.Дата					= РеквизитыШапки.Дата;
	ОбектXDTO.НомерКассовойСмены 	= РеквизитыШапки.НомерСменыККМ;
	ОбектXDTO.КассаККМ				= ВыгрузитьСпр_Кассы_Элемент_КС(РеквизитыШапки.КассаККМ);	
	ОбектXDTO.НомерВПрограмме		= РеквизитыШапки.Номер; 
	ОбектXDTO.НомерЧекаФР			= РеквизитыШапки.НомерЧекаККМ;	

	Возврат ОбектXDTO;
КонецФункции //ВыгрузитьДок_Чек_КС(ДокСсылка)

Функция ВыгрузитьДок_Чек(ДокВыборка)
	ИмяТаблицы	= "Документ.Чек";
	
	Если 1=2 Тогда
		ДокСсылка=Документы.ЧекККМ.ПустаяСсылка();	
	КонецЕсли;
	
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));	
	ДокСсылка		= ?(НаВходеВыборка,ДокВыборка.Ссылка,ДокВыборка);	
	
	Если НаВходеВыборка Тогда
		РеквизитыШапки	= ДокВыборка;
	Иначе		
		РеквизитыШапки	= ПолучитьРеквизитыШапки(ДокСсылка,РеквизитыШапок.Получить(ИмяТаблицы));	
	КонецЕсли;
	
	ДокОбъектХДТО					= СоздатьОбъектХДТО("Документ.ЧекККМ");	
	
	ДокОбъектХДТО.КлючевыеСвойства 	= ВыгрузитьДок_Чек_КС(РеквизитыШапки);		
	ДокОбъектХДТО.ДанныеОперацииККМ	= Выгрузить_ОбщиеСвойстваОперацияККМ(РеквизитыШапки);
	
	//Товары
	ТоварыПродажаXDTO				= СоздатьОбъектХДТО("ОперацияККМТовары");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка);
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл	
		Если ВыборкаПоТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаXDTO			= СоздатьОбъектХДТО("ОперацияККМТовары.Строка");
		
		СтрокаXDTO.ДанныеНоменклатуры	= Выгрузить_ОбщиеСвойстваДанныеНоменклатуры(ВыборкаПоТЧ.Номенклатура,ВыборкаПоТЧ.Характеристика);
		
		УстановитьСвойствоХДТО(СтрокаXDTO,"ЕдиницаИзмерения",ВыгрузитьСпр_Единицы_Элемент_КС(ВыборкаПоТЧ.Единица));
		
		СтрокаXDTO.Количество			= ВыборкаПоТЧ.Количество;
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.Всего;
		СтрокаXDTO.Цена					= ВыборкаПоТЧ.Всего/ВыборкаПоТЧ.Количество;
		СтрокаXDTO.СтавкаНДС			= ВыгрузитьПер_СтавкаНДС(ВыборкаПоТЧ.СтавкаНДС);
		СтрокаXDTO.СуммаНДС				= ВыборкаПоТЧ.НДС;		
		
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.ЦенаБезСкидки,	"ЦенаБезСкидки",	"decimal", ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.ВсегоБезСкидки,	"ВсегоБезСкидки",	"decimal", ПространствоИмен_СТ);
		ДобавитьЭлементХДТО(СтрокаXDTO,ВыборкаПоТЧ.Скидка,			"Скидка",			"decimal", ПространствоИмен_СТ);
		
		ПродавецХДТО	= ВыгрузитьСпр_ФизическиеЛица_Элемент_КС(ВыборкаПоТЧ.Продавец);
		СтрокаXDTO.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕД,"Менеджер",ПродавецХДТО);		
		
		ТоварыПродажаXDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ДокОбъектХДТО.ТоварыПродажа		= ТоварыПродажаXDTO;
	
	Если РеквизитыШапки.ВидОплаты=Перечисления.ВидыОплаты.БН Тогда	
		ОплатаПлатежнымиКартамиXDTO		= СоздатьОбъектХДТО("ОплатаПлатежнымиКартами");		
		
		СтрокаХДТО						= СоздатьОбъектХДТО("ОплатаПлатежнымиКартами.Строка");
		
		СтрокаХДТО.СуммаОплаты			= РеквизитыШапки.СуммаДокумента;
		СтрокаХДТО.НомерКарты           = "9999 9999 9999 9999 9999";
		СтрокаХДТО.Эквайрер             = ВыгрузитьСпр_Контрагенты_Элемент_КС(КонтрагентЭквайринг);
		
		ОплатаПлатежнымиКартамиXDTO.Строка.Добавить(СтрокаХДТО);	
		
		ДокОбъектХДТО.ОплатаПлатежнымиКартами=ОплатаПлатежнымиКартамиXDTO;	
	КонецЕсли; 
	
	//Подарочные сертификаты
	ОплатаСертификатами_XDTO		= СоздатьОбъектХДТО("ПодарочныеСертификаты");
	
	ВыборкаПоТЧ	= ПолучитьВыборкуТЧ(ДокВыборка,"ПодарочныеСертификаты");
	ВыборкаПоТЧ.Сбросить();
	Пока ВыборкаПоТЧ.Следующий() Цикл
		СтрокаXDTO						= СоздатьОбъектХДТО("ПодарочныеСертификаты.Строка");
		
		СтрокаXDTO.ДанныеСертификата	= ВыгрузитьСпр_ПодарочныеСертификаты_КС(ВыборкаПоТЧ.Сертификат);
		СтрокаXDTO.Сумма				= ВыборкаПоТЧ.СуммаОплатыСертификатами;		
		
		ОплатаСертификатами_XDTO.Строка.Добавить(СтрокаXDTO);		
	КонецЦикла;
	
	ДокОбъектХДТО.ОплатаСертификатами	= ОплатаСертификатами_XDTO;	
	
	
	
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕД,"Склад",			ВыгрузитьСпр_Склады_Элемент_КС(РеквизитыШапки.Склад));	
	
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.ЧекПробитНаККМ,		"ЧекПробитНаККМ",	"boolean", 				ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.НомерЧекаККМ,			"НомерЧекаККМ",		"decimal", 				ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.ГруппыТоваров,			"ГруппыТоваров",	"string", 				ПространствоИмен_СТ);
	
	ДобавитьЭлементХДТО(ДокОбъектХДТО,XMLСтрока(РеквизитыШапки.ВидОплаты),	"ВидОплаты",		"string",				ПространствоИмен_СТ);	
	ДобавитьЭлементХДТО(ДокОбъектХДТО,XMLСтрока(РеквизитыШапки.КодОперации),"КодОперации",		"КодыОперацийОстатки",	ПространствоИмен_ЕЕ);	
	
	ТипЦен	=	?(ЗначениеЗаполнено(РеквизитыШапки.ТипЦен_Базовый),РеквизитыШапки.ТипЦен_Базовый,РеквизитыШапки.ТипЦен);
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,	"ТипЦен",		XMLСтрока(ТипЦен));
	
	ТипЦенРаспродажа =	?(ЗначениеЗаполнено(РеквизитыШапки.ТипЦенРаспродажа_Базовый),РеквизитыШапки.ТипЦенРаспродажа_Базовый,РеквизитыШапки.ТипЦенРаспродажа);
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,	"ТипЦенРаспродажа",	ВыгрузитьСпр_ТипыЦен_Элемент_КС(ТипЦенРаспродажа));
	
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,	"ТипСкидок",	XMLСтрока(РеквизитыШапки.ТипСкидок));
	
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,	"Организация",	ВыгрузитьСпр_Организации_КС(РеквизитыШапки.Организация));
	ДокОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,	"Подразделение",ВыгрузитьСпр_Подразделения_Элемент_КС(РеквизитыШапки.Подразделение));
	
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.Проведен,			"Проведен",			"boolean", 				ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ДокОбъектХДТО,РеквизитыШапки.ПометкаУдаления,	"ПометкаУдаления",	"boolean", 				ПространствоИмен_СТ);
	
	Возврат ДокОбъектХДТО;
КонецФункции //ВыгрузитьДок_Чек(ДокВыборка)

Функция ВыгрузитьДок_ЭПС_СПН(ДокВыборка)
	ИмяТаблицы	= Метаданные.Документы.ЭмиссияПодарочныхСертификатов.ПолноеИмя();
	ИмяТипаХДТО	= "Документ.СписаниеТМЦ";
	
	ВхПараметр	= РазобратьВходнойПараметр(ДокВыборка,ИмяТаблицы);
	Если НЕ ВхПараметр.Результат Тогда Возврат Неопределено КонецЕсли; 
	
	РеквизитыШ	= ПолучитьРеквизитыДляВыгрузки(ВхПараметр,"");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШ.ВерсияДанных) Тогда Возврат Неопределено КонецЕсли;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ИменаТЧ	= "Сертификаты";
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,РеквизитыШ,,ИменаТЧ);		
	
	ОбъектХДТО.СостояниеНакладной	= Перечисления.СостоянияНакладной.Отгружена;
	ДобавитьЭлементХДТО(ОбъектХДТО,""+ДокВыборка.КодОперации,"КодОперацииЭПС","string",ПространствоИмен_СТ);
	
	ВыборкаПоСертификатам	= ПолучитьВыборкуПС(РеквизитыШ.Ссылка);
	
	ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты",ПространствоИмен_ЕЕ);
	Пока ВыборкаПоСертификатам.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСертификатам.Сертификат) Тогда Продолжить КонецЕсли;
		
		СтрокаТЧ_ХДТО						= СоздатьОбъектХДТО(ИмяТипаХДТО+".Сертификаты.Строка",ПространствоИмен_ЕЕ);
		СтрокаТЧ_ХДТО.ПодарочныйСертификат	= ВыборкаПоСертификатам.Сертификат;
		
		ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);	
	КонецЦикла; 
	КоличествоСертификатов	= ТЧ_ХДТО.Строка.Количество();
	Если КоличествоСертификатов>0 Тогда
		ОбъектХДТО.Сертификаты	= ТЧ_ХДТО;
	КонецЕсли;	
	
	ТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары",ПространствоИмен_ЕЕ);
	
	СтрокаТЧ_ХДТО								= СоздатьОбъектХДТО(ИмяТипаХДТО+".Товары.Строка",ПространствоИмен_ЕЕ);
		
	СтрокаТЧ_ХДТО.Номенклатура					= РеквизитыШ.Номенклатура.Родитель;
	СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры	= РеквизитыШ.Номенклатура;
	СтрокаТЧ_ХДТО.Количество					= КоличествоСертификатов;		
		
	ТЧ_ХДТО.Строка.Добавить(СтрокаТЧ_ХДТО);
	
	Если ТЧ_ХДТО.Строка.Количество()>0 Тогда
		ОбъектХДТО.Товары	= ТЧ_ХДТО;
	КонецЕсли;
	
	Возврат ОбъектХДТО;	
КонецФункции //ВыгрузитьДок_СПН(ДокВыборка)


Функция ПолучитьВыборкуПС(ДокСсылка)
	Запрос			= Новый ("Запрос");
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ТЧ_ЭПС.КодСертификата	КАК КодСертификата,
	|	СпрСертификаты.Ссылка 	КАК Сертификат
	|ИЗ
	|	Документ.ЭмиссияПодарочныхСертификатов.Сертификаты КАК ТЧ_ЭПС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ПодарочныеСертификаты КАК СпрСертификаты
	|ПО
	|	СпрСертификаты.КодСертификата	= ТЧ_ЭПС.КодСертификата	
	|ГДЕ
	|	ТЧ_ЭПС.Ссылка	= &ДокСсылка
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Возврат Выборка;
КонецФункции // ()
 

Функция Номер_Z_Отчета(Дата,Касса)
	Результат	= 0;
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер_Z_Отчета) КАК Номер_Z_Отчета
	|ИЗ
	|   Документ.ОтчетКассовойСмены
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Дата,ДЕНЬ)= &Дата 
	|	И Касса	= &Касса
	|";
	
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Касса",Касса);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Номер_Z_Отчета) Тогда
		Результат	= Выборка.Номер_Z_Отчета;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //Номер_Z_Отчета(Дата,Касса)

Функция ДобавитьСостояниеНакладной(ОбъектХДТО,СостояниеНакладной,ДопИмя="")
	Если ЗначениеЗаполнено(СостояниеНакладной) Тогда
		СостояниеXDTO	= СоздатьЗначениеХДТО("СостоянияНакладной",ИмяЗначенияПеречисления(СостояниеНакладной),ПространствоИмен_ЕЕ);	
		ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен_ЕЕ,"СостояниеНакладной"+ДопИмя,СостояниеXDTO);	
	КонецЕсли;	
КонецФункции // ()

Функция Выгрузить_ОбщиеСвойстваОперацияККМ(ДокСсылка)
	ОбектXDTO			= СоздатьОбъектХДТО("ОбщиеСвойстваОперацияККМ");	
	
	ОбектXDTO.Валюта	= ВалютаРубХДТО;
	ОбектXDTO.Сумма		= ДокСсылка.СуммаДокумента;
	ОбектXDTO.Кассир	= ВыгрузитьСпр_Пользователи_Элемент_КС(ДокСсылка.Автор);
	
	Возврат ОбектXDTO;
КонецФункции //Выгрузить_ОбщиеСвойстваОперацияККМ(ДокСсылка)

Функция ПодразделениеТипаЦен(ТипЦен)
	Результат	= Справочники.Подразделения.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрПодразделения.Ссылка КАК Подразделение	
	|ИЗ
	|	Справочник.Подразделения КАК СпрПодразделения
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ПланОбмена.Основной КАК ПланОбмена	
	|ПО
	|	ПланОбмена.Код	=  СпрПодразделения.КодФизическогоУзла77
	|ГДЕ
	|	(РозничныйТипЦен = &ТипЦен
	|	ИЛИ РозничныйТипЦенРаспродажа = &ТипЦен)
	|	И (НЕ ПланОбмена.ПометкаУдаления ИЛИ ПланОбмена.ВерсияДанных ЕСТЬ NULL)
	|";
	
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);	
	
	Выборка		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат	= Выборка.Подразделение;			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПодразделениеТипаЦен(ТипЦен)

Функция ПодразделениеТипаСкидок(ТипСкидок)
	Результат	= Справочники.Подразделения.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрПодразделения.Ссылка КАК Подразделение	
	|ИЗ
	|	Справочник.Подразделения КАК СпрПодразделения
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ПланОбмена.Основной КАК ПланОбмена	
	|ПО
	|	ПланОбмена.Код	=  СпрПодразделения.КодФизическогоУзла77
	|ГДЕ
	|	РозничныйТипСкидок = &ТипСкидок	
	|	И (НЕ ПланОбмена.ПометкаУдаления ИЛИ ПланОбмена.ВерсияДанных ЕСТЬ NULL)
	|";
	
	Запрос.УстановитьПараметр("ТипСкидок",ТипСкидок);	
	
	Выборка		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат	= Выборка.Подразделение;			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПодразделениеТипаСкидок(ТипСкидок)

Функция ВыгрузитьСправочник(СсылкаНаОбъект,ВариантВыгрузки=0)		
	ОбъектХДТО	= Неопределено;
	ВидОбъекта	= СсылкаНаОбъект.Метаданные().Имя;
	
	
	Если ВидОбъекта="Номенклатура" Тогда
		Если ВариантВыгрузки=0 Тогда
			ОбъектХДТО	= ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент(СсылкаНаОбъект);
			//ВыгружаемыеХарактеристки.Добавить(СсылкаНаОбъект);
		ИначеЕсли ВариантВыгрузки=1 Тогда
			ОбъектХДТО = ВыгрузитьСпр_Номенклатура_Элемент(СсылкаНаОбъект);
		ИначеЕсли ВариантВыгрузки=2 Тогда
			ОбъектХДТО = ВыгрузитьСпр_Номенклатура_Группа(СсылкаНаОбъект);			
		КонецЕсли; 
		//Реквизиты	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"Родитель,ЭтоГруппа");
		//Если НЕ Реквизиты.ЭтоГруппа И ЗначениеЗаполнено(Реквизиты.Родитель) Тогда
		//	ВыгрузитьХарактеристикиПоСписку(СсылкаНаОбъект);										
		//КонецЕсли;		
	ИначеЕсли ВидОбъекта="ШтрихКоды" Тогда
		ОбъектХДТО = ВыгрузитьСпр_ШтрихКоды_Элемент(СсылкаНаОбъект);		
	ИначеЕсли ВидОбъекта="Подразделения" Тогда
		ОбъектХДТО = ВыгрузитьСпр_Подразделения_Элемент(СсылкаНаОбъект);
	ИначеЕсли ВидОбъекта="Организации" Тогда
		ОбъектХДТО = ВыгрузитьСпр_Организации_Элемент(СсылкаНаОбъект);		
	ИначеЕсли ВидОбъекта="Цвета" Тогда
		ОбъектХДТО = ВыгрузитьСпр_Цвета_Элемент(СсылкаНаОбъект);		
	ИначеЕсли ВидОбъекта="Кассы" Тогда
		ОбъектХДТО = ВыгрузитьСпр_Кассы_Элемент(СсылкаНаОбъект);
	ИначеЕсли ВидОбъекта="Пользователи" Тогда
		ОбъектХДТО	= ВыгрузитьСпр_Пользователи_Элемент(СсылкаНаОбъект);
	ИначеЕсли ВидОбъекта="Склады" Тогда
		ОбъектХДТО	= ВыгрузитьСпр_Склады_Элемент(СсылкаНаОбъект);
	КонецЕсли;	
	
	
	Возврат ОбъектХДТО;
КонецФункции

Функция ПолучитьВыборкуТЧ(ДокВыборка,ИмяТЧ="Товары")
	Результат		= Неопределено;
	НаВходеВыборка	= (ТипЗнч(ДокВыборка)=Тип("ВыборкаИзРезультатаЗапроса"));
	Если НаВходеВыборка Тогда
		Результат	= ДокВыборка[ИмяТЧ].Выбрать();
	Иначе		
		Запрос	= Новый Запрос;	
		
		Запрос.Текст="
		|ВЫБРАТЬ	
		|	Номенклатура.Родитель 	КАК Номенклатура,
		|	Номенклатура			КАК Характеристика,			
		|	Номенклатура			КАК ХарактеристикаНоменклатуры,
		|	*
		|ИЗ
		|	Документ."+ДокВыборка.Метаданные().Имя+"."+ИмяТЧ+"
		|ГДЕ
		|	Ссылка=&Ссылка
		|УПОРЯДОЧИТЬ ПО 
		|	НомерСтроки
		|";	
		
		Запрос.УстановитьПараметр("Ссылка",ДокВыборка);
		
		Результат = Запрос.Выполнить().Выбрать();		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьДанныеТЧ_Товары(Ссылка)

Функция ПолучитьДанныеТЧ_Прайс(Ссылка,ОтборРС=Неопределено)
	Запрос	= Новый Запрос;		
	
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ВЫБОР 
	|		КОГДА ТипЦен.Базовый<>ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка) ТОГДА ТипЦен.Базовый 
	|		ИНАЧЕ ТипЦен 
	|	КОНЕЦ КАК ТипЦен,
	|	Номенклатура					КАК Номенклатура,
	|	Номенклатура.Код				КАК Номенклатура_Код,
	|	Номенклатура.Наименование		КАК Номенклатура_Наименование,
	|	Номенклатура.КодПроизводителя	КАК Номенклатура_Артикул,	
	|
	|	Цена	
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК Цены
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК Спр
	|ПО
	|	Спр.Родитель=Цены.Номенклатура И НЕ Спр.ЭтоГруппа 
	|ГДЕ
	|	Прайс=&Ссылка
	|	И НЕ Спр.Ссылка ЕСТЬ NULL
	|";	
	
	Если ЗначениеЗаполнено(ОтборРС) Тогда
		ЧтениеXML	= Новый ЧтениеXML();
		
		ЧтениеXML.УстановитьСтроку(ОтборРС);
		ЧтениеXML.Прочитать();
		
		НЗ	= СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			
	КонецЕсли; 
	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	
	ТР=Запрос.Выполнить().Выгрузить();
	
	ТР.Колонки.Добавить("ДанныеНоменклатуры");	
	
	Сч=0;	
	Для Каждого СтрокаТЧ ИЗ ТР Цикл
		ДанныеНоменклатуры	= Новый Структура();
		
		ДанныеНоменклатуры.Вставить("Номенклатура",	ЗаполнитьПоляПоВыборке(СтрокаТЧ,"Номенклатура",		"Ссылка,Код,Наименование,Артикул"));		
		
		СтрокаТЧ.ДанныеНоменклатуры	= ДанныеНоменклатуры;		
		
		Сч=Сч+1;
		Если Сч%10=0 Тогда
			Состояние_(Сч);		
		КонецЕсли; 
	КонецЦикла;	
	
	Возврат ТР;
КонецФункции //ПолучитьДанныеТЧ_Товары(Ссылка)

Функция ПолучитьДанныеТЧ_УстановкаСкидок(Ссылка,ОтборРС=Неопределено)
	Запрос	= Новый Запрос;		
	
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ВЫБОР 
	|		КОГДА ТипСкидок.Базовый<>ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка) ТОГДА ТипСкидок.Базовый 
	|		ИНАЧЕ ТипСкидок 
	|	КОНЕЦ КАК ТипСкидок,
	|	Номенклатура					КАК Номенклатура,
	|	Номенклатура.Код				КАК Номенклатура_Код,
	|	Номенклатура.Наименование		КАК Номенклатура_Наименование,
	|	Номенклатура.КодПроизводителя	КАК Номенклатура_Артикул,	
	|
	|	Скидка	
	|ИЗ
	|	РегистрСведений.СкидкиНоменклатуры КАК Скидки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК Спр
	|ПО
	|	Спр.Родитель=Скидки.Номенклатура И НЕ Спр.ЭтоГруппа 
	|ГДЕ
	|	Документ=&Ссылка
	|	И НЕ Спр.Ссылка ЕСТЬ NULL
	|";	
	
	Если ЗначениеЗаполнено(ОтборРС) Тогда
		ЧтениеXML	= Новый ЧтениеXML();
		
		ЧтениеXML.УстановитьСтроку(ОтборРС);
		ЧтениеXML.Прочитать();
		
		НЗ	= СериализаторXDTO.ПрочитатьXML(ЧтениеXML);			
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	
	ТР=Запрос.Выполнить().Выгрузить();
	
	ТР.Колонки.Добавить("ДанныеНоменклатуры");	
	
	Сч=0;	
	Для Каждого СтрокаТЧ ИЗ ТР Цикл
		ДанныеНоменклатуры	= Новый Структура();
		
		ДанныеНоменклатуры.Вставить("Номенклатура",	ЗаполнитьПоляПоВыборке(СтрокаТЧ,"Номенклатура","Ссылка,Код,Наименование,Артикул"));		
		
		СтрокаТЧ.ДанныеНоменклатуры	= ДанныеНоменклатуры;		
		
		Сч=Сч+1;
		Если Сч%10=0 Тогда
			Состояние_(Сч);		
		КонецЕсли; 
	КонецЦикла;	
	
	Возврат ТР;
КонецФункции //ПолучитьДанныеТЧ_УстановкаСкидок(Ссылка,ОтборРС=Неопределено)

Функция ПолучитьРеквизитыНоменклатуры(Ссылка)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	"+ТекстЗапроса_Номенклатура_Элемент_Ревизиты()+"	
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Ссылка=&Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	
	ДанныеНом	= Новый Структура();
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		ДанныеНом.Вставить("Номенклатура",		ЗаполнитьПоляПоВыборке(Выборка,"Номенклатура",		"Ссылка,Код,Наименование,Артикул"));
		
		Характеристика	= ЗаполнитьПоляПоВыборке(Выборка,"Характеристика",	"Ссылка,Код,Наименование");		
		
		Характеристика.Вставить("Цвет",			ЗаполнитьПоляПоВыборке(Выборка,"Цвет",				"Родитель,Ссылка,Код,Наименование"));
		Характеристика.Вставить("Размер",		ЗаполнитьПоляПоВыборке(Выборка,"Размер",			"Родитель,Ссылка,Код,Наименование"));		 
		
		ДанныеНом.Вставить("Характеристика",	Характеристика);				
	КонецЕсли;
	
	Возврат ДанныеНом;
КонецФункции //ПолучитьРеквизитыНоменклатуры(Ссылка)


Функция ТекстЗапроса_Номенклатура_Элемент_Ревизиты()
	Результат="
	|	Номенклатура.Родитель					КАК Номенклатура,
	|	Номенклатура.Родитель.Код				КАК Номенклатура_Код,
	|	Номенклатура.Родитель.Наименование		КАК Номенклатура_Наименование,
	|	Номенклатура.Родитель.КодПроизводителя	КАК Номенклатура_Артикул,
	|
	|	Номенклатура.Ссылка						КАК Характеристика,					
	|	Номенклатура.Код						КАК Характеристика_Код,
	|	Номенклатура.Наименование				КАК Характеристика_Наименование,
	|
	|	Номенклатура.Цвет						КАК Цвет,					
	|	Номенклатура.Цвет.Код					КАК Цвет_Код,
	|	Номенклатура.Цвет.Наименование			КАК Цвет_Наименование,	
	|
	|	Номенклатура.Цвет.Родитель				КАК Цвет_Родитель,
	|	Номенклатура.Цвет.Родитель.Код			КАК Цвет_Родитель_Код,
	|	Номенклатура.Цвет.Родитель.Наименование	КАК Цвет_Родитель_Наименование,
	|
	|	Номенклатура.Размер						КАК Размер,					
	|	Номенклатура.Размер.Код					КАК Размер_Код,
	|	Номенклатура.Размер.Наименование		КАК Размер_Наименование,
	|
	|	Номенклатура.Размер.Родитель				КАК Размер_Родитель,
	|	Номенклатура.Размер.Родитель.Код			КАК Размер_Родитель_Код,
	|	Номенклатура.Размер.Родитель.Наименование	КАК Размер_Родитель_Наименование
	|";

	Возврат Результат;
КонецФункции //ТекстЗапроса_Номенклатура_Элемент_Ревизиты()
 

Функция ЗаполнитьПоляПоВыборке(Выборка,Префикс,Поля)
	Результат=Новый Структура(Поля);	
	
	Для Каждого Элемент Из Результат Цикл
		ИмяПоля=Элемент.Ключ;
		Если ИмяПоля="Ссылка" Тогда
			Ссылка	= Выборка[Префикс];
			
			Результат.Вставить("УИД",	XMLСтрока(Ссылка));
			Результат.Вставить("Ссылка",Ссылка);
		ИначеЕсли ИмяПоля="Родитель" Тогда
			Ссылка	= Выборка[Префикс+"_"+ИмяПоля];
			
			Результат.Вставить("Родитель_УИД",		XMLСтрока(Ссылка));
			Результат.Вставить("Родитель_Ссылка",	Ссылка);			
		Иначе
			Результат.Вставить(Элемент.Ключ,Выборка[Префикс+"_"+ИмяПоля]);
		КонецЕсли;			
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ЗаполнитьПоляПоВыборке(Выборка,Префикс,Поля)

Процедура ИнициализироватьКэш()
	Кэши	= Новый Соответствие;	
КонецПроцедуры

Функция ФранчПодразделениеСсылки(СсылкаНаОбъект)
	Результат	= Справочники.Подразделения.ПустаяСсылка();
	
	Запрос=Новый Запрос;
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ			
	|	ЗначениеРеквизита КАК Подразделение
	|ИЗ	
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	Справочник	 	= &СсылкаНаОбъект
	|	И ИмяРеквизита	= ""ПодразделениеФранчайзинга""
	|";
	Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат	= Выборка.Подразделение;	
	КонецЕсли; 

	Возврат Результат;
КонецФункции //ФранчПодразделениеСсылки(Договор)

Функция ВыгрузитьТЧвХДТО(ВыборкаТЧ,ИмяТипаХДТО,ПостоянныеРеквизитыТЧ=Неопределено)
	ОбъектХДТО_ТЧ		= СоздатьОбъектХДТО(ИмяТипаХДТО,ПространствоИмен_ЕЕ);
	
	ИмяТипаХДТО_Строка	= ИмяТипаХДТО+".Строка";
	
	ЕстьПостоянныеРеквизиты	= (ЗначениеЗаполнено(ПостоянныеРеквизитыТЧ));
	
	Пока ВыборкаТЧ.Следующий() Цикл
		СтрокаТЧ_ХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО_Строка,ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаТЧ);
		
		Если ЕстьПостоянныеРеквизиты Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ПостоянныеРеквизитыТЧ);
		КонецЕсли;
			
		ОбъектХДТО_ТЧ.Строка.Добавить(СтрокаТЧ_ХДТО);
	КонецЦикла;	
	
	Возврат ОбъектХДТО_ТЧ;
КонецФункции // ()

Функция ПрочитатьЗначениеСвойства(Объект,Свойство)
	МЗ = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	
	МЗ.Объект 	= Объект;
	МЗ.Свойство = Свойство;
	
	МЗ.Прочитать();
	
	Возврат МЗ.Значение;
	
КонецФункции // ()

#КонецОбласти


#Область Выгрузка_ПланыОбмена

Функция ВыгрузитьПО_Основной(Ссылка)
	ОбъектХДТО	= СоздатьОбъектХДТО("ПланОбмена.Основной",ПространствоИмен_ЕЕ);
	
	ОбъектХДТО.Код				= Ссылка.Код;
	ОбъектХДТО.Наименование		= Ссылка.Наименование;
	ОбъектХДТО.Подразделение	= СериализаторXDTO.XMLСтрока(Ссылка.Подразделение);
	ОбъектХДТО.ЭтотУзел			= (Ссылка=ПланыОбмена.Основной.ЭтотУзел());
	
	Возврат ОбъектХДТО;
КонецФункции

Функция ВыгрузитьПО_ОбменСТЦ(Ссылка)
	ОбъектХДТО	= СоздатьОбъектХДТО("ПланОбмена.ОбменСТЦ",ПространствоИмен_ЕЕ);
	
	ОбъектХДТО.Код				= Ссылка.Код;
	ОбъектХДТО.Наименование		= Ссылка.Наименование;
	ОбъектХДТО.Подразделение	= СериализаторXDTO.XMLСтрока(Ссылка.Подразделение);
	ОбъектХДТО.ЭтотУзел			= (Ссылка=ПланыОбмена.Основной.ЭтотУзел());
	
	Возврат ОбъектХДТО;
КонецФункции
	
#КонецОбласти  


#Область Выгрузка_РегистрыСведений


Функция ДействующийТипЦен(ТипЦен)
	ИмяТипа	= "Справочник.ТиыЦен";
	ТипЦенВКэше=ПолучитьИзКэша(ТипЦен,ИмяТипа);
	Если ТипЦенВКэше=Неопределено Тогда
		Если ТипЦен.Базовый.Пустая() Тогда
			ТипЦенВКэше=ТипЦен;
		Иначе
			ТипЦенВКэше=ТипЦен.Базовый;
		КонецЕсли;
		
		ВставитьВКэш(ТипЦен,ТипЦенВКэше,ИмяТипа);
	КонецЕсли; 
	
	Возврат ТипЦенВКэше;
КонецФункции //ДействующийТипЦен(ТипЦен)
 
Функция ДействующийТипСкидок(ТипСкидок)
	ИмяТипа		= "Справочник.ТиыСкидок";
	СсылкаВКэше	= ПолучитьИзКэша(ТипСкидок,ИмяТипа);
	Если СсылкаВКэше=Неопределено Тогда
		Если ТипСкидок.Базовый.Пустая() Тогда
			СсылкаВКэше=ТипСкидок;
		Иначе
			СсылкаВКэше=ТипСкидок.Базовый;
		КонецЕсли;
		
		ВставитьВКэш(ТипСкидок,СсылкаВКэше,ИмяТипа);
	КонецЕсли; 
	
	Возврат СсылкаВКэше;
КонецФункции //ДействующийТипСкидок(ТипЦен)

Функция ВыгрузитьРС_ЗначенияСвойствОбъектов(Отбор)	
	Возврат ВыгрузитьРС_СТАНДАРТНО(РегистрыСведений.ЗначенияСвойствОбъектов,Отбор);	
КонецФункции //ВыгрузитьРС_ЗначенияСвойствОбъектов(Отбор)

Функция ВыгрузитьРС_История(Отбор)	
	НЗ			= РегистрыСведений.История.СоздатьНаборЗаписей();	
	ИмяТипаХДТО	= "РегистрСведений.История"; 
	
	Для Каждого Элемент_Ист Из Отбор Цикл
		Если Элемент_Ист.Использование И Элемент_Ист.ПутьКДанным<>"Документ" Тогда
			Элемент_Пол	= НЗ.Отбор[Элемент_Ист.Имя];
			ЗаполнитьЗначенияСвойств(Элемент_Пол,Элемент_Ист,"ВидСравнения,Использование,Значение");
		КонецЕсли;	
	КонецЦикла; 
		
	СтрокиКУдалению=Новый Массив;
	НЗ.Прочитать();
	Сч=НЗ.Количество()-1;
	Пока Сч>=0 Цикл
		Если НЗ[Сч].Реквизит="ЦенаПоследнегоПрихода" Тогда
			НЗ.Удалить(НЗ[Сч]);				
		КонецЕсли;
		Сч=Сч-1;	
	КонецЦикла;	
	Для Каждого Запись Из НЗ Цикл
		Запись.Документ=Неопределено;	
	КонецЦикла; 
	
	ОбъектХДТО	= СериализаторXDTO.ЗаписатьXDTO(НЗ);	
	
	Возврат Новый Структура("ОбъектХДТО,ВыгруженоЗаписей",ОбъектХДТО,НЗ.Количество());	
КонецФункции //ВыгрузитьРС_История(Отбор)

Функция ВыгрузитьРС_КоличествоПосетителей_ЕЕ(Отбор)	
	ИмяТаблицы	= "РегистрСведений.КоличествоПосетителей";
	Вид			= "КоличествоПосетителей";
	
	НЗ	= РегистрыСведений[Вид].СоздатьНаборЗаписей();
	ЗаполнитьОтборНЗ(НЗ,Отбор);
	НЗ.Прочитать();
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТаблицы+".НаборЗаписей",ПространствоИмен_ЕЕ);
	
	ОтборХДТО	= СоздатьОбъектХДТО(ИмяТаблицы+".Отбор",ПространствоИмен_ЕЕ);
	ОтборХДТО.Дата			= НЗ.Отбор.Дата.Значение;
	ОтборХДТО.Подразделение	= НЗ.Отбор.Подразделение.Значение;	
	
	ОбъектХДТО.Отбор	= ОтборХДТО;
	
	Для Каждого Запись Из НЗ Цикл
		ЗаписьХДТО	= СоздатьОбъектХДТО(ИмяТаблицы+".Запись",ПространствоИмен_ЕЕ);	
		ЗаполнитьЗначенияСвойств(ЗаписьХДТО,Запись);
		
		ЗаписьХДТО.Количество	= Запись.КоличествоПосетителей;
		
		ОбъектХДТО.Строка.Добавить(ЗаписьХДТО);
	КонецЦикла;
		
	Возврат Новый Структура("ОбъектХДТО,ВыгруженоЗаписей",ОбъектХДТО,ОбъектХДТО.Строка.Количество());
КонецФункции //ВыгрузитьРС_КоличествоПосетителей_ЕЕ(Отбор)

Функция ВыгрузитьРС_КурсыВалют(Отбор)	
	Возврат ВыгрузитьРС_СТАНДАРТНО(РегистрыСведений.КурсыВалют,Отбор);	
КонецФункции //ВыгрузитьРС_КурсыВалют(Отбор)

Функция ВыгрузитьРС_РеквизитыСправочников(Отбор)	
	НЗ			= РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
	ИмяТипаХДТО	= "РегистрСведений.ЗначенияСвойствОбъектов"; 
	
	ЗаполнитьОтборНЗ(НЗ,Отбор);
	
	Свойство		= ВыгрузитьПвх_СвойстваОбъектов_Элемент_КС(НЗ.Отбор.ИмяРеквизита.Значение);
	
	ОбъектХДТО		= СоздатьОбъектХДТО(ИмяТипаХДТО+".НаборЗаписей",		ПространствоИмен_ЕЕ);
	
	ОтборХДТО		= СоздатьОбъектХДТО(ИмяТипаХДТО+".НаборЗаписей.Отбор",	ПространствоИмен_ЕЕ);
	
	ОтборХДТО.Объект	= НЗ.Отбор.Справочник.Значение;
	ОтборХДТО.Свойство	= Свойство;
	//ОтборХДТО.Документ	= НЗ.Отбор.Документ.Значение;		
	
	НЗ.Прочитать();
	Для Каждого Запись Из НЗ Цикл				
		СтрокаХДТО		= СоздатьОбъектХДТО(ИмяТипаХДТО+".Запись",		ПространствоИмен_ЕЕ);			
		
		СтрокаХДТО.Объект	= Запись.Справочник;
		СтрокаХДТО.Свойство	= Свойство;
		СтрокаХДТО.Значение	= Запись.ЗначениеРеквизита;		
		
		ОбъектХДТО.Строка.Добавить(СтрокаХДТО);
	КонецЦикла;
	
	ОбъектХДТО.Отбор	= ОтборХДТО;
	
	Возврат Новый Структура("ОбъектХДТО,ВыгруженоЗаписей",ОбъектХДТО,НЗ.Количество());	
КонецФункции //ВыгрузитьРС_РеквизитыСправочников(Отбор)

Функция ВыгрузитьРС_СкидкиНоменклатуры(Отбор)	
	НЗ			= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();	
	ИмяТипаХДТО	= "РегистрСведений.СкидкиНоменклатуры";	
	
	Документ = Неопределено;
	
	Для Каждого Элемент_Ист Из Отбор Цикл
		Если Элемент_Ист.Использование Тогда
			Элемент_Пол	= НЗ.Отбор[Элемент_Ист.Имя];
			ЗаполнитьЗначенияСвойств(Элемент_Пол,Элемент_Ист,"ВидСравнения,Использование,Значение");
			
			Если Элемент_Ист.Имя = "Документ" Тогда
				Документ = Элемент_Ист.Значение;			
			КонецЕсли; 
		КонецЕсли;	
	КонецЦикла;	
	
	ОбъектХДТО			= СоздатьОбъектХДТО(ИмяТипаХДТО+".НаборЗаписей",		ПространствоИмен_ЕЕ);
	
	ОтборХДТО			= СоздатьОбъектХДТО(ИмяТипаХДТО+".НаборЗаписей.Отбор",	ПространствоИмен_ЕЕ);
	
	ДействующийТипСкидок= ДействующийТипСкидок(НЗ.Отбор.ТипСкидок.Значение);
	Если НЕ ЗначениеЗаполнено(ДействующийТипСкидок) И ЗначениеЗаполнено(Документ) Тогда
		ДействующийТипСкидок = ДействующийТипСкидок(ПолучитьРеквизитШапки(Документ, "ТипСкидок", "Документ"));
	КонецЕсли; 
	
	ОтборХДТО.ТипСкидок					= ДействующийТипСкидок;
	ОтборХДТО.ДокументУстановкаСкидок	= НЗ.Отбор.Документ.Значение;
	Если НЗ.Отбор.Номенклатура.Использование Тогда
		ОтборХДТО.Номенклатура	= НЗ.Отбор.Номенклатура.Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДействующийТипСкидок) Тогда
		НЗ.Прочитать();
		Для Каждого Запись Из НЗ Цикл				
			СтрокаХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО+".Запись",		ПространствоИмен_ЕЕ);
			
			ЗаполнитьЗначенияСвойств(СтрокаХДТО,Запись);		
			
			СтрокаХДТО.ДокументУстановкаСкидок	= Запись.Документ;
			СтрокаХДТО.ТипСкидок				= ДействующийТипСкидок;
			
			ОбъектХДТО.Строка.Добавить(СтрокаХДТО);
		КонецЦикла;	
	КонецЕсли;	
	
	ОбъектХДТО.Отбор	= ОтборХДТО;
	
	Возврат Новый Структура("ОбъектХДТО,ВыгруженоЗаписей",ОбъектХДТО,НЗ.Количество());	
КонецФункции //ВыгрузитьРС_СкидкиНоменклатуры(Отбор)

Функция ВыгрузитьРС_ЦеныНоменклатуры(Отбор)
	ИмяТипаХДТО	= "РегистрСведений.ЦеныНоменклатуры";
	
	НЗ	= РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	
	ОбязательныеИзмерения = Новый Структура("ТипЦен,Прайс",Неопределено,Неопределено);	
	
	Для Каждого Элемент_Ист Из Отбор Цикл
		Если Элемент_Ист.Использование Тогда
			Элемент_Пол = НЗ.Отбор[Элемент_Ист.Имя];
			ЗаполнитьЗначенияСвойств(Элемент_Пол,Элемент_Ист,"ВидСравнения,Использование,Значение");
			Если ОбязательныеИзмерения.Свойство(Элемент_Ист.Имя) Тогда
				ОбязательныеИзмерения[Элемент_Ист.Имя]	= Элемент_Ист.Значение;				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Измерение Из ОбязательныеИзмерения Цикл
		Если ТипЗнч(Измерение.Значение)=Тип("Булево") Тогда
			Возврат Неопределено;
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектХДТО	= СоздатьОбъектХДТО(ИмяТипаХДТО+".НаборЗаписей",	ПространствоИмен_ЕЕ);
	
	Если ЗначениеЗаполнено(ОбязательныеИзмерения.ТипЦен) Тогда
		ТекТипЦен = ОбязательныеИзмерения.ТипЦен;		
	ИначеЕсли ЗначениеЗаполнено(ОбязательныеИзмерения.Прайс) Тогда	
		ТекТипЦен	= ПолучитьРеквизитШапки(ОбязательныеИзмерения.Прайс,"ТипЦен");		
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	БазовыйТипЦен	= ПолучитьРеквизитШапки(ТекТипЦен,"Базовый");
	Если ЗначениеЗаполнено(БазовыйТипЦен) Тогда
		ТекТипЦен=БазовыйТипЦен;							
	КонецЕсли;
	
	НЗ.Прочитать();
	Для Каждого Запись Из НЗ Цикл				
		СтрокаХДТО				= СоздатьОбъектХДТО(ИмяТипаХДТО+".Запись",	ПространствоИмен_ЕЕ);
		
		ЗаполнитьЗначенияСвойств(СтрокаХДТО,Запись);
		
		СтрокаХДТО.ПрайсЛист	= Запись.Прайс;
		СтрокаХДТО.ТипЦен		= ТекТипЦен;
		
		ОбъектХДТО.Строка.Добавить(СтрокаХДТО);		
	КонецЦикла;
	
	ОтборХДТО			= СоздатьОбъектХДТО(ИмяТипаХДТО+".НаборЗаписей.Отбор",		ПространствоИмен_ЕЕ);
	
	ОтборХДТО.ПрайсЛист	= ОбязательныеИзмерения.Прайс;
	ОтборХДТО.ТипЦен	= ТекТипЦен;
	
	Если НЗ.Отбор.Номенклатура.Использование Тогда
		ОтборХДТО.Номенклатура	= НЗ.Отбор.Номенклатура.Значение;
	КонецЕсли;
	
	ОбъектХДТО.Отбор	= ОтборХДТО;
	
	Возврат Новый Структура("ОбъектХДТО,ВыгруженоЗаписей",ОбъектХДТО,НЗ.Количество());	
КонецФункции //ВыгрузитьРС_ЦеныНоменклатуры(Отбор)


Процедура ЗаполнитьОтборНЗ(НЗ,Отбор)
	Для Каждого Элемент_Ист Из Отбор Цикл
		Если Элемент_Ист.Использование Тогда
			Элемент_Пол	= НЗ.Отбор[Элемент_Ист.Имя];
			ЗаполнитьЗначенияСвойств(Элемент_Пол,Элемент_Ист,"ВидСравнения,Использование,Значение");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры


Функция ВыгрузитьРС_СТАНДАРТНО(Менеджер,Отбор)
	НЗ			= Менеджер.СоздатьНаборЗаписей();	
	ИмяТипаХДТО	= НЗ.Метаданные().ПолноеИмя(); 
	
	ЗаполнитьОтборНЗ(НЗ,Отбор);
	
	НЗ.Прочитать();
	ОбъектХДТО	= СериализаторXDTO.ЗаписатьXDTO(НЗ);	
	
	Возврат Новый Структура("ОбъектХДТО,ВыгруженоЗаписей",ОбъектХДТО,НЗ.Количество());	
КонецФункции

	
#КонецОбласти


#Область XDTO

Функция ПолучитьСхемуИзМакета(ИмяМакета)
	ЧтениеXML = Новый ЧтениеXML;    
	
	//УстановитьБезопасныйРежим(Ложь);
	
	ИмяВФ=ПолучитьИмяВременногоФайла("xsd");
	ДвоичныеДанные=ПолучитьМакет(ИмяМакета);
	ДвоичныеДанные.Записать(ИмяВФ);
    ЧтениеXML.ОткрытьФайл(ИмяВФ);   	
 
    ПостроительDOM	= Новый ПостроительDOM;
    ДокументДом		= ПостроительDOM.Прочитать(ЧтениеXML);   
	ЧтениеXML.Закрыть();
 
    ПостроительСхем = Новый ПостроительСхемXML;
    Схема 			= ПостроительСхем.СоздатьСхемуXML(ДокументДом);
	
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ИмяВФ);
	
	Возврат Схема;
КонецФункции // ()

Функция СоздатьМоюФабрикуХДТО() Экспорт
	
	НаборСхем	= Новый НаборСхемXML;	
//	НаборСхем.Добавить(ПолучитьСхемуИзМакета("ExchangeMessage_xsd"));
//	НаборСхем.Добавить(ПолучитьСхемуИзМакета("EnterpriseData_1_6_20_xsd"));	
//	НаборСхем.Добавить(ПолучитьСхемуИзМакета("EE_data_xsd"));
	
	НаборСхемТекКонф	= ФабрикаXDTO.ЭкспортСхемыXML("http://v8.1c.ru/8.1/data/enterprise/current-config");	
	Для Каждого Схема Из НаборСхемТекКонф Цикл
		НаборСхем.Добавить(Схема);	
	КонецЦикла;

	НаборСхемТекКонф	= ФабрикаXDTO.ЭкспортСхемыXML("http://www.1c.ru/SSL/Exchange/Message");	
	Для Каждого Схема Из НаборСхемТекКонф Цикл
		НаборСхем.Добавить(Схема);	
	КонецЦикла;
	
	НаборСхемТекКонф	= ФабрикаXDTO.ЭкспортСхемыXML("http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.6");	
	Для Каждого Схема Из НаборСхемТекКонф Цикл
		НаборСхем.Добавить(Схема);	
	КонецЦикла;
	
	НаборСхемТекКонф	= ФабрикаXDTO.ЭкспортСхемыXML("http://www.pf-soft.ru/ee-data");	
	Для Каждого Схема Из НаборСхемТекКонф Цикл
		НаборСхем.Добавить(Схема);	
	КонецЦикла;	
	
	//НаборСхемТекДоп	= ФабрикаXDTO.ЭкспортСхемыXML("http://www.1c.ru/SSL/Exchange/Message");
	//Для Каждого Схема Из НаборСхемТекДоп Цикл
	//	НаборСхем.Добавить(Схема);	
	//КонецЦикла;	
	
	Возврат Новый ФабрикаXDTO(НаборСхем);
КонецФункции //СоздатьФабрикуХДТО()

Функция СоздатьОбъектХДТО(ИмяТипа,Знач ВыбПространствоИмен="") Экспорт
	Если ПустаяСтрока(ВыбПространствоИмен) Тогда
		ВыбПространствоИмен=ПространствоИмен_ЕД;	
	КонецЕсли;
	
	Возврат Фабрика.Создать(Фабрика.Тип(ВыбПространствоИмен,ИмяТипа));
КонецФункции //СоздатьОбъектХДТО(ИмяТипа,Знач ВыбПространствоИмен="")

Функция СоздатьЗначениеХДТО(ИмяТипа,Значение,Знач ВыбПространствоИмен="")
	Если Значение=Неопределено ИЛИ Значение=NULL ИЛИ ПустаяСтрока(Значение) Тогда Возврат Неопределено КонецЕсли;
	
	Если ПустаяСтрока(ВыбПространствоИмен) Тогда
		ВыбПространствоИмен=ПространствоИмен_ЕД;	
	КонецЕсли;
	
	Возврат Фабрика.Создать(Фабрика.Тип(ВыбПространствоИмен,ИмяТипа),Значение);
КонецФункции //СоздатьЗначениеХДТО()

Процедура ДобавитьЭлементХДТО(ОбъектХДТО,Значение,ИмяПоля,ИмяТипа,ПространствоИмен)
	Если ЗначениеЗаполнено_(Значение) Тогда
		ЭлементXDTO	= СоздатьЗначениеХДТО(ИмяТипа,Значение,ПространствоИмен);
		ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен,ИмяПоля,ЭлементXDTO);
	КонецЕсли;	
КонецПроцедуры

Функция ДобавитьСвойствоХДТО(ОбъектХДТО,ЗначениеХДТО,ИмяПоля,ПространствоИмен)
	Если ЗначениеЗаполнено_(ЗначениеХДТО) Тогда
		ОбъектХДТО.Добавить(ФормаXML.Элемент,ПространствоИмен,ИмяПоля,ЗначениеХДТО);		
	КонецЕсли;
КонецФункции //ЗаписатьСвойствоХДТО(ОбъектХДТО,ЗначениеХДТО,ИмяПоля,ПространствоИмен)

Функция ПолучитьСвойствоХДТО(ОбъектХДТО,ИмяСвойства) Экспорт
	Результат	= Неопределено;
	Если ОбъектХДТО.Свойства().Получить(ИмяСвойства)<>Неопределено Тогда
		Результат	= ОбъектХДТО[ИмяСвойства];
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьСвойствоХДТО(ОбъектХДТО,ИмяСвойства)

Функция ЗаполненныеСвойстваХДТО(ОбъектХДТО)
	Результат	= Новый Структура;	
	Для Каждого Свойство Из ОбъектХДТО.Свойства() Цикл
		Значение	= ОбъектХДТО.Получить(Свойство);
		Если Значение<>Неопределено Тогда
			Результат.Вставить(Свойство,Значение);							
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции //ЗаполненныеСвойстваХДТО(ОбъектХДТО)


#КонецОбласти 



Функция ПолучитьПодразделениеЦО()
	Результат	= Справочники.Подразделения.ПустаяСсылка();
	
	ТекПО		= ПланыОбмена.Основной;
	ЭтотУзел	= ТекПО.ЭтотУзел();
	
	Выборка	= ТекПО.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления И Выборка.Ссылка<>ЭтотУзел Тогда
			Результат=Выборка.Подразделение;		
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ()

Функция ИмяЗначенияПеречисления(Значение)
	Возврат МетаЗначениеПеречисления(Значение).Имя;
КонецФункции // ()

Процедура ВыгрузитьПодразделениеЦО() Экспорт
	ИнициализироватьЗаписьXML();
	
	ОбъектХДТО	= ВыгрузитьСпр_Подразделения_Элемент(ПодразделениеЦО);
	Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);	
		
	ЗакрытьЗаписьXML();
КонецПроцедуры


#Область Обмены

Функция Строка_В_ДД(ИсходнаяСтрока)
	Поток = Новый ПотокВПамяти;
	
	ЗаписьТекста = Новый ЗаписьТекста(Поток) ;
	ЗаписьТекста.Записать(ИсходнаяСтрока);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанные;
КонецФункции // ()

Функция ДД_В_Строка(ДД)
	Поток = ДД.ОткрытьПотокДляЧтения();	
	
	ЧтениеТекста=Новый ЧтениеТекста(Поток,"UTF-8");
	
	Строка=ЧтениеТекста.Прочитать();
	
	Возврат Строка;	
КонецФункции // ()

Функция ОбъектСуществует(Ссылка, ИмяТаблицы) Экспорт
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 ВерсияДанных
	|
	|ИЗ "+ИмяТаблицы+"
	|ГДЕ Ссылка=&Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВерсияДанных));
КонецФункции //ОбъектСуществует(Ссылка,Таблица)

Функция ОтправитьСообщение(Данные,Ссылка,ОбъектТип,ОбъектСсылкаУИД,ОтборРС_Хэш="",ВариантВыгрузки,ВыгруженоЗаписей=0)
	Если НЕ ЗначениеЗаполнено(ТекПакет) Тогда
		ТекПакет	= СоздатьПакет("CO_FR");	
	КонецЕсли;
	
	ТекПакет.Размер	= ТекПакет.Размер+СтрДлина(Данные);
		
	ТекПакет.Данные.Добавить(Данные);
	ТекПакет.Ссылки.Добавить(Новый Структура("Ссылка,ОбъектТип,ОбъектСсылкаУИД,ОтборРС_Хэш,ВариантВыгрузки,ВыгруженоЗаписей",Ссылка,ОбъектТип,ОбъектСсылкаУИД,ОтборРС_Хэш,ВариантВыгрузки,ВыгруженоЗаписей));
	
	Если ТекПакет.Размер>=100000 Тогда
		ОтправитьПакет(ТекПакет);		
	КонецЕсли;	
КонецФункции //ОтправитьСообщение(КомпонентаОбмена,Строка)

Функция СоздатьПакет(Получатель,Тип="Данные") Экспорт	
	Пакет	= Новый Структура("
		|КлючОтправителя,КлючПолучателя,
		|Тип,Размер,Данные,Ссылки,
		|НачалоОбработки,ДатаОтправки,
		|ИД_Пакета,ИД_Сеанса",
		ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод(),Получатель,
		Тип,0,Новый Массив,Новый Массив,
		ТекущаяДата(),ТекущаяДата(),
		Новый УникальныйИдентификатор(),
		ИД_Сеанса);
		
	Возврат Пакет;
КонецФункции //СоздатьПакет(Получатель)

Функция ОтправитьПакет(Пакет)
	МассивСсылок	= Пакет.Ссылки;	
	Пакет.Ссылки	= "";
	Пакет.ДатаОтправки	= ТекущаяДата();
	
	Сообщение		= ПолучитьДвоичныеДанныеИзСтроки(ЗначениеВСтрокуВнутр(Пакет));
	
	ЗаписатьВЛог("Регламент","Обмен ФР. Начало отправки пакета. Получатель:"+Пакет.КлючПолучателя+". Размер: "+Пакет.Размер,"Информация",Ложь);
	
	НомерДоставки	= КомпонентаОбмена.ОтправитьСообщение("",Очередь,Сообщение);
	
	Сообщить_(НомерДоставки);
	
	Если НомерДоставки>0 Тогда
		Пакет.Ссылки	= МассивСсылок;
		ЗаписатьЭлементСтатистики_Отправка(Пакет);
		
		ОчиститьРегистрацию(МассивСсылок);		
		Сообщить_("Пакет отправлен. Размер: "+Пакет.Размер);		
	КонецЕсли;	
	
	Пакет	= Неопределено;
КонецФункции // ()

Процедура ОчиститьРегистрацию(МассивСсылок)
	//Возврат; //Временно отключили
	
	НачатьТранзакцию();
	
	Для Каждого ДанныеСсылки Из МассивСсылок Цикл
		РегистрыСведений.ФР_ОбъектыКВыгрузке.УдалитьРегистрацию(ДанныеСсылки.ОбъектТип,ДанныеСсылки.ОбъектСсылкаУИД,ДанныеСсылки.ОтборРС_Хэш,ДанныеСсылки.ВариантВыгрузки);		
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();	

КонецПроцедуры //ОчиститьРегистрацию(МассивСсылок)

Функция ЗаписатьЭлементСтатистики_Отправка(Пакет)
	ТекКодОтправителя	= ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод();
	
	СпрОбъект			= Справочники.ФР_СтатистикаОбменов.СоздатьЭлемент();
	
	ФР_ОбщегоНазначения_КС.СообщитьПользователю(СтрШаблон("Отправлен пакет, размер: %1 байт.",Пакет.Размер));
	
	СпрОбъект.Операция 			= 1; //0-Прием,1 - Отправка
	СпрОбъект.ИД_Сеанса			= Пакет.ИД_Сеанса;	
	СпрОбъект.УстановитьСсылкуНового(Справочники.ФР_СтатистикаОбменов.ПолучитьСсылку(Пакет.ИД_Пакета));
	СпрОбъект.РазмерСообщения   = Пакет.Размер;	
	СпрОбъект.Получатель		= Пакет.КлючПолучателя;
	СпрОбъект.Отправитель		= ТекКодОтправителя;
		
	Для Каждого СтрокаДанных Из Пакет.Ссылки Цикл
		СтрокаП	= СпрОбъект.ОбработанныеОбъекты.Добавить();
		
		СтрокаП.ОбъектТип 			= СтрокаДанных.ОбъектТип;
		СтрокаП.ОбъектСсылкаУИД 	= СтрокаДанных.ОбъектСсылкаУИД;
		СтрокаП.ОтборРС_Хэш 		= СтрокаДанных.ОтборРС_Хэш;
		СтрокаП.ВариантВыгрузки 	= СтрокаДанных.ВариантВыгрузки;		
		СтрокаП.ПредставлениеСсылки	= СтрокаДанных.Ссылка;
		СтрокаП.КоличествоЗаписей	= СтрокаДанных.ВыгруженоЗаписей;
		
		Если ФР_ОбщегоНазначения_ПИ.ЕстьСтатусыОбмена(СтрокаДанных.ОбъектТип) Тогда
			РегистрыСведений.ФР_СтатусыОбмена.УстановитьСтатус(СтрокаДанных.Ссылка,Перечисления.СтатусыОбмена.Отправлено,ТекКодОтправителя,Пакет.КлючПолучателя);
		КонецЕсли;
	КонецЦикла;		
		
	СпрОбъект.НачалоОбработки	= Пакет.НачалоОбработки;
	СпрОбъект.ДатаОтправки		= ТекущаяДата();
	СпрОбъект.Пользователь		= ПараметрыСеанса.Пользователь;	
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	= Истина;
	СпрОбъект.Записать();
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	= Ложь;
КонецФункции //ЗаписатьЭлементСтатистики_Отправка(Операция,Корреспондент,ДанныеОбмена,Ошибки)

Функция ЗаписатьЭлементСтатистики_Прием(РазмерСообщения,Пакет,Ошибки,НачалоОбработки,ИД_Сеанса,СообщениеСтрокой)
	Менеджер	= Справочники.ФР_СтатистикаОбменов;
	
	Если Пакет<>Неопределено Тогда
		Ссылка	=  Менеджер.ПолучитьСсылку(Пакет.ИД_Пакета);
		Если ОбъектСуществует(Ссылка,"Справочник.ФР_СтатистикаОбменов") Тогда
			СпрОбъект	= Ссылка.ПолучитьОбъект();
		Иначе
			СпрОбъект	= Менеджер.СоздатьЭлемент();
			СпрОбъект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли; 
		
		СпрОбъект.Получатель	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(Пакет,"КлючПолучателя");	
	Иначе
		СпрОбъект				= Менеджер.СоздатьЭлемент();		
	КонецЕсли;	
	
	СпрОбъект.Операция 			= 0; //0-Прием,1 - Отправка
	СпрОбъект.ИД_Сеанса			= ИД_Сеанса;	
	СпрОбъект.РазмерСообщения   = РазмерСообщения;
	
	СпрОбъект.Отправитель		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(Пакет,"КлючОтправителя");
	
	ТекКодПолучателя			= ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод();	
	
	Для Каждого СтрокаДанных Из ОбъектыОбмена Цикл
		СтрокаП	= СпрОбъект.ОбработанныеОбъекты.Добавить();
		
		СтрокаП.ОбъектТип 			= СтрокаДанных.ОбъектТип;
		СтрокаП.ОбъектСсылкаУИД 	= СтрокаДанных.ОбъектСсылкаУИД;
		СтрокаП.ОтборРС_Хэш 		= СтрокаДанных.ОтборРС_Хэш;
		СтрокаП.ВариантВыгрузки 	= СтрокаДанных.ВариантВыгрузки;		
		СтрокаП.ПредставлениеСсылки	= СтрокаДанных.Ссылка;
		
		СтрокаП.Ошибки				= СтрокаДанных.Ошибки;
		СтрокаП.СтатусЗаписи		= СтрокаДанных.СтатусЗаписи;
		СтрокаП.Действие			= СтрокаДанных.Действие;		
		
		СпрОбъект.ЕстьОшибки	= СпрОбъект.ЕстьОшибки ИЛИ НЕ ПустаяСтрока(СтрокаП.Ошибки);
		
		Если ЗначениеЗаполнено(СтрокаДанных.Ссылка) 
			И СтрНайти(СтрокаП.ВариантВыгрузки,"РегистрСведений.")=0 
			И ФР_ОбщегоНазначения_ПИ.ЕстьСтатусыОбмена(ЗначениеВСтрокуВнутр(ТипЗнч(СтрокаДанных.Ссылка))) Тогда
			РегистрыСведений.ФР_СтатусыОбмена.УстановитьСтатус(СтрокаДанных.Ссылка,Перечисления.СтатусыОбмена.Получено,СпрОбъект.Отправитель,ТекКодПолучателя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекстОшибки Из Ошибки Цикл		
		СпрОбъект.ЕстьОшибки	= Истина;
		
		СтрокаО	= СпрОбъект.ОшибкиОбмена.Добавить();
		СтрокаО.ТекстОшибки = ТекстОшибки;
	КонецЦикла; 
	
	Если СпрОбъект.ЕстьОшибки Тогда
		СпрОбъект.ДанныеСообщения   = Новый ХранилищеЗначения(СообщениеСтрокой,Новый СжатиеДанных(9));	
	КонецЕсли; 
	
	СпрОбъект.НачалоОбработки	= НачалоОбработки;
	СпрОбъект.ДатаОтправки		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(Пакет,"ДатаОтправки");
	СпрОбъект.ДатаПриемки		= ТекущаяДата();
	СпрОбъект.Пользователь		= ПараметрыСеанса.Пользователь;	
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	= Истина;
	СпрОбъект.Записать();
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	= Ложь;
КонецФункции //ЗаписатьЭлементСтатистики_Отправка(Операция,Корреспондент,ДанныеОбмена,Ошибки)

Функция ТипСсылки(ТипЗначения) Экспорт
	Результат = Новый Структура("Тип,Вид,ПолныйТип","","");
	
	МетаОбъект	= Метаданные.НайтиПоТипу(ТипЗначения);
	Если МетаОбъект <> Неопределено  Тогда
		ПолныйТип	= МетаОбъект.ПолноеИмя();
		Части		= СтрРазделить(ПолныйТип,".");
		
		Если Части.Количество()>=1 Тогда
			Результат.Тип=Части[0];
		КонецЕсли;
		Если Части.Количество()>=2 Тогда
			Результат.Вид=Части[1];			
		КонецЕсли;
		
		Результат.ПолныйТип=ПолныйТип;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ТипОбъекта(ТипЗначения) Экспорт

Функция СжатьДанные(Строка)
	Данные	= Новый ХранилищеЗначения(Строка,Новый СжатиеДанных(9));		
		
	Сообщение	= XMLСтрока(Данные);
	
	Возврат Сообщение;
КонецФункции //СжатьДанные(Строка)

Функция ПолучитьВыборкуОбъектов()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	//ПЕРВЫЕ 500
	|	ТипЗначения(СсылкаНаОбъект) КАК ТипСсылки,
	|	ОбъектСсылкаУИД,	
	|	ВариантВыгрузки,
	|	ОтборРС_Хэш
	|			
	|ИЗ
	|	РегистрСведений.ФР_ОбъектыКВыгрузке
	//|ГДЕ
	//|	СсылкаНаОбъект ССЫЛКА Документ.Перемещение
	|УПОРЯДОЧИТЬ ПО 
	|	Номер
	|";
	
	Выборка	= Запрос.Выполнить().Выбрать();

	Возврат Выборка;
КонецФункции
 
Функция ИнициализироватьЗаписьXML(ИмяФайлаВыгрузки="") Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	Если ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		ЗаписьXML.ОткрытьФайл(ИмяФайлаВыгрузки,,Ложь);
	Иначе
		ЗаписьXML.УстановитьСтроку();	
	КонецЕсли; 
    
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Message");
	
	ХедерXDTO					= Фабрика.Создать(Фабрика.Тип("http://www.1c.ru/SSL/Exchange/Message","Header"));
	
	ХедерXDTO.Format			= "1.6";
	ХедерXDTO.CreationDate  	= СериализаторXDTO.XMLСтрока(ТекущаяДата());	
	
	Если ЗначениеЗаполнено(УзелОтправитель) Тогда		
		КонфирмХДТО					= СоздатьОбъектХДТО("Confirmation",ПространствоИмен_ЕМ);
		
		КонфирмХДТО.ExchangePlan	= УзелОтправитель.Метаданные().Имя;	
		Если ЗначениеЗаполнено(УзелПолучатель) Тогда
			КонфирмХДТО.To			= XMLСтрока(УзелПолучатель.Код);			
		КонецЕсли;		
		КонфирмХДТО.From			= XMLСтрока(УзелОтправитель.Код);	
		
		ХедерXDTO.Confirmation		= КонфирмХДТО;	
	КонецЕсли;	
	
	ХедерXDTO.AvailableVersion.Добавить("1.6");
	
	Фабрика.ЗаписатьXML(ЗаписьXML,ХедерXDTO,,,,НазначениеТипаХМЛ);	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Body");
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("",		ПространствоИмен_ЕД);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("ee",	ПространствоИмен_ЕЕ);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", 	"http://www.w3.org/2001/XMLSchema");	
    ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", 	"http://www.w3.org/2001/XMLSchema-instance");

КонецФункции //ИнициализироватьЗаписьXML()

Функция ЗакрытьЗаписьXML()
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Message	
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции // ()

Функция ОтветитьНаЗапрос() Экспорт
	Узел_ЕЕ_ЦО 	= ПланыОбмена.ФР_ОбменСФРК.ЭтотУзел();
	Узел_ФР_ЦО	= ПланыОбмена.ФР_ОбменСФРК.Узел_ФранчБаза();
	
	ОбработкаКонвертации    = Неопределено;
	ДопПараметры 			= Неопределено; 
	
	
	//Если НЕ ИнициализироватьКомпонентуОбмена(Узел_ФР_ЦО) Тогда Возврат ложь КонецЕсли;
	
	Очередь="to_"+Узел_ЕЕ_ЦО.Код;
	
	//КомпонентаОбмена.НачатьПриемСообщений(Очередь);
	
	//Пока ПолучитьСообщение(КомпонентаОбмена,ОбработкаКонвертации,ДопПараметры) Цикл
		//Читаем пока есть что
	//КонецЦикла;
	
КонецФункции //ОтветитьНаЗапрос()


#КонецОбласти


#Область Кэши


Функция ИнициализироватьКэши(Кэши,Реквизиты) Экспорт
	Если Кэши=Неопределено Тогда
		Кэши	= Новый Соответствие;
	КонецЕсли;
	
	Для Каждого СтрокаТР Из Реквизиты Цикл
		ТипСтрокой=СтрокаТР.ТипСтрокой;
		Если СтрокаТР.Кэшировать Тогда
			Если Кэши.Получить(ТипСтрокой)=Неопределено Тогда
				Кэши.Вставить(ТипСтрокой,Новый Соответствие);		
			КонецЕсли;		
		КонецЕсли;		 		
	КонецЦикла;
	
	Возврат Кэши;
КонецФункции //ИнициализироватьКэши(Реквизиты)

Функция ПолучитьИзКэша(Ссылка,Знач ИмяТипа=Неопределено) Экспорт
	Результат  = Неопределено;
	
	Если ИмяТипа=Неопределено Тогда
		Попытка
			ИмяТипа	= Ссылка.Метаданные().ПолноеИмя();	
		Исключение
			Сообщить_("Ой");
		КонецПопытки;		
	КонецЕсли;
	
	ТекКэш		= Кэши.Получить(ИмяТипа); 
	
	Если ТекКэш <> Неопределено Тогда
		Результат = ТекКэш.Получить(Ссылка);	
	Иначе
		Кэши.Вставить(ИмяТипа,Новый Соответствие);
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьИзКэша(Ссылка)

Процедура ВставитьВКэш(Ссылка,Данные,Знач ИмяТипа=Неопределено) Экспорт
	Если ИмяТипа=Неопределено Тогда
		ИмяТипа		= Ссылка.Метаданные().ПолноеИмя();		
	КонецЕсли;
	
	ТекКэш		= Кэши.Получить(ИмяТипа); 	
	
	Если ТекКэш=Неопределено Тогда
		Кэши.Вставить(ИмяТипа,Новый Соответствие);	
	КонецЕсли; 
	
	Кэши[ИмяТипа][Ссылка]=Данные;
КонецПроцедуры

Функция ЦиклПоПорции_ПоместитьСсылкиВКэш(ИмяТаблицы,ЗапросСписка,ЗапросОбъектов,НачНомер,Кэши,РеквизитыДляВыгрузки)	
	ТипСсылки	= СформироватьТипСсылки(ИмяТаблицы,Истина);
	Менеджер	= ПолучитьМенеджерКласса(ИмяТаблицы);
	
	ЗапросСписка.УстановитьПараметр("НачНомер",	НачНомер);
	
	ТекНомер		= 0;
	
	ТаблицаСсылок	= Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("ОбъектТип",			ПолучитьОписаниеТиповСтроки(80));
	ТаблицаСсылок.Колонки.Добавить("ОбъектСсылка",		Новый ОписаниеТипов(ТипСсылки));
	ТаблицаСсылок.Колонки.Добавить("ОбъектСсылкаУИД",	Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаСсылок.Колонки.Добавить("ОтборРС_Хэш",		ПолучитьОписаниеТиповСтроки(32));
	
	ТаблицаСсылок.Колонки.Добавить("Номер",				ПолучитьОписаниеТиповЧисла(20));
	ТаблицаСсылок.Колонки.Добавить("Получатель",		Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	Выборка	= ЗапросСписка.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТС	= ТаблицаСсылок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТС,Выборка);
		СтрокаТС.ОбъектСсылка = Менеджер.ПолучитьСсылку(СтрокаТС.ОбъектСсылкаУИД);		
		
		ТекНомер=Выборка.Номер;
	КонецЦикла;	
	
	ЗапросОбъектов.УстановитьПараметр("ТаблицаСсылок",ТаблицаСсылок);
	ЗапросОбъектов.УстановитьПараметр("Единица_Штука",Ед_Штука);
	
	Реквизиты_Ш	= РеквизитыДляВыгрузки.Шапка;
	
	Выборка_Ш	= ЗапросОбъектов.Выполнить().Выбрать();
	МассивВыборок.Добавить(Выборка_Ш);
	
	Пока Выборка_Ш.Следующий() Цикл
		ОбработкаПрерыванияПользователя_(); 
		
		Для Каждого СтрокаТР Из Реквизиты_Ш Цикл
			Если СтрокаТР.Кэшировать Тогда
				Кэши[СтрокаТР.ТипСтрокой].Вставить(Выборка_Ш[СтрокаТР.Имя]);			
			КонецЕсли;			
		КонецЦикла;
		
		СписокТЧ = Неопределено;
		Если РеквизитыДляВыгрузки.Свойство("СписокТЧ",СписокТЧ) Тогда
			Для Каждого ЭлементТЧ Из СписокТЧ Цикл
				Если ИмяТаблицы = "Справочник.Контрагенты" Тогда Продолжить КонецЕсли; //ТЧ скидки в карточке постоянно падает на кэшах номенклатуры
				Имя_ТЧ		 = ЭлементТЧ.Ключ;
				Реквизиты_ТЧ = ЭлементТЧ.Значение;
				
				Выборка_ТЧ = Выборка_Ш[Имя_ТЧ].Выбрать();
				Пока Выборка_ТЧ.Следующий() Цикл
					Для Каждого СтрокаТР Из Реквизиты_ТЧ Цикл
						Если СтрокаТР.Кэшировать Тогда
							Кэши[СтрокаТР.ТипСтрокой].Вставить(Выборка_ТЧ[СтрокаТР.Имя]);						
						КонецЕсли;						
					КонецЦикла;
				КонецЦикла;			
			КонецЦикла;
		КонецЕсли;
		
		ДопЗапросы=Неопределено;
		Если РеквизитыДляВыгрузки.Свойство("ДопЗапросы",ДопЗапросы) И ДопЗапросы<>Неопределено Тогда
			Для Каждого ДопЗапрос Из ДопЗапросы Цикл
				
				Реквизиты_ТЧ	= ДопЗапрос.Реквизиты_ТЧ;
				
				Запрос			= Новый("Запрос");
				Запрос.Текст	= ДопЗапрос.Текст;
				Запрос.УстановитьПараметр("Ссылка",Выборка_Ш.Ссылка);
				
				Выборка_ТЧ	= Запрос.Выполнить().Выбрать();
				Пока Выборка_ТЧ.Следующий() Цикл
					Для Каждого СтрокаТР Из Реквизиты_ТЧ Цикл
						Если СтрокаТР.Кэшировать Тогда
							Кэши[СтрокаТР.ТипСтрокой].Вставить(Выборка_ТЧ[СтрокаТР.Имя]);						
						КонецЕсли;						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;		
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат ТекНомер;
КонецФункции

Функция ЦиклПоПорции_ВыгрузитьДвижения(ЗапросСписка,ЗапросОбъектов,МоментВремени,Кэши,РеквизитыДляВыгрузки)	
	ЗапросСписка.УстановитьПараметр("МоментВремени",МоментВремени);
	МоментВремени	= Неопределено;
	
	МассивСсылок	= Новый Массив;
	
	Выборка	= ЗапросСписка.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.СсылкаНаОбъект);					
		
		МоментВремени=Выборка.МоментВремени;
	КонецЦикла;	
	
	ЗапросОбъектов.УстановитьПараметр("МассивСсылок",МассивСсылок);
	
	Реквизиты_Ш	= РеквизитыДляВыгрузки.Шапка;
	
	Выборка_Ш	= ЗапросОбъектов.Выполнить().Выбрать();
	МассивВыборок.Добавить(Выборка_Ш);
	
	Пока Выборка_Ш.Следующий() Цикл
		ОбработкаПрерыванияПользователя_(); 
		
		Для Каждого СтрокаТР Из Реквизиты_Ш Цикл
			Если СтрокаТР.Кэшировать Тогда
				Кэши[СтрокаТР.ТипСтрокой].Вставить(Выборка_Ш[СтрокаТР.Имя]);			
			КонецЕсли;			
		КонецЦикла;
		
		СписокТЧ = Неопределено;
		Если РеквизитыДляВыгрузки.Свойство("СписокТЧ",СписокТЧ) Тогда
			Для Каждого ЭлементТЧ Из СписокТЧ Цикл
				Имя_ТЧ		 = ЭлементТЧ.Ключ;
				Реквизиты_ТЧ = ЭлементТЧ.Значение;
				
				Выборка_ТЧ = Выборка_Ш[Имя_ТЧ].Выбрать();
				Пока Выборка_ТЧ.Следующий() Цикл
					Для Каждого СтрокаТР Из Реквизиты_ТЧ Цикл
						Если СтрокаТР.Кэшировать Тогда
							Кэши[СтрокаТР.ТипСтрокой].Вставить(Выборка_ТЧ[СтрокаТР.Имя]);						
						КонецЕсли;						
					КонецЦикла;
				КонецЦикла;			
			КонецЦикла;
		КонецЕсли;
		
		ДопЗапросы=Неопределено;
		Если РеквизитыДляВыгрузки.Свойство("ДопЗапросы",ДопЗапросы) И ДопЗапросы<>Неопределено Тогда
			Для Каждого ДопЗапрос Из ДопЗапросы Цикл
				
				Реквизиты_ТЧ	= ДопЗапрос.Реквизиты_ТЧ;
				
				Запрос			= Новый("Запрос");
				Запрос.Текст	= ДопЗапрос.Текст;
				Запрос.УстановитьПараметр("Ссылка",Выборка_Ш.Ссылка);
				
				Выборка_ТЧ	= Запрос.Выполнить().Выбрать();
				Пока Выборка_ТЧ.Следующий() Цикл
					Для Каждого СтрокаТР Из Реквизиты_ТЧ Цикл
						Если СтрокаТР.Кэшировать Тогда
							Кэши[СтрокаТР.ТипСтрокой].Вставить(Выборка_ТЧ[СтрокаТР.Имя]);						
						КонецЕсли;						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;		
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат МоментВремени;
КонецФункции

Функция МассивНовыхЭлементовКэша(ИмяКэща)
	Результат	= Новый Массив;
	
	ТекКэш		= Кэши[ИмяКэща];
	Если ТекКэш<>Неопределено Тогда
		Для Каждого Элемент Из ТекКэш Цикл
			Если ТекКэш.Получить(Элемент.Ключ)=Неопределено Тогда
				Результат.Добавить(Элемент.Ключ);		
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ()


#КонецОбласти 


#Область РеквизитыДляВыгрузки


Функция РеквизитыДляВыгрузкивЕД_ПланВидовХарактеристик_СвойстваОбъектов_Элемент()
	ИмяТаблицы			= "ПланВидовХарактеристик.СвойстваОбъектов";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_ПланВидовХарактеристик_СвойстваОбъектов_Элемент()


#Область Справочники

Функция РеквизитыДляВыгрузкивЕД_Справочник_Акции_Группа()
	ИмяТаблицы			= "Справочник.Акции";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка", Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Акции_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Акции_Элемент()
	ИмяТаблицы			= "Справочник.Акции";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование,ДатаНачала,ДатаОкончания,ВыдаватьСертификаты,МинимальнаяСуммаПокупки,Описание,ПроцентСертификата,ШтрихКод";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"ВыдаватьСертификаты", Новый Структура("ПолеЗапроса","ВыдаватьСертификат"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Родитель", Новый Структура("Кэшировать",Ложь));
	
	СписокТЧ	= Новый Структура;	
	ИменаТЧ		= "Подразделения,ЦеныПродажиБлочками";
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл
		Реквизиты_ТЧ = СоздатьТаблицуРеквизитов(МетаОбъект.ТабличныеЧасти[ИмяТЧ]);	
		СписокТЧ.Вставить(ИмяТЧ,Реквизиты_ТЧ);
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Акции()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Валюты_Элемент()
	МетаОбъект			= Метаданные.Справочники.Валюты;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Валюты_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ВидыПодарочныхСертификатов_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ПодарочныеСертификаты;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,Владелец,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ВидыПодарочныхСертификатов_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ВидыПараметровРазмеровНоменклатуры_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ВидыПараметровРазмеровНоменклатуры;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ВидыПараметровРазмеровНоменклатуры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ВидыПараметровЦветовНоменклатуры_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ВидыПараметровЦветовНоменклатуры;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ВидыПараметровЦветовНоменклатуры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ГТД_Элемент()
	МетаОбъект			= Метаданные.Справочники.ГТД;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ГТД_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Декларация_Группа()
	ИмяТаблицы			= "Справочник.Декларация";	
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,Изготовитель";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа", СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Декларация_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Декларация_Элемент()
	ИмяТаблицы			= "Справочник.Декларация";	
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,Организация.ИНН,Организация.КПП,Организация.ЮридическийАдрес,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Организация_ИНН",					Новый Структура("ПолеЗапроса","IsNULL(Организация.ИНН,"""")"));		
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Организация_КПП",					Новый Структура("ПолеЗапроса","IsNULL(Организация.КПП,"""")"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Организация_ЮридическийАдрес",	Новый Структура("ПолеЗапроса","IsNULL(Организация.ЮридическийАдрес,"""")"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Организация",						Новый Структура("ПолеЗапроса","IsNULL(Организация.Наименование,"""")"));		
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Сертификат",						Новый Структура("ПолеЗапроса","ПРЕДСТАВЛЕНИЕ(Сертификат)"));
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Договоры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ДисконтныеКарты_Элемент()
	МетаОбъект			= Метаданные.Справочники.ДисконтныеКарты;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,Владелец,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции

Функция РеквизитыДляВыгрузкивЕД_Справочник_Договоры_Элемент()
	ИмяТаблицы			= "Справочник.Договоры";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Код,Наименование,Владелец,Организация,ВалютаКредита";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,Владелец,ВидДоговора_Новый.Код,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент.КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Договоры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Должности_Элемент()
	МетаОбъект			= Метаданные.Справочники.Должности;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ГТД_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ДопПараметрРазмера_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ДопПараметрРазмера;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ДопПараметрРазмера_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ДопПараметрЦвета_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ДопПараметрЦвета;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ДопПараметрЦвета_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Кассы_Элемент()
	ИмяТаблицы			= "Справочник.Кассы";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);		
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Наименование,Организация";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Владелец,Родитель,Код,Наименование,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Родитель", 			Новый Структура("Кэшировать",Ложь));	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"НаименованиеПолное",	Новый Структура("ПолеЗапроса","ПолноеНаименование"));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_КлассификаторСтранМира_Элемент()
	МетаОбъект			= Метаданные.Справочники.КлассификаторСтранМира;		
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();	
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,ПометкаУдаления,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_КлассификаторСтранМира_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Элемент()
	ИмяТаблицы			= "Справочник.Контрагенты";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование,НаименованиеПолное,ИНН,КПП";
	ИменаРеквизитов_Ш	= "ВерсияДанных,ЭтоГруппа,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,НаименованиеПолное,ИНН,КПП";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент.КС",ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"НаименованиеПолное",	Новый Структура("ПолеЗапроса","ПолноеНаименование"));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Группа()
	ИмяТаблицы			= "Справочник.Контрагенты";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа.КС",ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",	ИменаРеквизитов_Ш);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"НаименованиеПолное",	Новый Структура("ПолеЗапроса","ПолноеНаименование"));	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Документ_ЦеныПоставщика()
	МетаОбъект			= Метаданные.Справочники.Контрагенты;	
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();
	ВариантВыгрузки		= "Документ.ЦеныПоставщика";
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,ЭтоГруппа,Ссылка,ПометкаУдаления,Код,Наименование,ТипЦенРаспродажа";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+"."+ВариантВыгрузки,ИменаРеквизитов_Ш);	
	
	ИменаРеквизитов_ТЧ	= "Наценка,Номенклатура,Скидка,ТипЦен";
	Реквизиты_ТЧ_Цены	= СоздатьТаблицуРеквизитов(МетаОбъект.ТабличныеЧасти.Скидки,ИменаРеквизитов_ТЧ);	
	
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Скидки", Реквизиты_ТЧ_Цены);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Контрагенты_Документ_ЦеныПоставщика()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ЛинииНоменклатуры_Элемент()
	МетаОбъект			= Метаданные.Справочники.ЛинииНоменклатуры;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ФР_Бренд Владелец,Код,Наименование,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ЛинииНоменклатуры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Организации_Элемент()
	ИмяТаблицы			= "Справочник.Организации";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Код,Наименование,ИНН,КПП";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,НаименованиеПолное,ИНН,КПП";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Организации_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Организации_Справочник_Контрагенты()
	Возврат РеквизитыДляВыгрузкивЕД_Справочник_Организации_Элемент();	
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Организации_Справочник_Контрагенты()

Функция РеквизитыДляВыгрузкивЕД_Справочник_МатериалыСостав_Элемент()
	МетаОбъект			= Метаданные.Справочники.МатериалыСостав;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,ПометкаУдаления,Ссылка,Родитель,Код,Наименование,НаименованиеПолное,Наименование_Английский";	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент.КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		ИменаРеквизитов_Ш);
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"НаименованиеПолное", 		Новый Структура("ПолеЗапроса","ПолноеНаименование"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Наименование_Английский", Новый Структура("ПолеЗапроса","АнглоязычноеНаименование"));
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_МатериалыСостав_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_МатериалыСостав_Группа()
	МетаОбъект			= Метаданные.Справочники.МатериалыСостав;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,ПометкаУдаления,Ссылка,Родитель,Код,Наименование";	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа.КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",		ИменаРеквизитов_Ш);
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_МатериалыСостав_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Номенклатура_Группа()
	ИмяТаблицы			= "Справочник.Номенклатура";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Код,Наименование,Родитель";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,Родитель";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа.КС",ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",	ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ВводОстатковТМЦ()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Номенклатура_Элемент()
	ИмяТаблицы			= "Справочник.Номенклатура";
	МетаОбъект			= Метаданные.Справочники.Номенклатура;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,КодПроизводителя,Родитель";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,КодПроизводителя,Родитель,СтавкаНДС,
		|ОписаниеТовараДляСайта,РусскоеНаименование,СнятСпроизводства,ТипТовара,ВидНоменклатуры,
		|ФР_ВидНоменклатуры,ФР_Бренд Бренд,ФР_Пол Пол,ФР_Коллекция Коллекция,ТНВЭД КодТНВЭД";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент.КС",	ИменаРеквизитов_КС);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		ИменаРеквизитов_Ш);
	
	СписокТЧ	= Новый Структура;
	ИменаТЧ		= "СоставНоменклатуры";
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл
		СписокТЧ.Вставить(ИмяТЧ,СоздатьТаблицуРеквизитов(МетаОбъект.ТабличныеЧасти[ИмяТЧ]));
	КонецЦикла;
	
	//!!! Нельзя кэшировать родителя номенклатуры при пакетной выгрузке !!!
	//УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Родитель", Новый Структура("ТипСтрокой,Кэшировать","Справочник.Номенклатура",Истина));
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Номенклатура_Номра()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Номенклатура_Справочник_ХарактеристикиНоменклатуры()
	ИмяТаблицы			= "Справочник.Номенклатура";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Родитель,ПометкаУдаления,СнятСПроизводства,Код,Наименование,Цвет,Размер,ДопПараметрРазмера,Цвет.Наименование,Размер.Наименование,ДопПараметрРазмера.Наименование,Родитель.ВидНоменклатуры,ПервичнаяГруппа";
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Справочник_ХарактеристикиНоменклатуры.",	ИменаРеквизитов_Ш);
	РеквизитыШапок.Вставить("Справочник.ФР_ХарактеристикиНоменклатуры.Элемент.КС",	ИменаРеквизитов_КС);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Родитель", Новый Структура("Кэшировать",Ложь));
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Номенклатура_Харка()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФР_НоменклатурныеГруппы_Элемент()
	МетаОбъект			= Метаданные.Справочники.ФР_НоменклатурныеГруппы;
	ИмяТаблицы			= "Справочник.НоменклатурныеГруппы";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,ПометкаУдаления,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ФР_НоменклатурныеГруппы_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ПодарочныеСертификаты_Элемент()
	ИмяТаблицы			= "Справочник.ПодарочныеСертификаты";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Владелец.Родитель,Код,КодСертификата,ВидСертификата,ОкончаниеДействия";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Владелец.Родитель Владелец,Код Наименование,КодСертификата Код,ПометкаУдаления,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы,			СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ПодарочныеСертификаты()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Подразделения_Элемент()
	ИмяТаблицы			= "Справочник.Подразделения";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,"+СтрСоединить(МассивРеквизитовШапки(МетаОбъект),",");
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);		
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы,			ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ПодарочныеСертификаты()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Пользователи_Элемент()
	ИмяТаблицы			= "Справочник.Пользователи";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,"+СтрСоединить(МассивРеквизитовШапки(МетаОбъект),",");
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);		
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы,			ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка,ДопРеквизиты",Реквизиты_Ш,"Подразделение");
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Пользователи_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ПричиныРекламаций_Группа()
	ИмяТаблицы			= "Справочник.ПричиныРекламаций";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,Родитель";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,			ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ПричиныРекламаций_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ПричиныРекламаций_Элемент()
	ИмяТаблицы			= "Справочник.ПричиныРекламаций";
	МетаОбъект			= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,Родитель";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,			ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ПричиныРекламаций_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Размеры_Элемент()
	МетаОбъект			= Метаданные.Справочники.Размеры;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование";	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",		ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Размеры()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Размеры_Группа()
	МетаОбъект			= Метаданные.Справочники.Размеры;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование";
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",	ИменаРеквизитов_Ш);
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Размеры_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_РазмерыЧашки_Элемент()
	МетаОбъект			= Метаданные.Справочники.РазмерыЧашки;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;

	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_РазмерыЧашки_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Склады_Элемент()
	МетаОбъект			= Метаданные.Справочники.Склады;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,Подразделение";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",		ИменаРеквизитов_КС);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Склады_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Склады_Группа()
	МетаОбъект			= Метаданные.Справочники.Склады;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";
	ИменаРеквизитов_Ш	= "ВерсияДанных,ПометкаУдаления,Ссылка,Родитель,Код,Наименование";	
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа.КС",	ИменаРеквизитов_КС);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",		ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Склады_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_СтатьиЗатрат_Элемент()
	МетаОбъект			= Метаданные.Справочники.СтатьиЗатрат;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		ИменаРеквизитов_Ш);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент.КС", 	ИменаРеквизитов_КС);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_СтатьиЗатрат_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_СтраныМИра_Элемент()	
	МетаОбъект			= Метаданные.Справочники.КлассификаторСтранМира;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Код,Наименование,ПометкаУдаления,*";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_СтраныМИра_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ТипыСкидок_Элемент()
	МетаОбъект			= Метаданные.Справочники.ТипыСкидок;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,*";	
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",		ИменаРеквизитов_КС);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ТипыСкидок_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ТипыЦен_Элемент()
	МетаОбъект			= Метаданные.Справочники.ТипыЦен;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование,Валюта";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,Валюта ВалютаЦены,
		|РазрядностьЦены ТочностьОкругления,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",		ИменаРеквизитов_КС);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ТипыЦен_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ТНВЭД_Группа()
	МетаОбъект			= Метаданные.Справочники.ТНВЭД;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,ДатаНачалаРаботыСМаркировкой,ДатаНачалаОбязательнойРаботыСМаркировкой";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);		
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ТНВЭД_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ТНВЭД_Элемент()
	МетаОбъект			= Метаданные.Справочники.ТНВЭД;
	ИмяТаблицы			= "Справочник."+МетаОбъект.Имя;	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,ДатаНачалаРаботыСМаркировкой,ДатаНачалаОбязательнойРаботыСМаркировкой";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);		
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ТНВЭД_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Цвета_Элемент()
	МетаОбъект			= Метаданные.Справочники.Цвета;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование,ПометкаУдаления,*";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",	ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Цвета()

Функция РеквизитыДляВыгрузкивЕД_Справочник_Цвета_Группа()
	МетаОбъект			= Метаданные.Справочники.Цвета;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа", Реквизиты_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Цвета_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ШтрихКоды_Элемент()
	МетаОбъект		= Метаданные.Справочники.ШтрихКоды;
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Наименование,Владелец,ТипШК,ВидШК,ФорматШК";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов);		
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ШтрихКоды()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ШтрихкодыУпаковокТоваров_Элемент()
	МетаОбъект		= Метаданные.Справочники.ШтрихкодыУпаковокТоваров;
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Владелец,Наименование,ЗначениеШтрихкода,ТипКода,ТипУпаковки,ТипШК,СпособВводаВОборот";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов);		
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ШтрихкодыУпаковокТоваров_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФизическиеЛица_Элемент()
	МетаОбъект			= Метаданные.Справочники.ФизическиеЛица;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование,Фамилия,Имя,Отчество,ДатаРождения,ИНН";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,Фамилия,Имя,Отчество,ДатаРождения,ИНН,Подразделение,ШтрихКод";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент.КС",	ИменаРеквизитов_КС);
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ФизическиеЛица_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФизическиеЛица_Группа()
	МетаОбъект			= Метаданные.Справочники.ФизическиеЛица;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Родитель,Код,Наименование";	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа.КС", 	ИменаРеквизитов_КС);	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",		ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_Цвета_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФР_Бренды_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ФР_Бренды;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Код,Наименование,*";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ФР_ВидыНоменклатуры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФР_ВидыНоменклатуры_Элемент()	
	МетаОбъект			= Метаданные.Справочники.ФР_ВидыНоменклатуры;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,*";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Элемент",		ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ФР_ВидыНоменклатуры_Элемент()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФР_ВидыНоменклатуры_Группа()	
	МетаОбъект			= Метаданные.Справочники.ФР_ВидыНоменклатуры;
	ИмяТаблицы			= "Справочник."+МетаОбъект.имя;	
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,ПометкаУдаления,Родитель,Код,Наименование,*";	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы+".Группа",		ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ФР_ВидыНоменклатуры_Группа()

Функция РеквизитыДляВыгрузкивЕД_Справочник_ФР_Коллекции_Элемент()
	МетаОбъект			= Метаданные.Справочники.ФР_Коллекции;
	ИмяТаблицы			= МетаОбъект.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Владелец,Код,Наименование,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Справочник_ФР_Коллекции_Элемент()

#КонецОбласти


#Область ПланыОбмена


Функция РеквизитыДляВыгрузкивЕД_ПланОбмена_Основной_Элемент()
	ИмяТаблицы		= "ПланыОбмен.Основной";
	
	МетаОбъект			= Метаданные.ПланыОбмена.Основной;
	ИменаРеквизитов_Ш	= "Код,Наименование,Подразделение";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаОбъект,ИменаРеквизитов_Ш);		
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_ПланОбмена_Основной_Элемент()


#КонецОбласти


#Область Документы

Функция РеквизитыДляВыгрузкивЕД_Документ_БлокировкаАкции()	
	МетаДок				= Метаданные.Документы.БлокировкаАкции;
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов_Ш);	
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_БлокировкаАкции()

Функция РеквизитыДляВыгрузкивЕД_Документ_ВводОстатковТМЦ()
	МетаДок			= Метаданные.Документы.ВводОстатковТМЦ;
	ИменаРеквизитов	= "Ссылка,Дата,Номер,Организация,Подразделение,Склад,Валюта,Курс,Автор,СуммаДокумента,Комментарий,Проведен,ПометкаУдаления";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	ПолеЗапроса		= "Склад.Подразделение";
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Подразделение", Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать",ПолеЗапроса,"Справочник.Подразделения",Истина));
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,Единица,СтавкаНДС,Количество,Цена,Сумма,НДС,Всего";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",	Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",			Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"СтавкаНДС",		Новый Структура("ПолеЗапроса","Номенклатура.Родитель.СтавкаНДС"));
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ВводОстатковТМЦ()

Функция РеквизитыДляВыгрузкивЕД_Документ_Заказ_ЗПК_ЗПС()
	МетаДок			= Метаданные.Документы.Заказ;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов);
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,ХарактеристикаНоменклатуры,Единица,Коэффициент,СтавкаНДС,Количество,Заявка,ПодтвержденнаяЗаявка,Цена,Сумма,НДС,Всего";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",				Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Заказ_ЗПК_ЗПС()

Функция РеквизитыДляВыгрузкивЕД_Документ_ЗаявкаНаВозвратОтПокупателя()
	МетаДок			= Метаданные.Документы.ЗаявкаНаВозвратОтПокупателя;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов);
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,ХарактеристикаНоменклатуры,Единица,СтавкаНДС,Заявка,ПодтвержденнаяЗаявка,Количество,Коэффициент,ДокументОтгрузки,Цена,Сумма,НДС,Всего";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса,Кэшировать","Номенклатура.Родитель",Ложь));	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Ложь));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Заказ_ЗПК_ЗПС()

Функция РеквизитыДляВыгрузкивЕД_Документ_ЗаявкаНаРекламацию()
	МетаДок			= Метаданные.Документы.ЗаявкаНаРекламацию;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*,
		|Ссылка.ДокОснование.ПунктДоставки.ПодразделениеФР ПодразделениеФР,Ссылка.ДокОснование.ПунктДоставки.ПодразделениеФР.КонтрагентФР КонтрагентФР,
		|СуммаРекламации СуммаДокумента_Расхождения";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов);	
	
	ИменаРеквизитовТЧ = "ХарактеристикаНоменклатуры,*";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары, ИменаРеквизитовТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса,Кэшировать","Номенклатура.Родитель",Ложь));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Ложь));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"КоличествоИсх",				Новый Структура("Имя,ПолеЗапроса",	"КоличествоПоДокументу",	"КоличествоИсх"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ДельтаСогласовано",			Новый Структура("Имя,ПолеЗапроса",	"СогласованоПоставщиком",	"ВЫБОР КОГДА ДельтаСогласовано<0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ*ДельтаСогласовано"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Количество",					Новый Структура("ПолеЗапроса", 		"КоличествоФакт"));
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Всего",						Новый Структура("Имя,ПолеЗапроса",	"ВсегоПоДокументу",	"КоличествоИсх*Цена"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ВсегоСогласовано",			Новый Структура("Имя,ПолеЗапроса",	"Всего",			"КоличествоФакт*Цена"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ЗаявкаНаРекламацию()

Функция РеквизитыДляВыгрузкивЕД_Документ_Инвентаризация()	
	МетаДок				= Метаданные.Документы.Инвентаризация;
	
	ИменаРеквизитов_Ш	= "Ссылка,Дата,Номер,Склад,Склад.Организация,ГруппыТоваров,СостояниеНакладной,Валюта,Курс,Автор,СуммаДокумента,Комментарий,СтатьяЗатрат,Проведен,ПометкаУдаления";
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов_Ш);
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,Единица,Количество,КоличествоФакт,КоличествоРасч,Цена,Сумма,СтавкаНДС,НДС,Всего,ЦенаОприходования,КоличествоОпр";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",	Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",			Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",	Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Инвентаризация()

Функция РеквизитыДляВыгрузкивЕД_Документ_ОтчетКассовойСмены()
	МетаДок			= Метаданные.Документы.ОтчетКассовойСмены;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "Ссылка,Дата,Номер,Автор,Валюта,
	|Склад.Организация,Подразделение,Склад,ГруппыТоваров,Номер_Z_Отчета,
	|КодОперации,ВидОплаты,Касса,СуммаДокумента,СуммаОплатыСертификатами,
	|Проведен,ПометкаУдаления,СуммаСдачиПодарочногоСертификата";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,Продавец,Сотрудник,Единица,Акция,АвтопроверяемаяАкция,СтавкаНДС,Количество,Цена,Сумма,НДС,Всего,ВсегоБезСкидки,НомерЧекаККМ";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",	Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",			Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
	
	Реквизиты_ТЧ_ПодарочныеСертификаты	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.ПодарочныеСертификаты);	
	Реквизиты_ТЧ_НачисленныеБаллы		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.НачисленныеБаллы);	
	Реквизиты_ТЧ_ОплаченоБаллами		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.ОплаченоБаллами);			
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);
	СписокТЧ.Вставить("ПодарочныеСертификаты",	Реквизиты_ТЧ_ПодарочныеСертификаты);
	СписокТЧ.Вставить("НачисленныеБаллы",		Реквизиты_ТЧ_НачисленныеБаллы);
	СписокТЧ.Вставить("ОплаченоБаллами",		Реквизиты_ТЧ_ОплаченоБаллами);
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_ОтчетКассовойСмены()

Функция РеквизитыДляВыгрузкивЕД_Документ_ОприходованиеТМЦ()
	МетаДок			= Метаданные.Документы.ОприходованиеТМЦ;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,СостояниеНакладной,Организация,Подразделение,Склад,ГруппыТоваров,Валюта,Курс,
		|ДокОснование,Автор,СуммаДокумента,Комментарий,КодОперации,СтатьяЗатрат,Проведен,ПометкаУдаления";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов);
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,ХарактеристикаНоменклатуры,Единица,СтавкаНДС,Количество,Цена,ЦенаОприходования,Сумма,НДС,Всего";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",				Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ОприходованиеТМЦ()

Функция РеквизитыДляВыгрузкивЕД_Документ_ПереводСредств()
	ИмяТаблицы			= "Документ.ПереводСредств";
	МетаДок				= Метаданные.Документы.ПереводСредств;
	
	ИменаРеквизитов_КС	= "ВерсияДанных,Ссылка,Дата,Номер,*";
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,ПометкаУдаления,Проведен,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Сумма", Новый Структура("Имя","СуммаДокумента"));
	
	РеквизитыШапок.Вставить(ИмяТаблицы,			СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));
	РеквизитыШапок.Вставить(ИмяТаблицы+".КС",	ИменаРеквизитов_КС);
	
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ПереводСредств()

Функция РеквизитыДляВыгрузкивЕД_Документ_Перемещение_ПРМ_ПНК()
	МетаДок			= Метаданные.Документы.Перемещение;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,СостояниеНакладной,СостояниеНакладнойУПолучателя,ГруппыТоваров,
	|Организация,Подразделение,СкладПолучатель,СкладПолучатель.Организация,
	|Валюта,Курс,Автор,Менеджер,СуммаДокумента,Комментарий,Проведен,ПометкаУдаления,Контрагент";
	
	РеквизитыШапок.Вставить("Документ.Перемещение_ПРМ_ПНК",ИменаРеквизитов);
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	ПолеЗапроса		= "СкладПолучатель.Подразделение";
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Подразделение",		Новый Структура("ПолеЗапроса",ПолеЗапроса));	
	
	ИменаРеквизитов	= "Номенклатура,ХарактеристикаНоменклатуры,Единица,СтавкаНДС,Заявка,ПодтвержденнаяЗаявка,Количество,Себестоимость";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_РасходнаяНакладная_ПРМ_ПНК()

//+HELP-2306 20250220 Михайловский
Функция РеквизитыДляВыгрузкивЕД_Документ_ЗаявкаНаПостСторонАссорт()
	МетаДок			= Метаданные.Документы.ЗаявкаНаПостСторонАссорт;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //-HELP-2306 20250220 Михайловский

Функция РеквизитыДляВыгрузкивЕД_Документ_МаркировкаОстатковТЦ()
	МетаДок			= Метаданные.Документы.МаркировкаОстатковТЦ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции

//+SNL-203 20260515 Михайловский
Функция РеквизитыДляВыгрузкивЕД_Документ_ЗаказИМ()
	МетаДок			= Метаданные.Документы.ЗаказИМ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции

Функция РеквизитыДляВыгрузкивЕД_Документ_ВыкупИМ()
	МетаДок			= Метаданные.Документы.ВыкупИМ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции

Функция РеквизитыДляВыгрузкивЕД_Документ_ВозвратИМ()
	МетаДок			= Метаданные.Документы.ВозвратИМ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции

Функция РеквизитыДляВыгрузкивЕД_Документ_Возврат1ИМ()
	МетаДок			= Метаданные.Документы.Возврат1ИМ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции

Функция РеквизитыДляВыгрузкивЕД_Документ_ОплатаИМ()
	МетаДок			= Метаданные.Документы.ОплатаИМ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции

Функция РеквизитыДляВыгрузкивЕД_Документ_ВозвратОплатыИМ()
	МетаДок			= Метаданные.Документы.ВозвратОплатыИМ;
	ИмяТаблицы		= МетаДок.ПолноеИмя();
	
	ИменаРеквизитов_Ш	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов_Ш);
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов_Ш);	
	
	СписокТЧ	= Новый Структура;
	Для Каждого МетаТЧ Из МетаДок.ТабличныеЧасти Цикл
		Реквизиты_ТЧ	= СоздатьТаблицуРеквизитов(МетаТЧ);	
		СписокТЧ.Вставить(МетаТЧ.Имя,	Реквизиты_ТЧ);	
	КонецЦикла;	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции
//-SNL-203 20260515 Михайловский

Функция РеквизитыДляВыгрузкивЕД_Документ_Перемещение_ПРМ_РНК()
	МетаДок			= Метаданные.Документы.Перемещение;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,
	|Склад.Организация,Склад.Подразделение,
	|СкладПолучатель.Организация,
	|Автор.ФизЛицо,*
	|";
	
	РеквизитыШапок.Вставить("Документ.Перемещение_ПРМ_РНК",ИменаРеквизитов);
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	ПолеЗапроса		= "Склад.Подразделение";
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Подразделение",		Новый Структура("ПолеЗапроса",ПолеЗапроса));	
	
	ИменаРеквизитов	= "Номенклатура,ХарактеристикаНоменклатуры,Единица,СтавкаНДС,Заявка,ПодтвержденнаяЗаявка,Количество,Цена,Сумма,НДС,Всего,Себестоимость";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Перемещение_ПРМ_РНК()

Функция РеквизитыДляВыгрузкивЕД_Документ_Перемещение_ПРМ_ПРМ()
	МетаДок			= Метаданные.Документы.Перемещение;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,Склад.Подразделение Подразделение,СкладПолучатель.Подразделение ПодразделениеПолучатель,*";
	
	РеквизитыШапок.Вставить("Документ.Перемещение_ПРМ_ПРМ",ИменаРеквизитов);
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);
	
	ИменаРеквизитов	= "Номенклатура,ХарактеристикаНоменклатуры,Единица,СтавкаНДС,Заявка,ПодтвержденнаяЗаявка,Количество,Себестоимость,Цена,Сумма,Всего,ЦенаПоСебестоимости";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","IsNull(Единица.ОКЕИ,&Единица_Штука)","Справочники.ОКЕИ"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ЦенаПоСебестоимости",			Новый Структура("ПолеЗапроса","ВЫБОР КОГДА Количество<>0 ТОГДА Себестоимость/Количество ИНАЧЕ 0 КОНЕЦ"));
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Перемещение_ПРМ_ПРМ()

Функция РеквизитыДляВыгрузкивЕД_Документ_ПрайсЛист()
	МетаДок			= Метаданные.Документы.ПрайсЛист;
	ИменаРеквизитов	= "
		|ВерсияДанных,Ссылка,Проведен,ПометкаУдаления,Дата,Номер,ТипЦен.Базовый,*
		|";
	
	РеквизитыШапок.Вставить("Документ.ПрайсЛист",ИменаРеквизитов);
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	СписокТЧ		= Новый Структура;
	
	ДопЗапросы		= Новый Массив;
	
	Реквизиты_ТЧ	= ПустаяТаблицаРеквизитов();
	СтрокаТР=Реквизиты_ТЧ.Добавить(); СтрокаТР.Имя="Номенклатура"; СтрокаТР.ПолеЗапроса="Номенклатура"; 
	СтрокаТР.ТипСтрокой="Справочник.Номенклатура"; СтрокаТР.Кэшировать=Истина;
	
	ТектсЗапроса	= "ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ РегистрСведений.ЦеныНоменклатуры ГДЕ Прайс=&Ссылка";
	
	ДопЗапросы.Добавить(Новый Структура("Текст,Реквизиты_ТЧ",ТектсЗапроса,Реквизиты_ТЧ));	
	
	Возврат Новый Структура("Шапка,СписокТЧ,ДопЗапросы",Реквизиты_Ш,СписокТЧ,ДопЗапросы);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Чек()

Функция РеквизитыДляВыгрузкивЕД_Документ_ПрайсЛист_РегистрСведений_ЦеныНоменклатуры()
	Возврат РеквизитыДляВыгрузкивЕД_Документ_ПрайсЛист();
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ПрайсЛист_РегистрСведений_ЦеныНоменклатуры()

Функция РеквизитыДляВыгрузкивЕД_Документ_ПриходнаяНакладная_ПНК_ВЗВ()
	МетаДок			= Метаданные.Документы.ПриходнаяНакладная;
	ИменаРеквизитов	= "Ссылка,Дата,Номер,СостояниеНакладной,Организация,Подразделение,Склад,ДокОснование,Валюта,Курс,Контрагент,Договор,Автор,СуммаДокумента,Комментарий,Проведен,ПометкаУдаления";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить("Документ.ПриходнаяНакладная",ИменаРеквизитов);
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,Единица,СтавкаНДС,Заявка,ПодтвержденнаяЗаявка,Количество,Цена,Сумма,НДС,Всего";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",	Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",			Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_РасходнаяНакладная_РНК_ПНК()

Функция РеквизитыДляВыгрузкивЕД_Документ_ПриходныйКассовыйОрдер()
	МетаДок				= Метаданные.Документы.ПриходныйКассовыйОрдер;
	
	ИменаРеквизитовШ	= "ВерсияДанных,Ссылка,Проведен,ПометкаУдаления,Дата,Номер,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитовШ);		
	
	РеквизитыШапок.Вставить("Документ."+МетаДок.Имя,СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
		
	//ИменаРеквизитовТЧ	= "*";	
	//Реквизиты_ТЧ_РЗ		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.РасшифровкиЗатрат,ИменаРеквизитовТЧ);			
	//СписокТЧ			= Новый Структура;	
	//СписокТЧ.Вставить("РасшифровкиЗатрат",	Реквизиты_ТЧ_РЗ);	
	
	//Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
	Возврат Новый Структура("Шапка",Реквизиты_Ш);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ПриходныйКассовыйОрдер()

Функция РеквизитыДляВыгрузкивЕД_Документ_РасходнаяНакладная_РНК_ПНК()
	МетаДок			= Метаданные.Документы.РасходнаяНакладная;
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);		
	
	РеквизитыШапок.Вставить("Документ.РасходнаяНакладная",ИменаРеквизитов);
	
	//Вот так вот через ......опу.....
	ПолеЗапроса		= "ВЫРАЗИТЬ(Список.ДокОснование КАК Документ.Перемещение).СкладПолучатель";
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Склад",				Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать",ПолеЗапроса,"Справочник.Склады",Истина));
	
	//ПолеЗапроса		= "
	//|IsNull(ВЫРАЗИТЬ(Список.ДокОснование КАК Документ.Перемещение).СостояниеНакладной,Список.СостояниеНакладной)
	//|";
	//УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"СостояниеНакладной",	Новый Структура("ПолеЗапроса",ПолеЗапроса));	
	
	ПолеЗапроса		= "ВЫРАЗИТЬ(Список.ДокОснование КАК Документ.Перемещение).СкладПолучатель.Подразделение";
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"Подразделение",		Новый Структура("ПолеЗапроса",ПолеЗапроса));	
	
	ИменаРеквизитовТЧ	= "ХарактеристикаНоменклатуры,*";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитовТЧ);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_РасходнаяНакладная_РНК_ПНК()

Функция РеквизитыДляВыгрузкивЕД_Документ_РасходныйКассовыйОрдер()
	МетаДок				= Метаданные.Документы.РасходныйКассовыйОрдер;
	
	ИменаРеквизитовШ	= "ВерсияДанных,Ссылка,Проведен,ПометкаУдаления,Дата,Номер,Сумма СуммаДокумента,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитовШ);		
	
	РеквизитыШапок.Вставить("Документ."+МетаДок.Имя,СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
		
	ИменаРеквизитовТЧ	= "*";
	
	Реквизиты_ТЧ_РЗ		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.РасшифровкиЗатрат,ИменаРеквизитовТЧ);	
		
	СписокТЧ			= Новый Структура;
	
	СписокТЧ.Вставить("РасшифровкиЗатрат",	Реквизиты_ТЧ_РЗ);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_РасходныйКассовыйОрдер()

Функция РеквизитыДляВыгрузкивЕД_Документ_РекламационнаяНакладная_РКМ_КП()
	МетаДок				= Метаданные.Документы.РекламационнаяНакладная;
	
	ИменаРеквизитовШ	= "ВерсияДанных,Ссылка,Проведен,ПометкаУдаления,Дата,Номер,ЗаявкаНаВозвратОтПокупателя ЗаявкаНаВозврат,*";
	
	Реквизиты_Ш			= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитовШ);		
	
	РеквизитыШапок.Вставить("Документ."+МетаДок.Имя,СтрокаПолейТаблицыРеквизитов(Реквизиты_Ш));	
		
	ИменаРеквизитовТЧ	= "Номенклатура.Родитель Номенклатура,Номенклатура ХарактеристикаНоменклатуры,КоличествоИсх КоличествоДоИзменения,КоличествоФакт Количество,Цена,Цена ЦенаДоИзменения,СтавкаНДС";
	
	Реквизиты_ТЧ_РЗ		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитовТЧ);	
		
	СписокТЧ			= Новый Структура;
	
	СписокТЧ.Вставить("Товары",	Реквизиты_ТЧ_РЗ);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_РекламационнаяНакладная()

Функция РеквизитыДляВыгрузкивЕД_Документ_СверкаДанных()
	МетаДок			= Метаданные.Документы.СверкаДанных;
	ИмяТаблицы		= МетаДок.ПолноеИмя();		
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,ПометкаУдаления,Проведен,Дата,Номер,*";
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(ИмяТаблицы,ИменаРеквизитов);	
	
	ИменаРеквизитов_ТЧ	= "*";
	Реквизиты_ТЧ_Данные	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Данные,ИменаРеквизитов_ТЧ);	
		
	СписокТЧ			= Новый Структура;
	СписокТЧ.Вставить("Данные",	Реквизиты_ТЧ_Данные);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_СверкаДанных()

Функция РеквизитыДляВыгрузкивЕД_Документ_СписаниеТМЦ()
	МетаДок			= Метаданные.Документы.ОприходованиеТМЦ;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,СостояниеНакладной,Организация,Подразделение,Склад,ГруппыТоваров,ДокОснование,Автор,СуммаДокумента,Комментарий,КодОперации,СтатьяЗатрат,Проведен,ПометкаУдаления";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов);
	
	ИменаРеквизитов_ТЧ	= "Номенклатура,Характеристика,ХарактеристикаНоменклатуры,Единица,СтавкаНДС,Количество,Цена,Сумма,НДС,Всего";
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",	Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",			Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_СписаниеТМЦ()

Функция РеквизитыДляВыгрузкивЕД_Документ_УстановкаСкидок()
	МетаДок			= Метаданные.Документы.УстановкаСкидок;
	ИменаРеквизитов	= "
		|Ссылка,Проведен,ПометкаУдаления,Дата,Номер,ДействителенПо,Автор,Организация,
		|ТипСкидок,ТипСкидок.Базовый
		|";
	
	РеквизитыШапок.Вставить("Документ.УстановкаСкидок",ИменаРеквизитов);
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_Ш,"ДействителенПо",Новый Структура("ПолеЗапроса","Дата2"));
	
	СписокТЧ		= Новый Структура;
	
	ДопЗапросы		= Новый Массив;
	
	Реквизиты_ТЧ	= ПустаяТаблицаРеквизитов();
	СтрокаТР		= Реквизиты_ТЧ.Добавить(); СтрокаТР.Имя="Номенклатура"; СтрокаТР.ПолеЗапроса="Номенклатура"; 
	СтрокаТР.ТипСтрокой="Справочник.Номенклатура"; СтрокаТР.Кэшировать=Истина;
	
	ТектсЗапроса	= "ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ РегистрСведений.СкидкиНоменклатуры ГДЕ Документ=&Ссылка";
	
	ДопЗапросы.Добавить(Новый Структура("Текст,Реквизиты_ТЧ",ТектсЗапроса,Реквизиты_ТЧ));	
	
	Возврат Новый Структура("Шапка,СписокТЧ,ДопЗапросы",Реквизиты_Ш,СписокТЧ,ДопЗапросы);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Чек()

Функция РеквизитыДляВыгрузкивЕД_Документ_ХранилищеКодовМаркировки()
	МетаДок			= Метаданные.Документы.ХранилищеКодовМаркировки;
	
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Дата,Номер,Проведен,ПометкаУдаления,*";
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить(МетаДок.ПолноеИмя(),ИменаРеквизитов);	
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары, "*");
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",				Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",						Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",				Реквизиты_ТЧ_Товары);	
	СписокТЧ.Вставить("ШтрихкодыУпаковок",	СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.ШтрихкодыУпаковок, "*"));
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ХранилищеКодовМаркировки()

Функция РеквизитыДляВыгрузкивЕД_Документ_Чек()
	МетаДок			= Метаданные.Документы.Чек;
	ИменаРеквизитов	= "
		|Ссылка,Проведен,ПометкаУдаления,Дата,Номер,ГруппыТоваров,Автор,Валюта,Организация,
		|ТипЦен,ТипЦен.Базовый,ТипЦенРаспродажа,ТипЦенРаспродажа.Базовый,ТипСкидок,
		|Подразделение,Склад,КодОперации,ВидОплаты,КассаККМ,
		|НомерЧекаККМ,НомерСменыККМ,ЧекПробитНаККМ,СуммаДокумента,СуммаОплатыСертификатами";
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	РеквизитыШапок.Вставить("Документ.Чек",ИменаРеквизитов);
	
	ИменаРеквизитов_ТЧ	= "
		|Номенклатура,Характеристика,Продавец,Сотрудник,Единица,ТипЦен,Скидка,Распродажа,Акция,АвтопроверяемаяАкция,СтавкаНДС,НеПересчитывать,Количество,ЦенаБезСкидки,Цена,Сумма,НДС,
		|Всего,ВсегоБезСкидки,НомерЧекаККМ";
	
	Реквизиты_ТЧ_Товары	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Товары,ИменаРеквизитов_ТЧ);	
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Номенклатура",	Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Характеристика",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ_Товары,"Единица",			Новый Структура("ПолеЗапроса,ТипСтрокой","Единица.ОКЕИ","Справочники.ОКЕИ"));	
	
	Реквизиты_ТЧ_ПодарочныеСертификаты	= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.ПодарочныеСертификаты);	
//	Реквизиты_ТЧ_НачисленныеБаллы		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.НачисленныеБаллы);	
	//Реквизиты_ТЧ_ОплаченоБаллами		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.ОплаченоБаллами);			
		
	СписокТЧ	= Новый Структура;
	
	СписокТЧ.Вставить("Товары",					Реквизиты_ТЧ_Товары);
	СписокТЧ.Вставить("ПодарочныеСертификаты",	Реквизиты_ТЧ_ПодарочныеСертификаты);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_Чек()

Функция РеквизитыДляВыгрузкивЕД_Документ_ЭмиссияПодарочныхСертификатов_ЭПС_СПН()
	МетаДок			= Метаданные.Документы.ЭмиссияПодарочныхСертификатов;
	ИменаРеквизитов	= "ВерсияДанных,Ссылка,Проведен,ПометкаУдаления,Дата,Номер,*";
	
	РеквизитыШапок.Вставить("Документ.УстановкаСкидок",ИменаРеквизитов);
	
	Реквизиты_Ш		= СоздатьТаблицуРеквизитов(МетаДок,ИменаРеквизитов);	
	
	СписокТЧ	= Новый Структура;
	
	//ТЧ Сертификаты
	ИменаРеквизитов_ТЧ	= "КодСертификата,Номенклатура,ХарактеристикаНоменклатуры";
	Реквизиты_ТЧ		= СоздатьТаблицуРеквизитов(МетаДок.ТабличныеЧасти.Сертификаты,ИменаРеквизитов_ТЧ);
	
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ,"Номенклатура",				Новый Структура("ПолеЗапроса","Номенклатура.Родитель"));
	УстановитьПараметрыВСтрокеТР(Реквизиты_ТЧ,"ХарактеристикаНоменклатуры",	Новый Структура("ПолеЗапроса,ТипСтрокой,Кэшировать","Номенклатура","Справочник.ФР_ХарактеристикиНоменклатуры",Истина));		
	
	СписокТЧ.Вставить("Сертификаты",	Реквизиты_ТЧ);	
	
	Возврат Новый Структура("Шапка,СписокТЧ",Реквизиты_Ш,СписокТЧ);
КонецФункции //РеквизитыДляВыгрузкивЕД_Документ_ЭмиссияПодарочныхСертификатов()


#КонецОбласти

Функция МассивРеквизитовШапки(МетаОбъект)
	МР=Новый Массив;
	
	Для Каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл
		МР.Добавить(МетаРеквизит.Имя);	
	КонецЦикла; 
	
	Возврат МР;
КонецФункции // ()

Функция СтрокаПолейТаблицыРеквизитов(ТР)
	Возврат СтрСоединить(ТР.ВыгрузитьКолонку("ПолеЗапроса"),",");
КонецФункции //СтрокаПолейТаблицыРеквизитов(ТР)
 

#КонецОбласти


#Область Выгрузка


Функция ПустаяТаблицаРеквизитов()
	ТР	= Новый ТаблицаЗначений;
	
	ТР.Колонки.Добавить("Имя");
	ТР.Колонки.Добавить("ПолеЗапроса");
	ТР.Колонки.Добавить("ТипСтрокой");
	ТР.Колонки.Добавить("Кэшировать",Новый ОписаниеТипов("Булево"));

	Возврат ТР;
КонецФункции // ()

Функция СоздатьТаблицуРеквизитов(МетаОбъект,Знач СтрокаРеквизитов=Неопределено)
	ТР	= ПустаяТаблицаРеквизитов();	
	
	Если ЗначениеЗаполнено(СтрокаРеквизитов) Тогда
		СтрокаРеквизитов=СтрЗаменить(СтрокаРеквизитов,Символы.ПС,"");		
	Иначе
		СтрокаРеквизитов	= "*";		
	КонецЕсли;
	
	времМР	= СтрРазделить(СтрокаРеквизитов,",");
	
	МР	= Новый Массив;
	Для Каждого ИмяРеквизита Из времМР Цикл
		Если ИмяРеквизита="*" Тогда
			ВсеРеквизиты = МассивРеквизитов(МетаОбъект);
			Для Каждого ИмяРеквизита Из ВсеРеквизиты Цикл
				МР.Добавить(ИмяРеквизита);			
			КонецЦикла; 
		Иначе
			МР.Добавить(ИмяРеквизита);
		КонецЕсли; 	
	КонецЦикла;
	
	Для Каждого ОписанияПоля Из МР Цикл
		СтрокаТР 	= ТР.Добавить();
		Части		= СтрРазделить(ОписанияПоля," ");
		
		ПолеЗапроса	= Части[0];
		Псевдоним	= СтрЗаменить(?(Части.Количество()>1,Части[1],ПолеЗапроса),".","_");	
		
		СтрокаТР.Имя			= Псевдоним;
		СтрокаТР.ПолеЗапроса	= ПолеЗапроса;
		СтрокаТР.ТипСтрокой		= ОпределитьТипРеквизита(ПолеЗапроса,МетаОбъект);		
		СтрокаТР.Кэшировать		= СтрНайти(СтрокаТР.ТипСтрокой,".")>0; //Ссылочный тип (с точкой)
	КонецЦикла;	
	
	Возврат ТР;
КонецФункции

Функция МассивРеквизитов(МетаОбъект)
	МР=Новый Массив;
	
	Для Каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл		
		МР.Добавить(МетаРеквизит.Имя);
	КонецЦикла;
	
	Возврат МР;
КонецФункции //МассивРеквизитов(МетаОбъект,КлассОбъекта)

Процедура УстановитьПараметрыВСтрокеТР(ТР,Имя,Параметры)
	СтрокаТР	= ТР.Найти(Имя,"Имя");
	Если СтрокаТР<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТР,Параметры);		
	КонецЕсли;
КонецПроцедуры

Функция ЗапросДляВыгрузкиЕД(ИмяТаблицы,РеквизитыДляВыгрузки)
	Имена	= Новый Массив;
	Для Каждого СтрокаТР Из РеквизитыДляВыгрузки.Шапка Цикл
		ТекТаблица	= ?(СтрокаТР.ПолеЗапроса=СтрокаТР.Имя,"Список.","");
		Имена.Добавить(ТекТаблица+СтрокаТР.ПолеЗапроса+" КАК "+СтрокаТР.Имя);
	КонецЦикла;
	
	ДопРеквизиты=ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(РеквизитыДляВыгрузки,"ДопРеквизиты",Неопределено);
	
	Тексты=Новый Массив;
	Если Имена.Количество()>0 Тогда
		Тексты.Добавить(СтрСоединить(Имена,","));	
	КонецЕсли;	
	
	ПолеПорядка="ВТ_ТаблицаСсылок.Номер";	
	
	СписокТЧ=Неопределено;
	Если РеквизитыДляВыгрузки.Свойство("СписокТЧ",СписокТЧ) Тогда
		Для Каждого ЭлементТЧ Из СписокТЧ Цикл
			Имя_ТЧ	= ЭлементТЧ.Ключ;
			Имена.Очистить();
			
			Для Каждого СтрокаТР Из ЭлементТЧ.Значение Цикл
				Имена.Добавить(СтрокаТР.ПолеЗапроса+" КАК "+СтрокаТР.Имя);							
			КонецЦикла;					
			
			Если Имена.Количество()>0 Тогда
				Тексты.Добавить(Имя_ТЧ+".("+СтрСоединить(Имена,",")+") КАК "+Имя_ТЧ);
			КонецЕсли;
			
			ПолеПорядка=ПолеПорядка+",
			|	"+Имя_ТЧ+".НомерСтроки";
		КонецЦикла;	
	КонецЕсли;
	
	ПоляДР = Новый Массив;
	Если ДопРеквизиты<>Неопределено Тогда		
		ПоляДанных		= Новый Массив;
		Для Каждого ИмяДР Из СтрРазделить(ДопРеквизиты,",") Цикл
			ПоляДанных.Добавить(СтрШаблон("
			|МАКСИМУМ(
			|	ВЫБОР КОГДА Реквизиты.ИмяРеквизита=""%1"" ТОГДА ЗначениеРеквизита 
			|	ИНАЧЕ NULL 
			|КОНЕЦ
			|) КАК %1",ИмяДР)
			);	
			
			ПоляДР.Добавить(СтрШаблон("ДопРеквизиты.%1 КАК %1_ДР",ИмяДР));
		КонецЦикла;
		
		ТекстЗапросаДР="
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|(
		|ВЫБРАТЬ
		|	Реквизиты.Справочник КАК Ссылка,
		|	"+СтрСоединить(ПоляДанных,",")+"
		|ИЗ
		|	РегистрСведений.РеквизитыСправочников КАК Реквизиты
		|ПРАВОЕ СОЕДИНЕНИЕ 
		|	 ВТ_ТаблицаСсылок
		|ПО
		|	Реквизиты.Справочник=ВТ_ТаблицаСсылок.ОбъектСсылка
		|СГРУППИРОВАТЬ ПО 
		|	Реквизиты.Справочник
		|) КАК ДопРеквизиты
		|ПО
		|	Список.Ссылка=ДопРеквизиты.Ссылка
		|";
	Иначе
		ТекстЗапросаДР="";
	КонецЕсли; 
	
	Запрос	= Новый Запрос;	
	Запрос.Текст="
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ТаблицаСсылок ИЗ &ТаблицаСсылок КАК ТаблицаСсылок ИНДЕКСИРОВАТЬ ПО ОбъектСсылка
	|;
	|ВЫБРАТЬ	
	|	ВТ_ТаблицаСсылок.ОбъектТип			КАК ОбъектТип,
	|	ВТ_ТаблицаСсылок.ОбъектСсылкаУИД	КАК ОбъектСсылкаУИД,
	|	ВТ_ТаблицаСсылок.ОтборРС_Хэш 		КАК ОтборРС_Хэш,
	|	"+?(ПоляДР.Количество()=0,"",СтрСоединить(ПоляДР,",")+",")+"
	|	"+СтрСоединить(Тексты,",")+",	
	|	IsNULL(ДопИнформация.Получатель,ВТ_ТаблицаСсылок.Получатель)			КАК ПодразделениеПолучатель_ДИ,
	|	ВЫРАЗИТЬ(IsNULL(ДопИнформация.Получатель,ВТ_ТаблицаСсылок.Получатель)	КАК Справочник.Подразделения).ОсновнойСклад	КАК СкладПолучатель_ДИ
	|ИЗ
	|	"+ИмяТаблицы+" КАК Список	
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	ВТ_ТаблицаСсылок
	|ПО
	|	Список.Ссылка	= ВТ_ТаблицаСсылок.ОбъектСсылка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ФР_ОбъектыКВыгрузке КАК ДопИнформация
	|ПО
	|	ДопИнформация.ОбъектСсылкаУИД	= ВТ_ТаблицаСсылок.ОбъектСсылкаУИД
	|	И ДопИнформация.Номер			= ВТ_ТаблицаСсылок.Номер
	|"+ТекстЗапросаДР+"
	|УПОРЯДОЧИТЬ ПО 
	|	"+ПолеПорядка+"
	|";
	
	Возврат Запрос;
КонецФункции //ЗапросДляВыгрузкиЕД(ИмяТаблицы,РеквизитыДляВыгрузки)

Функция ОпределитьТипРеквизитов(СписокРеквизитов,МетаОбъект)
	Для Каждого Элемент Из СписокРеквизитов Цикл
		МетаРеквизит	= МетаОбъект.Реквизиты.Найти(Элемент.Ключ);	
		
		Если МетаРеквизит=Неопределено Тогда Продолжить КонецЕсли; 
		
		Типы=МетаРеквизит.Тип.Типы();
		Если Типы.Количество()>1 Тогда Продолжить КонецЕсли;	
		
		ТипРеквизита	= Типы[0];
		
		Если ЭтоПростойРеквизит(МетаРеквизит) Тогда Продолжить КонецЕсли; 
		Если ТипРеквизита=Тип("ХранилищеЗначения") Тогда Продолжить КонецЕсли;	
		
		СписокРеквизитов[Элемент.Ключ]=Метаданные.НайтиПоТипу(ТипРеквизита).ПолноеИмя();		
	КонецЦикла;
КонецФункции //ОпределитьТипРеквизитов(СписокРеквизитов,МетаОбъект)

Функция ОпределитьТипРеквизита(ИмяРеквизита,МетаОбъект)
	Результат		= "";
	
	МетаРеквизит	= МетаОбъект.Реквизиты.Найти(ИмяРеквизита);	
	//Если МетаРеквизит	= Неопределено Тогда
	//	Для Каждого ТекРеквизит Из МетаОбъект.СтандартныеРеквизиты Цикл
	//		Если ТекРеквизит.Имя=ИмяРеквизита Тогда
	//			МетаРеквизит = ТекРеквизит;
	//			Прервать;			
	//		КонецЕсли;		
	//	КонецЦикла;		
	//КонецЕсли; 
		
	Если МетаРеквизит<>Неопределено Тогда		
		Типы=МетаРеквизит.Тип.Типы();
		Если Типы.Количество()=1 Тогда 
			ТипРеквизита	= Типы[0];		
			Если ЭтоПростойРеквизит(МетаРеквизит) Тогда 
				Результат="Простой";
			ИначеЕсли ТипРеквизита=Тип("ХранилищеЗначения") Тогда 
				Результат="ХранилищеЗначения";			
			ИначеЕсли ТипРеквизита=Тип("УникальныйИдентификатор") Тогда 
				Результат="УникальныйИдентификатор";			
			Иначе				
				Результат=Метаданные.НайтиПоТипу(ТипРеквизита).ПолноеИмя();
			КонецЕсли;			
		Иначе
			Результат="Мульти";			
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Результат;		
КонецФункции //ОпределитьТипРеквизита(ИмяРеквизита,МетаОбъект)

Процедура ЗаполнитьКэшиПоНоменклатуреХарактеристикам_ЕД()
	//Выгрузка Номенклатура
	Начало	= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	МН		= МассивНовыхЭлементовКэша("Справочник.Номенклатура");	
	
	Время	= ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало;
	
	//Сообщить_("Соответствие в массив (номенклатура): "+Окр(Время/1000,2,1)+" сек., кол-во элементов: "+МН.Количество());	
	//Сообщить_("Запрос по номенклатуре...");
	
	Запрос	= Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	Ссылка,
	|	Код,
	|	КодПроизводителя,
	|	Наименование,
	|	Родитель				КАК Родитель,
	|	Родитель.Наименование 	КАК Родитель_Наименование,
	|	ЭтоГруппа,
	|	ПометкаУдаления 
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура 
	|ГДЕ Ссылка В (&МН)
	|ИНДЕКСИРОВАТЬ ПО Ссылка
	|;
	|ВЫБРАТЬ
	|	* 
	|ИЗ 
	|	ВТ_Номенклатура
	|";
	
	Запрос.УстановитьПараметр("МН",МН);
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Сч			= 0;
	
	Выборка		= Запрос.Выполнить().Выбрать();	
	ВсегоСтрок	= Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		Попытка
			ВыгрузитьСпр_Номенклатура_Элемент_КС(Выборка,Ложь);
		Исключение
		КонецПопытки;
		
		Сч=Сч+1;
		Если Сч%100=0 Тогда
			Состояние_("Заполнение кэша (номенклатура)"+(ВсегоСтрок-Сч));		
		КонецЕсли; 
	КонецЦикла; 
	
	Время	= ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало;	
	//Сообщить_("Время выгрузки (номенклатура): "+Окр(Время/1000,2,1)+" сек., сч: "+ВсегоСтрок);		
		
	//Выгрузка групп номенклатуры
	Запрос.Текст	= "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Родитель.ВерсияДанных	КАК ВерсияДанных,
	|	Родитель 				КАК Ссылка,
	|	Родитель.Код			КАК Код,
	|	Родитель.Наименование  	КАК Наименование,
	|	Родитель.Родитель		КАК Родитель
	|ИЗ 
	|	ВТ_Номенклатура
	|ГДЕ
	|	НЕ Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|";	
		
	ВыборкаГрупп	= Запрос.Выполнить().Выбрать();
	Пока ВыборкаГрупп.Следующий() Цикл		
		ВыгрузитьСпр_Номенклатура_Группа_КС(ВыборкаГрупп);
	КонецЦикла; 
	
	//Сообщить_("Групп: "+Выборка.Количество());	
	
	Запрос.Текст="ВЫБРАТЬ * ИЗ ВТ_Номенклатура";
	Выборка		= Запрос.Выполнить().Выбрать();
	ВсегоСтрок	= Выборка.Количество();
	
	Время	= ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало;
	//Сообщить_("Время выгрузки (группы номенклатуры): "+Окр(Время/1000,2,1)+" сек., сч: "+ВсегоСтрок);
	
	Начало	= ТекущаяУниверсальнаяДатаВМиллисекундах();
			
	//Выгрузка Характеристик	
	МХ		= МассивНовыхЭлементовКэша("Справочник.ФР_ХарактеристикиНоменклатуры");	
	
	Время	= ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало;
	//Сообщить_("Соответствие в массив (характеристики): "+Окр(Время/1000,2,1)+" сек., сч: "+МН.Количество());
	
	//Сообщить_("Запрос по характеристикам...");	
	
	РеквизитыКС	= "ВерсияДанных,Ссылка,Код,Наименование,Родитель";
	
	РеквизитыШапок.Вставить("Справочник.ФР_ХарактеристикиНоменклатуры.КС",РеквизитыКС);
	
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	"+РеквизитыКС+"
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ Ссылка В (&МХ)	
	|";
	
	Запрос.УстановитьПараметр("МХ",МХ);
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
		
	Выборка		= Запрос.Выполнить().Выбрать();
	Сч			= 0;
	ВсегоСтрок	= Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент_КС(Выборка);
		
		Сч=Сч+1;
		Если Сч%100=0 Тогда
			Состояние_("Заполнение кэша (характеристики номенклатуры):"+(ВсегоСтрок-Сч));		
		КонецЕсли; 
	КонецЦикла; 
	
	Время	= ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало;
	//Сообщить_("Время выгрузки (характеристики): "+Окр(Время/1000,2,1)+" сек., сч: "+ВсегоСтрок);

КонецПроцедуры

Процедура ЗаполнитьКэшиПоНоменклатуреХарактеристикам()
	//Вообще не нужна никакая хрень
	ЗаполнитьКэшиПоНоменклатуреХарактеристикам_ЕД(); //временно
КонецПроцедуры

Функция ПолучитьОбработчикиВыгрузки()
	ТО	 = Новый ТаблицаЗначений;
	
	ТО.Колонки.Добавить("ТипОбъекта");
	ТО.Колонки.Добавить("ВариантВыгрузки");	
	ТО.Колонки.Добавить("ИмяТаблицы");	
	ТО.Колонки.Добавить("ПроцедураВыгрузки");
	
	ТО.Индексы.Добавить("ТипОбъекта");	
	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.БлокировкаАкции",			"",				"ВыгрузитьДок_БлокировкаАкции");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ВводОстатковТМЦ",			"",				"ВыгрузитьДок_ВводОстатковТМЦ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Заказ",							"ЗПК_ЗПС",	"ВыгрузитьДок_ЗПК_ЗПС");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ЗаявкаНаВозвратОтПокупателя",	"",			"ВыгрузитьДок_ЗНВПок");		
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ЗаявкаНаРекламацию",		"",				"ВыгрузитьДок_ЗРК_АКТ");
	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Инвентаризация",			"",				"ВыгрузитьДок_ИНВ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.РекламационнаяНакладная",	"РКМ_КП",		"ВыгрузитьДок_РКМ_КП");	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ОприходованиеТМЦ",			"",				"ВыгрузитьДок_ОПР");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ОтчетКассовойСмены",		"",				"ВыгрузитьДок_ОКС");
	//+HELP-2306 20250220 Михайловский
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ЗаявкаНаПостСторонАссорт",			"",				"ВыгрузитьДок_ПСАЗ");
	//-HELP-2306 20250220 Михайловский
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ПереводСредств",			"",				"ВыгрузитьДок_ПС");	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Перемещение",				"ПРМ_ПНК",		"ВыгрузитьДок_ПРМ_ПНК_ЕЕ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Перемещение",				"ПРМ_РНК",		"ВыгрузитьДок_ПРМ_РНК_ЕЕ");	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Перемещение",				"ПРМ_ПРМ",		"ВыгрузитьДок_ПРМ_ПРМ_ЕЕ");	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ПрайсЛист",					"",				"ВыгрузитьДок_ПрайсЛист");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ПрайсЛист",					"РегистрСведений.ЦеныНоменклатуры", "ВыгрузитьРС_ЦеныНоменклатуры");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ПриходнаяНакладная",		"ПНК_ВЗВ",		"ВыгрузитьДок_ПНК_ВЗВ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.РасходнаяНакладная",		"РНК_ПНК",		"ВыгрузитьДок_РНК_ПНК_ЕЕ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.РасходныйКассовыйОрдер",	"",				"ВыгрузитьДок_РКО");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ПриходныйКассовыйОрдер",	"",				"ВыгрузитьДок_ПКО");	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.СверкаДанных",				"",				"ВыгрузитьДок_СВД");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.СписаниеТМЦ",				"",				"ВыгрузитьДок_СПН");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.УстановкаСкидок",			"",				"ВыгрузитьДок_УстановкаСкидок");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.УстановкаСкидок",			"РегистрСведений.СкидкиНоменклатуры",				"ВыгрузитьРС_СкидкиНоменклатуры");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ХранилищеКодовМаркировки",	"",				"ВыгрузитьДок_ХранилищеКодовМаркировки");  
	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.МаркировкаОстатковТЦ",	"",				"ВыгрузитьДок_МКО");
	
	//+SNL-203 20260515 Михайловский	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ЗаказИМ",		"",				"ВыгрузитьДок_ЗаказИМ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ВозвратИМ",		"",				"ВыгрузитьДок_ВозвратИМ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ВыкупИМ",		"",				"ВыгрузитьДок_ВыкупИМ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Возврат1ИМ",		"",				"ВыгрузитьДок_Возврат1ИМ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ОплатаИМ",		"",				"ВыгрузитьДок_ОплатаИМ");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ВозвратОплатыИМ",		"",				"ВыгрузитьДок_ВозвратОплатыИМ");
	//-SNL-203 20260515 Михайловский
	
	ДобавитьОбработчикВыгрузки(ТО,"Документ.Чек",							"",			"ВыгрузитьДок_Чек");
	ДобавитьОбработчикВыгрузки(ТО,"Документ.ЭмиссияПодарочныхСертификатов",	"ЭПС_СПН",	"ВыгрузитьДок_ЭПС_СПН");
	
	ДобавитьОбработчикВыгрузки(ТО,"ПланВидовХарактеристик.СвойстваОбъектов", "Элемент");	
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Акции",						"Группа");	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Акции",						"Элемент");	
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Валюты",						"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Валюты",						"РегистрСведений.КурсыВалют","ВыгрузитьРС_КурсыВалют");	
	//ДобавитьОбработчикВыгрузки(ТО,"Справочник.ВидыПодарочныхСертификатов","Элемент");	
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ГТД",							"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ВидыПодарочныхСертификатов",	"Элемент");	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ВидыПараметровРазмеровНоменклатуры",	"Элемент");	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ВидыПараметровЦветовНоменклатуры",	"Элемент");	
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Декларация",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Декларация",					"Группа");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ДисконтныеКарты",				"Элемент");	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Договоры",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Должности",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ДопПараметрРазмера",			"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ДопПараметрЦвета",			"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Контрагенты",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Контрагенты",					"Группа");
	
	//ДобавитьОбработчикВыгрузки(ТО,"Справочник.Контрагенты",	"Документ.ЦеныПоставщика","ВыгрузитьСпр_Контрагенты_Документ_ЦеныПоставщика");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Контрагенты", "Документ.ЦеныПоставщика","ВыгрузитьСпр_Контрагенты_РегистрСведений_СкидкиКонтрагентов_Документ_ЦеныПоставщика");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Кассы",						"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ЛинииНоменклатуры",			"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.МатериалыСостав",				"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.МатериалыСостав",				"Группа");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Номенклатура",				"Группа",									"ВыгрузитьСпр_Номенклатура_Группа");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Номенклатура",				"Элемент",									"ВыгрузитьСпр_Номенклатура_Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Номенклатура",				"Справочник.ХарактеристикиНоменклатуры",	"ВыгрузитьСпр_ХарактеристикиНоменклатуры_Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Номенклатура",				"РегистрСведений.История",					"ВыгрузитьРС_История");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Номенклатура",				"РегистрСведений.ЗначенияСвойствОбъектов",	"ВыгрузитьРС_ЗначенияСвойствОбъектов");	
	
	
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Организации",				"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Организации",				"Справочник.Контрагенты",	"ВыгрузитьСпр_Организации_Контрагенты_Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ПодарочныеСертификаты",	"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Подразделения",			"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Подразделения",			"РегистрСведений.КоличествоПосетителей",		"ВыгрузитьРС_КоличествоПосетителей_ЕЕ");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Пользователи",			"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ПричиныРекламаций",		"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ПричиныРекламаций",		"Группа");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Размеры",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Размеры",					"Группа");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Размеры",					"РегистрСведений.РеквизитыСправочников","ВыгрузитьРС_РеквизитыСправочников");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.РазмерыЧашки",			"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Склады",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Склады",					"Группа");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.КлассификаторСтранМира",	"Элемент",	"ВыгрузитьСпр_СтраныМира_Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.СтатьиЗатрат",			"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ТипыСкидок",				"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ТипыЦен",					"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ТНВЭД",					"Группа");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ТНВЭД",					"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ФизическиеЛица",			"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ФР_Бренды",				"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ФР_ВидыНоменклатуры",		"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ФР_ВидыНоменклатуры",		"Группа");	
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ФР_Коллекции",			"Элемент");	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ФР_НоменклатурныеГруппы",	"Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ШтрихКоды",				"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.ШтрихкодыУпаковокТоваров","Элемент");
	
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Цвета",					"Элемент");
	ДобавитьОбработчикВыгрузки(ТО,"Справочник.Цвета",					"Группа");
	
	
	
	ДобавитьОбработчикВыгрузки(ТО,"ПланОбмена.Основной",				"Элемент",		"ВыгрузитьПО_ОбменСТЦ"); // во франч базе будет загружен как новый узел магазина
	
	Возврат ТО;
КонецФункции //ПолучитьТаблицуОбработчиковВыгрузки()

Функция ДобавитьОбработчикВыгрузки(ТО,	ИмяТаблицы, ВариантВыгрузки,Знач ПроцедураВыгрузки = "")
	СтрокаТО	= ТО.Добавить();
	
	СтрокаТО.ТипОбъекта			= СформироватьТипСсылки(ИмяТаблицы);
	СтрокаТО.ВариантВыгрузки	= ВариантВыгрузки;	
	СтрокаТО.ИмяТаблицы			= ИмяТаблицы;
	
	Если ПустаяСтрока(ПроцедураВыгрузки) Тогда
		Части	= СтрРазделить(ИмяТаблицы,".");
		
		Класс	= Части[0];
		Если Класс="Документ" Тогда
			ПрефиксКласса="Док";		
		ИначеЕсли Класс="ПланВидовХарактеристик" Тогда				
			ПрефиксКласса="Пвх";		
		ИначеЕсли Класс="Справочник" Тогда
			ПрефиксКласса="Спр";
		Иначе
			ПрефиксКласса=Лев(Класс,3);						
		КонецЕсли; 
		
		ПроцедураВыгрузки	= "Выгрузить"+ПрефиксКласса+"_"+Части[1]+"_"+ВариантВыгрузки;
	КонецЕсли;
	
	СтрокаТО.ПроцедураВыгрузки	= ПроцедураВыгрузки;
	
КонецФункции //ДобавитьОбработчикВыгрузки(ТО,	ИмяТаблицы, ВариантВыгрузки,Знач ПроцедураВыгрузки = "")
 
Функция СформироватьТипСсылки(ИмяМетаданных,ВернутьИмяТипа=Ложь)
	Результат   = Неопределено;
	Части		= СтрРазделить(ИмяМетаданных,".");
	Если Части.Количество()=2 Тогда
		Результат	= Части[0]+"Ссылка."+Части[1];
		Если НЕ ВернутьИмяТипа Тогда
			Результат	= Тип(Результат);		
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //СформироватьТипСсылки(ИмяМетаданных)

Функция ВыгрузитьПакетом(РежимВыгрузки, ДопПараметры=Неопределено) Экспорт
	Результат		= Новый Структура("ИД_Сеанса,Адрес,ВыгруженоОбъектов,ВыгруженныеОбъекты,Ошибки,Данные",ИД_Сеанса,"",0,Новый Массив,Новый Массив,"");
	
	СписокОбъектов	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"СписокОбъектов");
	Получатель		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"Получатель");	
	ИД_Сеанса		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ИД_Сеанса",Новый УникальныйИдентификатор);
	
	Если СписокОбъектов<>Неопределено И СписокОбъектов.Количество()=0 Тогда 
		ТекстСообщения	= "Передан пустой список объектов !";
		Сообщить_(,СтатусСообщения.Важное);
		Результат.Ошибки.Добавить(ТекстСообщения);
		Возврат Результат; 
	КонецЕсли;
	
	НужнаИнициализация	= Ложь;
	Если ТекУзелПолучатель<>УзелПолучатель Тогда
		ТекУзелПолучатель	= УзелПолучатель;
		НужнаИнициализация	= Истина;
	КонецЕсли; 
	
	Если КомпонентаОбмена=Неопределено Тогда
		НужнаИнициализация=Истина;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(УзелОтправитель)  Тогда
		УзелОтправитель	= ПланыОбмена[УзелПолучатель.Метаданные().Имя].ЭтотУзел();	
	КонецЕсли;	
	
	Если РежимВыгрузки="Очередь" Тогда				
		Очередь				= "to_"+ТекУзелПолучатель.Код;
		Если НужнаИнициализация И НЕ  ИнициализироватьКомпонентуОбмена(ТекУзелПолучатель) Тогда
			ТекстСообщения	= "Обмен с ФР. Не удалось соединиться с очередью !";
			ЗаписатьВЛог("Регламент",ТекстСообщения,"Ошибка",Истина);		
			
			Результат.Ошибки.Добавить(ТекстСообщения);
			Возврат Результат;
		КонецЕсли;		
	КонецЕсли;	
	
	Кэши	= Новый Соответствие;	
	
	Если РежимВыгрузки="Файл" Тогда
		ИнициализироватьЗаписьXML(ИмяФайлаОбмена);	
	КонецЕсли;		
	
	ОбработчикиВыгрузки	= ПолучитьОбработчикиВыгрузки();
	Для Каждого СтрокаО Из ОбработчикиВыгрузки Цикл
		Если СтрНайти(СтрокаО.ВариантВыгрузки,"РегистрСведений.")=0 Тогда
			Реквизиты	= РеквизитыДляВыгрузки(СтрокаО.ИмяТаблицы,СтрокаО.ВариантВыгрузки);	
		КонецЕсли;		
	КонецЦикла; 
	
	Если СписокОбъектов=Неопределено Тогда
		Запрос			= Новый Запрос;
		Запрос.Текст	= "	
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	ОбъектТип,
		|	ВариантВыгрузки	
		|ИЗ
		|	РегистрСведений.ФР_ОбъектыКВыгрузке
		|ИТОГИ ПО ОбъектТип,ВариантВыгрузки";		
		
		ЗапросСписка	= Неопределено;
	Иначе
		Запрос	= ЗапросПоСпискуОбъектов(СписокОбъектов,Получатель);
		
		Запрос.Текст="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	ОбъектТип,
		|	ВариантВыгрузки	
		|ИЗ
		|	ВТ_ОбъектыКВыгрузке
		|ИТОГИ ПО ОбъектТип,ВариантВыгрузки";
		
		ЗапросСписка = Новый Запрос;
		ЗапросСписка.МенеджерВременныхТаблиц	= Запрос.МенеджерВременныхТаблиц;
		
		ЗапросСписка.Текст="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	ОбъектТип,
		|	ОбъектСсылка,
		|	ОбъектСсылкаУИД,
		|	ВариантВыгрузки,			
		|	Номер,
		|	Получатель
		|ИЗ
		|	ВТ_ОбъектыКВыгрузке		
		|ГДЕ
		|	ОбъектТип 			= &ОбъектТип
		|	И ВариантВыгрузки	= &ВариантВыгрузки
		|	И Номер				> &НачНомер
		|УПОРЯДОЧИТЬ ПО 
		|	ОбъектТип,
		|	ВариантВыгрузки,			
		|	Номер,
		|	ОбъектСсылка
		|";		
	КонецЕсли; 
	
	ВыборкаПоТипам	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ОбъектТип");
			
	Пока ВыборкаПоТипам.Следующий() Цикл
		ОбъектТип	=  ВыборкаПоТипам.ОбъектТип;
		ВыборкаПоВариантамВыгрузки = ВыборкаПоТипам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ВариантВыгрузки");
		Пока ВыборкаПоВариантамВыгрузки.Следующий() Цикл			
			ОбработкаПрерыванияПользователя_();			
			
			ВариантВыгрузки	= ВыборкаПоВариантамВыгрузки.ВариантВыгрузки;
			
			Если ЗапросСписка<>Неопределено Тогда
				ЗапросСписка.УстановитьПараметр("ОбъектТип",		ОбъектТип);
				ЗапросСписка.УстановитьПараметр("ВариантВыгрузки",	ВариантВыгрузки);
			КонецЕсли; 
			
			СтрокиТО		= ОбработчикиВыгрузки.НайтиСтроки(Новый Структура("ИмяТаблицы,ВариантВыгрузки",ОбъектТип,СокрЛП(ВариантВыгрузки))); 
			Если СтрокиТО.Количество()=0 Тогда
				Сообщить_("Не найдена процедура выгрузки ! Тип объекта: """+ОбъектТип+""", вариант выгрузки: """+ВариантВыгрузки+""" !",СтатусСообщения.Важное);
			ИначеЕсли СтрокиТО.Количество()=1 Тогда
				СтрокаТО	= СтрокиТО[0];
				Если СтрНайти(ВариантВыгрузки,"РегистрСведений.")=1 Тогда
					ТекРез	= ВыгрузитьПакетом_Регистр(СтрокаТО.ИмяТаблицы,СтрокаТО.ПроцедураВыгрузки,ВариантВыгрузки,РежимВыгрузки);				
				Иначе
					Попытка
						ТекРез	= ВыгрузитьПакетом_Объект(СтрокаТО.ИмяТаблицы,СтрокаТО.ПроцедураВыгрузки,ВариантВыгрузки,РежимВыгрузки,ЗапросСписка);
						Если ТекРез.ЕстьОшибки Тогда
							ДобавитьОшибки(Результат,ТекРез);
						КонецЕсли; 
						Результат.ВыгруженоОбъектов=Результат.ВыгруженоОбъектов+ТекРез.ВыгруженоОбъектов;
					Исключение
						ТекстСообщения	= "Ошибка выгрузки объекта: "+ОбъектТип+", вариант выгрузки: "+ВариантВыгрузки+". "+ОписаниеОшибки();
						Сообщить_(ТекстСообщения);
						Результат.Ошибки.Добавить(ТекстСообщения);
					КонецПопытки;					
				КонецЕсли;			
			Иначе
				Сообщить_("Определено несколько процедур выгрузки ! Тип объекта: """+ОбъектТип+""", вариант выгрузки: """+ВариантВыгрузки+""" !",СтатусСообщения.Важное);
			КонецЕсли;			
		КонецЦикла; 
	КонецЦикла;		
	
	Если РежимВыгрузки = "Файл" Тогда		
		Результат.Данные = ЗакрытьЗаписьXML();	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьОшибки(Рез1,Рез2)
	Для Каждого ТекстОшибки Из Рез2.Ошибки Цикл
		Рез1.Ошибки.Добавить(ТекстОшибки);	
	КонецЦикла;
КонецПроцедуры
 

Функция ЗапросПоСпискуОбъектов(СписокОбъектов,Получатель=Неопределено)	
	ТипСтрока200	= ПолучитьОписаниеТиповСтроки(200);
	
	ТабОбъектов = Новый ТаблицаЗначений();		
	ТабОбъектов.Колонки.Добавить("ОбъектТип",		ТипСтрока200);
	ТабОбъектов.Колонки.Добавить("ОбъектСсылкаУИД",	Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТабОбъектов.Колонки.Добавить("ОбъектСсылка",	ФР_ОбщегоНазначения_С.Тип_ВсеСсылки());
	ТабОбъектов.Колонки.Добавить("Тип",				ТипСтрока200);	
	ТабОбъектов.Колонки.Добавить("Вид",				ТипСтрока200);	
	ТабОбъектов.Колонки.Добавить("ИмеетГруппы",		Новый ОписаниеТипов("Булево"));
	ТабОбъектов.Колонки.Добавить("ВариантВыгрузки",	ТипСтрока200);	
	ТабОбъектов.Колонки.Добавить("Номер",			ПолучитьОписаниеТиповЧисла(10));
	ТабОбъектов.Колонки.Добавить("Получатель",		Новый ОписаниеТипов("СправочникСсылка.Подразделения"));	
	
	Если ТипЗнч(СписокОбъектов)=Тип("Массив") Тогда
		Для Каждого Элемент Из СписокОбъектов Цикл			
			СтрокаТО					= ТабОбъектов.Добавить();
			СтрокаТО.ОбъектСсылка	 	= Элемент;
		КонецЦикла; 	
	ИначеЕсли ТипЗнч(СписокОбъектов)=Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаИсх Из СписокОбъектов Цикл
			СтрокаТО					= ТабОбъектов.Добавить();
			СтрокаТО.ОбъектСсылка		= СтрокаИсх.ОбъектСсылка;
			СтрокаТО.ВариантВыгрузки	= СтрокаИсх.ВариантВыгрузки;
		КонецЦикла;				
	КонецЕсли; 
	
	Менеджер = РегистрыСведений.ФР_ОбъектыКВыгрузке;
	
	СтрокиКУдалению=Новый Массив;
	
	Номер	= 0;
	Для Каждого СтрокаТО Из ТабОбъектов Цикл
		Если ЗначениеЗаполнено(СтрокаТО.ОбъектСсылка) Тогда
			Номер = Номер+1;
			
			ОТ	  = ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(СтрокаТО.ОбъектСсылка)));			
			
			СтрокаТО.ОбъектСсылкаУИД 	= СтрокаТО.ОбъектСсылка.УникальныйИдентификатор();			
			СтрокаТО.ОбъектТип			= ОТ.ПолноеИмя;			
			СтрокаТО.Номер				= Номер;
			
			Если ОТ.КлассЕЧ="Справочник" ИЛИ ОТ.КлассЕЧ="ПланВидовХарактеристик" Тогда				
				СтрокаТО.ИмеетГруппы	= ОТ.ИмеетГруппы;
			КонецЕсли;
			
			СтрокаТО.ВариантВыгрузки	= РегистрыСведений.ФР_ОбъектыКВыгрузке.ВариантВыгрузки(СтрокаТО.ОбъектСсылка,СтрокаТО.ВариантВыгрузки);
			СтрокаТО.Получатель			= Получатель;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого СтрокаТО Из СтрокиКУдалению Цикл
		ТабОбъектов.Удалить(СтрокаТО);	
	КонецЦикла;
	
	Запрос=Новый ("Запрос");
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст="	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ТабОбъектов ИЗ &ТабОбъектов КАК ТабОбъектов	
	|;	
	|ВЫБРАТЬ
	|	ОбъектТип		КАК ОбъектТип,
	|	ОбъектСсылка	КАК ОбъектСсылка,
	|	ОбъектСсылкаУИД	КАК ОбъектСсылкаУИД,
	|	ВЫБОР 
	|		КОГДА ИмеетГруппы И ВариантВыгрузки="""" ТОГДА 
	|			ВЫБОР 
	|				КОГДА ОбъектСсылка.ЭтоГруппа ТОГДА ""Группа"" 
	|				ИНАЧЕ ""Элемент"" 
	|			КОНЕЦ
	|		ИНАЧЕ ВариантВыгрузки
	|	КОНЕЦ КАК ВариантВыгрузки,
	|	Номер,
	|	Получатель
	|ПОМЕСТИТЬ ВТ_ОбъектыКВыгрузке
	|ИЗ
	|	ВТ_ТабОбъектов
	|";	
	
	Запрос.УстановитьПараметр("ТабОбъектов",ТабОбъектов);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ * ИЗ ВТ_ОбъектыКВыгрузке";
//	Т1=Запрос.Выполнить().Выгрузить();
	 
	Возврат Запрос;
КонецФункции //ЗапросПоСпискуОбъектов()

Функция ИмяМетаданныхПоТипу(ТипОбъекта)
	Результат	= ""+ТипОбъекта;
	МетаОбъект	= Метаданные.НайтиПоТипу(ТипОбъекта);
	Если МетаОбъект<>Неопределено Тогда
		Результат=МетаОбъект.ПолноеИмя();			
	КонецЕсли; 	
	Возврат Результат;
КонецФункции //ИмяМетаданныхПоТипу(ТипОбъекта)

Функция ТекстЗапросаСписка_Документ(ИмяТаблицы)
	ТекстЗапроса="
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ОбъектТип,
	|	ОбъектСсылкаУИД,
	|	ОтборРС_Хэш,	
	|	Номер
	|ИЗ 
	|	РегистрСведений.ФР_ОбъектыКВыгрузке	
	|ГДЕ
	|	ОбъектТип			= &ИмяТаблицы
	|	И ВариантВыгрузки	= &ВариантВыгрузки
	|	И Номер>&НачНомер
	|	И ОтборРС_Хэш=""""
	|УПОРЯДОЧИТЬ ПО 
	|	Номер
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ТекстЗапросаСписка_Документ(ИмяТаблицы)

Функция ТекстЗапросаСписка_Справочник(ИмяТаблицы)
	ТекстЗапроса="
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ОбъектТип,
	|	ОбъектСсылкаУИД,
	|	ОтборРС_Хэш,
	|	Номер
	|ИЗ 
	|	РегистрСведений.ФР_ОбъектыКВыгрузке	
	|ГДЕ
	|	ОбъектТип			= &ИмяТаблицы
	|	И ВариантВыгрузки	= &ВариантВыгрузки		
	|	И Номер>&НачНомер	
	|УПОРЯДОЧИТЬ ПО 
	|	Номер
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ТекстЗапросаСписка_Документ(ИмяТаблицы)

Функция ТекстЗапросаСписка_РегистрСведений(ИмяТаблицы,ВариантВыгрузки)
	ТекстЗапроса="
	|ВЫБРАТЬ	
	|	ОбъектТип,
	|	ОбъектСсылкаУИД	КАК ОбъектСсылкаУИД,
	|	Номер,
	|	ОтборРС_Хэш,
	|	ОтборРС
	|ИЗ 
	|	РегистрСведений.ФР_ОбъектыКВыгрузке	
	|ГДЕ
	|	ОбъектТип = """+ИмяТаблицы+"""
	|	И ВариантВыгрузки=&ВариантВыгрузки	
	|	И Номер>&НачНомер
	|УПОРЯДОЧИТЬ ПО 
	|	Номер
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ТекстЗапросаСписка_РегистрСведений(ИмяТаблицы)

Функция ТекстЗапросаСписка_РегистрНакопления(ИмяТаблицы)
	ТекстЗапроса="
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ВЫРАЗИТЬ(СсылкаНаОбъект КАК "+ИмяТаблицы+") 				КАК СсылкаНаОбъект,
	|	ВЫРАЗИТЬ(СсылкаНаОбъект КАК "+ИмяТаблицы+").МоментВремени 	КАК МоментВремени
	|ИЗ 
	|	РегистрСведений.ФР_ОбъектыКВыгрузке	
	|ГДЕ
	|	СсылкаНаОбъект ССЫЛКА "+ИмяТаблицы+"
	|	И ВариантВыгрузки=&ВариантВыгрузки	
	//|	И ВЫРАЗИТЬ(СсылкаНаОбъект КАК "+ИмяТаблицы+").Дата МЕЖДУ &Дата1 И &Дата2	
	|	И ВЫРАЗИТЬ(СсылкаНаОбъект КАК "+ИмяТаблицы+").МоментВремени>&МоментВремени
	|	И ОтборРС_Хэш<>""""
	|УПОРЯДОЧИТЬ ПО 
	|	ВЫРАЗИТЬ(СсылкаНаОбъект КАК "+ИмяТаблицы+").МоментВремени
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ТекстЗапросаСписка_Документ(ИмяТаблицы)

//+HELP-2306 20250220 Михайловский
Функция ВыгрузитьСпр_ХарактеристикиНоменклатуры_ЭлементГрп(Реквизиты)	
	ИмяТаблицы		= "Справочник.Номенклатура";
	ОбъектХДТО = СоздатьОбъектХДТО("Справочник.ХарактеристикиНоменклатуры.Элемент",ПространствоИмен_ЕЕ);		
	ЗаполнитьЗначенияСвойств(ОбъектХДТО,Реквизиты);
	ОбъектХДТО.Владелец		= Реквизиты.Родитель;
	ОбъектХДТО.ГТИН			= СокрЛП(Реквизиты.Ссылка.ГТИН);
	Если Реквизиты.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.МБП 
		ИЛИ Реквизиты.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ОсновноеСредство Тогда
		ОбъектХДТО.Наименование	= СокрЛП(Реквизиты.Ссылка.Наименование);
	Иначе			
		ОбъектХДТО.Наименование	= СокрЛП(Реквизиты.Ссылка.Цвет.Наименование)+" "+СокрЛП(Реквизиты.Ссылка.Размер.Наименование);
		Если СтрДлина(СокрЛП(ОбъектХДТО.Наименование)) < 4 Тогда
			НаимХ = СокрЛП(Реквизиты.Ссылка.Наименование);
			ПозП = СтрНайти(НаимХ, " ");
			Если ПозП > 1 Тогда
				НаимХ = Сред(НаимХ, ПозП + 1);
				ПозП1 = СтрНайти(НаимХ, " ");
				Если ПозП1 > 1 Тогда
					НаимХ = Сред(НаимХ, ПозП1 + 1);
					ПозП2 = СтрНайти(НаимХ, " ");
					
					Если ПозП2 > 1 Тогда
						Если СтрДлина(Сред(НаимХ, ПозП2 + 1)) > 1 Тогда
							ОбъектХДТО.Наименование = Сред(НаимХ, ПозП2 + 1);
						Иначе
							ОбъектХДТО.Наименование = НаимХ;
						КонецЕсли;	
					Иначе
						ОбъектХДТО.Наименование = НаимХ;
					КонецЕсли;
					
				Иначе
					ОбъектХДТО.Наименование = НаимХ;
				КонецЕсли;	
			Иначе
				ОбъектХДТО.Наименование = НаимХ;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	ОбъектХДТО.Код	= СокрЛП(Реквизиты.Ссылка.Код);
	ОбъектХДТО.ПервичнаяГруппа = XMLСтрока(Реквизиты.Родитель);
	ОбъектХДТО.Ссылка = XMLСтрока(Реквизиты.Ссылка);
	ОбъектХДТО.Размер = XMLСтрока(Реквизиты.Ссылка.Размер);
	ОбъектХДТО.Цвет = XMLСтрока(Реквизиты.Ссылка.Цвет);
	ДобавитьЭлементХДТО(ОбъектХДТО, Реквизиты.ПометкаУдаления,	"ПометкаУдаления",	"boolean",	ПространствоИмен_СТ);
	ОбъектХДТОВл					= СоздатьОбъектХДТО("Справочник.Номенклатура.Элемент",ПространствоИмен_ЕЕ);
	ОбъектХДТОВл.Ссылка					= XMLСтрока(Реквизиты.Родитель);
	ОбъектХДТОВл.Наименование	= СокрЛП(Реквизиты.Родитель.Наименование);
	ОбъектХДТОВл.Код	= СокрЛП(Реквизиты.Родитель.Код);
	ОбъектХДТОВл.НаименованиеДляЭтикетки	= СокрЛП(Реквизиты.Родитель.РусскоеНаименование);
	
	Если СтрДлина(СокрЛП(ОбъектХДТОВл.НаименованиеДляЭтикетки)) < 4 Тогда
		НаимН = СокрЛП(Реквизиты.Родитель.Наименование);
		НаимН1 = НаимН;
		НаимН2 = НаимН;
		ПозПН = СтрНайти(НаимН, " ");
		Если ПозПН > 1 Тогда
			НаимН1 = Сред(НаимН, ПозПН + 1);
			ПозПН1 = СтрНайти(НаимН1, " ");
			Если ПозПН1 > 1 Тогда
				НаимН2 = Сред(НаимН1, ПозПН1 + 1);
			КонецЕсли;	
		КонецЕсли;
		ОбъектХДТОВл.НаименованиеДляЭтикетки = ?(СтрДлина(НаимН) <= 32, НаимН, ?(СтрДлина(НаимН1) <= 32, НаимН1, НаимН2));
		
	КонецЕсли;
	
	ОбъектХДТОВл.Артикул					= СокрЛП(Реквизиты.Родитель.КодПроизводителя);
	ОбъектХДТОВл.ВидНоменклатуры			= XMLСтрока(Реквизиты.Родитель.ФР_ВидНоменклатуры);
	ОбъектХДТОВл.Бренд			= XMLСтрока(Реквизиты.Родитель.ФР_Бренд);
	ОбъектХДТОВл.Коллекция			= XMLСтрока(Реквизиты.Родитель.ФР_Коллекция);
	ОбъектХДТОВл.КодТНВЭД = XMLСтрока(Реквизиты.Родитель.ТНВЭД);
	Если ЗначениеЗаполнено(Реквизиты.Родитель.СтавкаНДС) Тогда
		ОбъектХДТОВл.СтавкаНДС	= ВыгрузитьПер_СтавкаНДС(Реквизиты.Родитель.СтавкаНДС);	
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(Реквизиты.Родитель.Родитель) Тогда
			ОбъектХДТОВл.Родитель	= XMLСтрока(Реквизиты.Родитель.Родитель);	
		КонецЕсли;
	Исключение
	КонецПопытки;
	ДобавитьЭлементХДТО(ОбъектХДТОВл, Реквизиты.Родитель.ТипТовара,	"ТипТовара", "string", ПространствоИмен_СТ);
	ДобавитьЭлементХДТО(ОбъектХДТОВл, XMLСтрока(Реквизиты.Родитель.ВидНоменклатуры), "ВидНоменклатурыЕЕ", "string",	ПространствоИмен_СТ);	
	ИмяТЧВл			= "СоставНоменклатуры";
	ТЧ_ХДТОВл			= СоздатьОбъектХДТО(ИмяТаблицы + "." + ИмяТЧВл, ПространствоИмен_ЕЕ);		
	
	Запр = Новый Запрос;
	Запр.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураСоставНоменклатуры.Ссылка КАК Ссылка,
	|	НоменклатураСоставНоменклатуры.НомерСтроки КАК НомерСтроки,
	|	НоменклатураСоставНоменклатуры.МатериалСостав КАК МатериалСостав,
	|	НоменклатураСоставНоменклатуры.Процент КАК Процент
	|ИЗ
	|	Справочник.Номенклатура.СоставНоменклатуры КАК НоменклатураСоставНоменклатуры
	|ГДЕ
	|	НоменклатураСоставНоменклатуры.Ссылка = &Ссылка";
	Запр.УстановитьПараметр("Ссылка", Реквизиты.Родитель);
	ВыборкаПоТЧ		= Запр.Выполнить().Выбрать();
	Пока ВыборкаПоТЧ.Следующий() Цикл		
		СтрокаТЧ_ХДТОВл				= СоздатьОбъектХДТО(СтрШаблон("%1.%2.%3",ИмяТаблицы, ИмяТЧВл ,"Строка"),ПространствоИмен_ЕЕ);				
		ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТОВл, ВыборкаПоТЧ);		
		
		ТЧ_ХДТОВл.Строка.Добавить(СтрокаТЧ_ХДТОВл);
	КонецЦикла;		
	
	Если ТЧ_ХДТОВл.Строка.Количество()>0 Тогда
		ОбъектХДТОВл[ИмяТЧВл]=ТЧ_ХДТОВл;
	КонецЕсли;
	
	МОб = Новый Массив;
	
	МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТОВл, Реквизиты.Родитель, "Справочник.Номенклатура", XMLСтрока(Реквизиты.Родитель), "", "Элемент"));
	МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТО, Реквизиты.Ссылка, "Справочник.Номенклатура", XMLСтрока(Реквизиты.Ссылка), "", "Справочник.ХарактеристикиНоменклатуры"));
	Попытка
		
		ОбъектХДТОКол					= СоздатьОбъектХДТО("Справочник.Коллекции.Элемент", ПространствоИмен_ЕЕ);
		ОбъектХДТОКол.Ссылка = XMLСтрока(Реквизиты.Родитель.ФР_Коллекция);
		ОбъектХДТОКол.Владелец = XMLСтрока(Реквизиты.Родитель.ФР_Бренд);
		ОбъектХДТОКол.Наименование = СокрЛП(Реквизиты.Родитель.ФР_Коллекция.Наименование);
		ОбъектХДТОКол.Код	= Число(Формат(СокрЛП(Реквизиты.Родитель.ФР_Коллекция.Код), "ЧГ=0"));
		МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТОКол, Реквизиты.Родитель.ФР_Коллекция, "Справочник.Коллекции", XMLСтрока(Реквизиты.Родитель.ФР_Коллекция), "", "Элемент"));
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат МОб;
КонецФункции //-HELP-2306 20250220 Михайловский

//+HELP-7358 20251022 Михайловский
Функция ВыгрузитьСпр_Номенклатуры_Грп(ТЗГрп)	
	ИмяТаблицы		= "Справочник.Номенклатура";
	ТЗР = ТЗГрп.Скопировать();
	ТЗР.Свернуть("Родитель");
	ТЗР1 = ТЗГрп.Скопировать();
	ТЗР1.Свернуть("Родитель1");
	ТЗР2 = ТЗГрп.Скопировать();
	ТЗР2.Свернуть("Родитель2");
	ТЗР3 = ТЗГрп.Скопировать();
	ТЗР3.Свернуть("Родитель3");
	МОб = Новый Массив;
	Попытка 
		
		Для Каждого ТСтр Из ТЗР3 Цикл		
			Если ЗначениеЗаполнено(ТСтр.Родитель3) Тогда
				ОбъектХДТОВлРод3 = СоздатьОбъектХДТО("Справочник.Номенклатура.Элемент",ПространствоИмен_ЕЕ);
				ОбъектХДТОВлРод3.Ссылка = XMLСтрока(ТСтр.Родитель3);
				ОбъектХДТОВлРод3.Наименование	=СокрЛП(ТСтр.Родитель3.Наименование);
				ОбъектХДТОВлРод3.Код	= СокрЛП(ТСтр.Родитель3.Код);
				ДобавитьЭлементХДТО(ОбъектХДТОВлРод3, Истина,	"ЭтоГруппа",	"boolean",	ПространствоИмен_СТ);
				МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТОВлРод3, ТСтр.Родитель3, "Справочник.Номенклатура", XMLСтрока(ТСтр.Родитель3), "", "Группа"));
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТСтр Из ТЗР2 Цикл		
			Если ЗначениеЗаполнено(ТСтр.Родитель2) Тогда
				ОбъектХДТОВлРод2 = СоздатьОбъектХДТО("Справочник.Номенклатура.Элемент",ПространствоИмен_ЕЕ);
				ОбъектХДТОВлРод2.Ссылка = XMLСтрока(ТСтр.Родитель2);
				ОбъектХДТОВлРод2.Наименование	=СокрЛП(ТСтр.Родитель2.Наименование);
				ОбъектХДТОВлРод2.Код	= СокрЛП(ТСтр.Родитель2.Код);
				ДобавитьЭлементХДТО(ОбъектХДТОВлРод2, Истина,	"ЭтоГруппа",	"boolean",	ПространствоИмен_СТ);
				МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТОВлРод2, ТСтр.Родитель2, "Справочник.Номенклатура", XMLСтрока(ТСтр.Родитель2), "", "Группа"));
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТСтр Из ТЗР1 Цикл		
			Если ЗначениеЗаполнено(ТСтр.Родитель1) Тогда
				ОбъектХДТОВлРод1 = СоздатьОбъектХДТО("Справочник.Номенклатура.Элемент",ПространствоИмен_ЕЕ);
				ОбъектХДТОВлРод1.Ссылка = XMLСтрока(ТСтр.Родитель1);
				ОбъектХДТОВлРод1.Наименование	=СокрЛП(ТСтр.Родитель1.Наименование);
				ОбъектХДТОВлРод1.Код	= СокрЛП(ТСтр.Родитель1.Код);
				ДобавитьЭлементХДТО(ОбъектХДТОВлРод1, Истина,	"ЭтоГруппа",	"boolean",	ПространствоИмен_СТ);
				МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТОВлРод1, ТСтр.Родитель1, "Справочник.Номенклатура", XMLСтрока(ТСтр.Родитель1), "", "Группа"));
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТСтр Из ТЗР Цикл		
			Если ЗначениеЗаполнено(ТСтр.Родитель) Тогда
				ОбъектХДТОВлРод = СоздатьОбъектХДТО("Справочник.Номенклатура.Элемент",ПространствоИмен_ЕЕ);
				ОбъектХДТОВлРод.Ссылка = XMLСтрока(ТСтр.Родитель);
				ОбъектХДТОВлРод.Наименование	=СокрЛП(ТСтр.Родитель.Наименование);
				ОбъектХДТОВлРод.Код	= СокрЛП(ТСтр.Родитель.Код);
				ДобавитьЭлементХДТО(ОбъектХДТОВлРод, Истина,	"ЭтоГруппа",	"boolean",	ПространствоИмен_СТ);
				МОб.Добавить(Новый Структура("ОбъектХДТО, Ссылка, ОбъектТип, ОбъектСсылкаУИД, ОтборРС_Хэш, ВариантВыгрузки", ОбъектХДТОВлРод, ТСтр.Родитель, "Справочник.Номенклатура", XMLСтрока(ТСтр.Родитель), "", "Группа"));
			КонецЕсли;
		КонецЦикла;
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат МОб;
КонецФункции //-HELP-7358 20251022 Михайловский

//+HELP-2306 20250220 Михайловский
Функция ЗаполнитьКэшиПоНоменклатуреХарактеристикамПСАЗ()
	Рез = Новый Массив;
	МН		= МассивНовыхЭлементовКэша("Справочник.Номенклатура");	
	
	Запрос	= Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	Ссылка,
	|	Код,
	|	КодПроизводителя,
	|	Наименование,
	|	Родитель				КАК Родитель,
	|	Родитель.Наименование 	КАК Родитель_Наименование,
	|	ЭтоГруппа,
	|	ПометкаУдаления 
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура 
	|ГДЕ Ссылка В (&МН)
	//|ИНДЕКСИРОВАТЬ ПО Ссылка
	|;
	|ВЫБРАТЬ
	|	* 
	|ИЗ 
	|	ВТ_Номенклатура
	|	ГДЕ НЕ ЭтоГруппа
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Родитель.ВерсияДанных	КАК ВерсияДанных,
	|	Родитель 				КАК Ссылка,
	|	Родитель.Код			КАК Код,
	|	Родитель.Наименование  	КАК Наименование,
	|	Родитель.Родитель		КАК Родитель, 
	//+HELP-7358 20251022 Михайловский
	|	Родитель.Родитель.Родитель		КАК Родитель1,
	|	Родитель.Родитель.Родитель.Родитель		КАК Родитель2,
	|	Родитель.Родитель.Родитель.Родитель.Родитель	КАК Родитель3
	//-HELP-7358 20251022 Михайловский
	|ИЗ 
	|	ВТ_Номенклатура
	|ГДЕ
	|	НЕ Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("МН",МН);
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Сч			= 0;
	МР = Запрос.ВыполнитьПакет();
	ТЗНом = МР[1].Выгрузить();
	ТЗГрп = МР[2].Выгрузить();
	//+HELP-7358 20251022 Михайловский
	Попытка
		МОб0= ВыгрузитьСпр_Номенклатуры_Грп(ТЗГрп);
		Для Каждого ТЭл Из МОб0 Цикл
			Рез.Добавить(ТЭл);
		КонецЦикла;
	Исключение
	КонецПопытки;
	//-HELP-7358 20251022 Михайловский	
	Для Каждого ТекСтр Из ТЗНом Цикл
		Попытка
			МОб1= ВыгрузитьСпр_ХарактеристикиНоменклатуры_ЭлементГрп(ТекСтр);
			Для Каждого ТЭл Из МОб1 Цикл
				Рез.Добавить(ТЭл);
			КонецЦикла;
			//ВыгрузитьСпр_Номенклатура_Элемент_КС(ТекСтр, Ложь);
		Исключение
		КонецПопытки;
	КонецЦикла;
	 
	Возврат Рез;
КонецФункции //-HELP-2306 20250220 Михайловский

Функция ВыгрузитьПакетом_Объект(ИмяТаблицы,ИмяПроцедурыВыгрузки,ВариантВыгрузки="",РежимВыгрузки="Файл",Знач ЗапросСписка=Неопределено)	
	Результат		= Новый Структура("ВыгруженоОбъектов,ЕстьОшибки,Ошибки",0,Ложь,Новый Массив);
	
	НачалоНачал		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЭтоДокумент		= (СтрНайти(ИмяТаблицы,"Документ.")=1);	
	
	Если ЗапросСписка=Неопределено Тогда
		ЗапросСписка	= ЗапросСпискаОбъектов(ИмяТаблицы,ЭтоДокумент);	
	КонецЕсли;
	ЗапросСписка.УстановитьПараметр("ИмяТаблицы",		ИмяТаблицы);
	ЗапросСписка.УстановитьПараметр("ВариантВыгрузки",	ВариантВыгрузки);
	
	Начало					= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	РеквизитыДляВыгрузки	= РеквизитыДляВыгрузки(ИмяТаблицы,ВариантВыгрузки);
	
	ИнициализироватьКэши(Кэши,РеквизитыДляВыгрузки.Шапка);
	СписокТЧ=Неопределено;
	Если РеквизитыДляВыгрузки.Свойство("СписокТЧ",СписокТЧ) Тогда
		Для Каждого ЭлементТЧ Из СписокТЧ Цикл
			ИнициализироватьКэши(Кэши,ЭлементТЧ.Значение);
		КонецЦикла;			
	КонецЕсли;	
	
	ДопЗапросы=Неопределено;
	Если РеквизитыДляВыгрузки.Свойство("ДопЗапросы",ДопЗапросы) Тогда
		Для Каждого ЭлементДЗ Из ДопЗапросы Цикл
			ИнициализироватьКэши(Кэши,ЭлементДЗ.Реквизиты_ТЧ);
		КонецЦикла;	
	КонецЕсли; 
	
	НачНомер		= 0;
	
	ЗапросОбъектов	= ЗапросДляВыгрузкиЕД(ИмяТаблицы,РеквизитыДляВыгрузки);
	
	МассивВыборок	= Новый Массив;	
	
	ТекНомер		= ЦиклПоПорции_ПоместитьСсылкиВКэш(ИмяТаблицы,ЗапросСписка,ЗапросОбъектов,НачНомер,Кэши,РеквизитыДляВыгрузки);
	Пока ТекНомер>0 Цикл
		ТекНомер = ЦиклПоПорции_ПоместитьСсылкиВКэш(ИмяТаблицы,ЗапросСписка,ЗапросОбъектов,ТекНомер,Кэши,РеквизитыДляВыгрузки);		
	КонецЦикла;
	
	Для Каждого Элемент Из Кэши Цикл
		ТекстСообщения	= "Элементов кэша: "+Элемент.Ключ+" "+Элемент.Значение.Количество();		
		//Сообщить_(ТекстСообщения);
	КонецЦикла;
	//+HELP-2306 20250220 Михайловский
	ЕстьДопОб = Ложь;
	МДопОб = Неопределено;
	Если ИмяТаблицы = "Документ.ЗаявкаНаПостСторонАссорт" Тогда
		МДопОб = ЗаполнитьКэшиПоНоменклатуреХарактеристикамПСАЗ();
		Если МДопОб.Количество() Тогда
			ЕстьДопОб = Истина;
		КонецЕсли	
	Иначе
		Если НЕ ИмяТаблицы = "Справочник.Номенклатура" Тогда
	//-HELP-2306 20250220 Михайловский		
			ЗаполнитьКэшиПоНоменклатуреХарактеристикам();
	//+HELP-2306 20250220 Михайловский		
		КонецЕсли;
	КонецЕсли;
	//-HELP-2306 20250220 Михайловский
	ТекПакет	= Неопределено;
	
	Сч			= 0;
	ВсегоСсылок = 0;
	Для Каждого Выборка Из МассивВыборок Цикл
		ВсегоСсылок = ВсегоСсылок+Выборка.Количество();
	КонецЦикла;
		
	Для Каждого Выборка Из МассивВыборок Цикл		
		Выборка.Сбросить();		
		Пока Выборка.Следующий() Цикл
			ОбработкаПрерыванияПользователя_();			
			
			Если РежимВыгрузки<>"Файл" Тогда
				ИнициализироватьЗаписьXML();			
			КонецЕсли; 
			
			Если Сч%100=0 Тогда
				Состояние_("Выгрузка "+ИмяТаблицы+"."+ВариантВыгрузки+": "+(ВсегоСсылок-Сч));			
			КонецЕсли;			
			
			Попытка
				ОбъектХДТО	= Вычислить(ИмяПроцедурыВыгрузки+"(Выборка)");
				Если ТипЗнч(ОбъектХДТО) = Тип("Массив") Тогда
					Результат.ВыгруженоОбъектов = Результат.ВыгруженоОбъектов + ОбъектХДТО.Количество();
				Иначе	
					Результат.ВыгруженоОбъектов=Результат.ВыгруженоОбъектов+1;
				КонецЕсли;
			Исключение
				ТекстСообщения	= "Выгрузка: "+ИмяТаблицы+"."+ОписаниеОшибки();
				Сообщить_(ТекстСообщения,СтатусСообщения.Важное);
				Результат.Ошибки.Добавить(ТекстСообщения);
				ОбъектХДТО	= Неопределено;
			КонецПопытки;
			
			Если ОбъектХДТО<>Неопределено Тогда
				Если ТипЗнч(ОбъектХДТО) = Тип("Массив") Тогда
					Для Каждого ТЭл Из ОбъектХДТО Цикл
						Фабрика.ЗаписатьXML(ЗаписьXML,ТЭл,,,,НазначениеТипаХМЛ);
					КонецЦикла;
				Иначе	
					Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
				КонецЕсли;
				Если РежимВыгрузки<>"Файл" Тогда
					Сообщение	= ЗакрытьЗаписьXML();
					Данные		= СжатьДанные(Сообщение);
					ОтправитьСообщение(Данные,Выборка.Ссылка,Выборка.ОбъектТип,Выборка.ОбъектСсылкаУИД,Выборка.ОтборРС_Хэш,ВариантВыгрузки);				
				КонецЕсли;				
			КонецЕсли;			
			
			Сч=Сч+1;
		КонецЦикла;		
	КонецЦикла;	
	//+HELP-2306 20250220 Михайловский
	Если НЕ (МДопОб = Неопределено) Тогда
		Для Каждого ТЭл Из МДопОб Цикл
			Попытка
				Если РежимВыгрузки<>"Файл" Тогда
					ИнициализироватьЗаписьXML();			
				КонецЕсли;
				Фабрика.ЗаписатьXML(ЗаписьXML,ТЭл.ОбъектХДТО,,,,НазначениеТипаХМЛ);
				Если РежимВыгрузки<>"Файл" Тогда
					Сообщение	= ЗакрытьЗаписьXML();
					Данные		= СжатьДанные(Сообщение);
					ОтправитьСообщение(Данные, ТЭл.Ссылка, ТЭл.ОбъектТип, ТЭл.ОбъектСсылкаУИД, ТЭл.ОтборРС_Хэш, ТЭл.ВариантВыгрузки);				
				КонецЕсли;
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	//-HELP-2306 20250220 Михайловский
	Если РежимВыгрузки<>"Файл" Тогда		
		//Последний пакет
		Если ТекПакет<>Неопределено Тогда
			ОтправитьПакет(ТекПакет);	
		КонецЕсли;
		КомпонентаОбмена.ОтправитьБуферСообщений();
	КонецЕсли;	
	
	Время	= Окр((ТекущаяУниверсальнаяДатаВМиллисекундах()-НачалоНачал)/1000,2,1);
	
	ТекстСообщения	= СтрШаблон("Обмен с ФР. Объект: %1, вариант: %2 выгружено: %3 объектов, время выгрузки: %4.",ИмяТаблицы,ВариантВыгрузки,ВсегоСсылок,Время);	
	Сообщить_(ТекстСообщения);
	
	Результат.ЕстьОшибки=(Результат.Ошибки.Количество()>0);
	
	ЗаписатьВЛог("Регламент",ТекстСообщения+". Есть ошибки выгрузки: "+Результат.ЕстьОшибки,"Информация",,,Время);	
	
	Если Результат.ЕстьОшибки Тогда
		ТекстОшибок=СтрСоединить(Результат.Ошибки,Символы.ПС);
		ЗаписатьВЛог("Регламент","Обмен с ФР. Ошибки выгрузки: "+ТекстОшибок,"Ошибка",,,Время);
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции
 
Функция ВыгрузитьПакетом_Регистр(ИмяТаблицы,ИмяПроцедурыВыгрузки,ВариантВыгрузки="",РежимВыгрузки="Файл")	
	Результат		= Новый Структура("ВыгруженоОбъектов,ВыгруженоЗаписей,ЕстьОшибки,Ошибки",0,0,Ложь,Новый Массив);
	
	НачалоНачал		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	ЗапросСписка	= Новый ("Запрос");
	Если СтрНайти(ВариантВыгрузки,"Сведений.")>0 Тогда		
		ЗапросСписка.Текст	= ТекстЗапросаСписка_РегистрСведений(ИмяТаблицы,ВариантВыгрузки);		
	Иначе
		ЗапросСписка.Текст	= ТекстЗапросаСписка_РегистрНакопления(ИмяТаблицы);
	КонецЕсли;
	
	ЗапросСписка.УстановитьПараметр("Дата1",			НачалоДня(Дата1));
	ЗапросСписка.УстановитьПараметр("Дата2",			КонецДня(Дата2));
	
	ЗапросСписка.УстановитьПараметр("ВариантВыгрузки",	ВариантВыгрузки);
	ЗапросСписка.УстановитьПараметр("НачНомер",			0);
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();		
	НачНомер	= 0;
	ВсегоСсылок	= 0;
	
	Менеджер	= ФР_ОбщегоНазначения_ПИ.ПолучитьМенеджер(ИмяТаблицы);
	
	Выборка		= ЗапросСписка.Выполнить().Выбрать();
	Пока Выборка.Количество()>0 Цикл		
		ВсегоСсылок	= ВсегоСсылок+Выборка.Количество();
		Сч			= 0;
		Пока Выборка.Следующий() Цикл		
			ОбработкаПрерыванияПользователя_();		
			НачНомер	= Выборка.Номер;
			
			Сч		= Сч+1;		
			
			Отбор	= Выборка.ОтборРС.Получить();		
			Если ПустаяСтрока(Отбор) Тогда
				Результат.Ошибки.Добавить("Не установлен отбор РС !");
				Продолжить;
			Иначе			
				Отбор=ЗначениеИзСтрокиВнутр(Отбор);		
			КонецЕсли;		
			
			Если РежимВыгрузки<>"Файл" Тогда
				ИнициализироватьЗаписьXML();			
			КонецЕсли;			
			
			КоличествоЗаписей	= 0;
			Попытка
				ДанныеВыгрузки	= Вычислить(ИмяПроцедурыВыгрузки+"(Отбор)");
				
				ОбъектХДТО			= ДанныеВыгрузки.ОбъектХДТО;
				ВыгруженоЗаписей	= ДанныеВыгрузки.ВыгруженоЗаписей;
				
				Результат.ВыгруженоОбъектов	= Результат.ВыгруженоОбъектов	+ 1;
				Результат.ВыгруженоЗаписей	= Результат.ВыгруженоЗаписей	+ ДанныеВыгрузки.ВыгруженоЗаписей;
			Исключение
				ТекстСообщения	= "Выгрузка: "+ИмяТаблицы+"."+ОписаниеОшибки();
				Сообщить_(ТекстСообщения,СтатусСообщения.Важное);
				Результат.Ошибки.Добавить(ТекстСообщения);
				ОбъектХДТО	= Неопределено;
			КонецПопытки;			
			
			Состояние_("Выгрузка "+ИмяТаблицы+": "+(ВсегоСсылок-Сч));
			
			Если ОбъектХДТО<>Неопределено Тогда
				Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
				
				Если РежимВыгрузки<>"Файл" Тогда
					Сообщение	= ЗакрытьЗаписьXML();
					Данные		= СжатьДанные(Сообщение);					
					Ссылка		= Менеджер.ПолучитьСсылку(Выборка.ОбъектСсылкаУИД);
					ОтправитьСообщение(Данные,Ссылка,Выборка.ОбъектТип,Выборка.ОбъектСсылкаУИД,Выборка.ОтборРС_Хэш,ВариантВыгрузки,ВыгруженоЗаписей);
				КонецЕсли;				
			КонецЕсли;
						
		КонецЦикла;	
		
		ЗапросСписка.УстановитьПараметр("НачНомер",	НачНомер);
		Выборка		= ЗапросСписка.Выполнить().Выбрать();
	КонецЦикла;

	Если РежимВыгрузки<>"Файл" Тогда		
		//Последний пакет
		Если ТекПакет<>Неопределено Тогда
			ОтправитьПакет(ТекПакет);	
		КонецЕсли;
		КомпонентаОбмена.ОтправитьБуферСообщений();
	КонецЕсли;	
	
	Время	= ТекущаяУниверсальнаяДатаВМиллисекундах()-НачалоНачал;
	
	Сообщить_("Время выгрузки: "+Окр(Время/1000,2,1)+" сек., документов: "+ВсегоСсылок);	
	
	Результат.ЕстьОшибки=(Результат.Ошибки.Количество()>0);
	
	Возврат Результат;
КонецФункции

Функция ЗапросСпискаОбъектов(ИмяТаблицы,ЭтоДокумент)
	ЗапросСписка	= Новый ("Запрос");
	Если ЭтоДокумент Тогда		
		ЗапросСписка.Текст	= ТекстЗапросаСписка_Документ(ИмяТаблицы);		
	Иначе
		ЗапросСписка.Текст	= ТекстЗапросаСписка_Справочник(ИмяТаблицы);
	КонецЕсли;	
	
	Возврат ЗапросСписка;
КонецФункции //ЗапросСпискаОбъектов()
 
Функция РеквизитыДляВыгрузки(ИмяТаблицы,ВариантВыгрузки)	
	ИмяФункцииПолученияРеквизитов   = "РеквизитыДляВыгрузкивЕД_"+СтрЗаменить(ИмяТаблицы,".","_");
	Если ЗначениеЗаполнено(ВариантВыгрузки) Тогда
		ИмяФункцииПолученияРеквизитов   =  ИмяФункцииПолученияРеквизитов+"_"+СтрЗаменить(ВариантВыгрузки,".","_");	
	КонецЕсли; 
	
	Возврат Вычислить(ИмяФункцииПолученияРеквизитов+"()");
КонецФункции //РеквизитыДляВыгрузки(ИмяТаблицы,ВариантВыгрузки)
  

#Область СлужебныеПроцедуры 


Процедура ВыгрузитьКлассификаторы() Экспорт
	
	Если ПустаяСтрока(ИмяФайлаОбмена) Тогда
		Предупреждение_("Не указано имя файла обмена");
		Возврат;
	КонецЕсли;
	
	ИнициализироватьЗаписьXML(ИмяФайлаОбмена);	
	
	Выборка	= Справочники.КлассификаторСтранМира.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектХДТО	= ВыгрузитьСпр_СтраныМира_Элемент(Выборка.Ссылка);		
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	КонецЦикла;
	
	Выборка	= Справочники.ОКЕИ.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектХДТО	= ВыгрузитьСпр_Единицы_Элемент(Выборка.Ссылка);		
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	КонецЦикла;	
	
	ЗакрытьЗаписьXML();	

КонецПроцедуры

Процедура ВыгрузитьНачальныеНастройки() Экспорт
	
	Если ПустаяСтрока(ИмяФайлаОбмена) Тогда
		Предупреждение_("Не указано имя файла обмена");
		Возврат;
	КонецЕсли;
	
	ИнициализироватьЗаписьXML(ИмяФайлаОбмена);	
	
	Для Каждого Пользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Элемент=Справочники.Пользователи.НайтиПоКоду(Пользователь.Имя);
		Если НЕ Элемент.Пустая() Тогда
			ОбъектХДТО	= ВыгрузитьСправочник(Элемент);
			Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);		
		КонецЕсли;		
	КонецЦикла;
	
	ЭтотУзел			= ПланыОбмена.Основной.ЭтотУзел();	
	
	ТекПодразделение	= ЭтотУзел.Подразделение;
	
	ОбъектХДТО			= ВыгрузитьСправочник(ЭтотУзел.Подразделение);
	Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	
	Если ЗначениеЗаполнено(ТекПодразделение.ОсновнойСклад) Тогда
		ОбъектХДТО		= ВыгрузитьСпр_Склады_Элемент(ЭтотУзел.Подразделение.ОсновнойСклад);
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	КонецЕсли;
	
	Если НЕ ТекПодразделение.РозничныйТипЦен.Пустая() Тогда		
		Если ТекПодразделение.РозничныйТипЦен.Базовый.Пустая() Тогда
			ТекТипЦен=ТекПодразделение.РозничныйТипЦен;
		Иначе
			ТекТипЦен=ТекПодразделение.РозничныйТипЦен.Базовый;		
		КонецЕсли; 	
		
		ОбъектХДТО=ВыгрузитьСпр_ТипыЦен_Элемент(ТекТипЦен);		
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	КонецЕсли;
	
	Если НЕ ТекПодразделение.РозничныйТипЦенРаспродажа.Пустая() Тогда		
		Если ТекПодразделение.РозничныйТипЦенРаспродажа.Базовый.Пустая() Тогда
			ТекТипЦен=ТекПодразделение.РозничныйТипЦенРаспродажа;
		Иначе
			ТекТипЦен=ТекПодразделение.РозничныйТипЦенРаспродажа.Базовый;		
		КонецЕсли; 	
		
		ОбъектХДТО=ВыгрузитьСпр_ТипыЦен_Элемент(ТекТипЦен);		
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	КонецЕсли;
	
	Если НЕ ТекПодразделение.РозничныйТипСкидок.Пустая() Тогда
		ОбъектХДТО	= ВыгрузитьСпр_ТипыСкидок_Элемент(ТекПодразделение.РозничныйТипСкидок);		
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);			
	КонецЕсли;
	
	Выборка=Справочники.Кассы.Выбрать(,ТекПодразделение);
	Пока Выборка.Следующий() Цикл
		ОбъектХДТО	= ВыгрузитьСпр_Кассы_Элемент(Выборка.Ссылка);		
		Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	КонецЦикла; 
	
	ОбъектХДТО=ВыгрузитьПО_Основной(ПланыОбмена.Основной.ЭтотУзел());
	Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
	
	ЗакрытьЗаписьXML();	

КонецПроцедуры

Процедура ВыгрузитьУзлы_ОбменСТЦ() Экспорт
	
	Если ПустаяСтрока(ИмяФайлаОбмена) Тогда
		Предупреждение_("Не указано имя файла обмена");
		Возврат;
	КонецЕсли;
	
	ИнициализироватьЗаписьXML(ИмяФайлаОбмена);	
	
	Выборка=ПланыОбмена.Основной.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления И Выборка.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
			ОбъектХДТО=ВыгрузитьПО_ОбменСТЦ(Выборка.Ссылка);
			Фабрика.ЗаписатьXML(ЗаписьXML,ОбъектХДТО,,,,НазначениеТипаХМЛ);
		КонецЕсли;
	КонецЦикла;
	
	ЗакрытьЗаписьXML();	

КонецПроцедуры


#КонецОбласти 


#КонецОбласти


#Область Загрузка


Функция СоздатьПротоколОбмена() Экспорт
	Возврат Новый Структура("ОшибкаФайла,Отправитель,ОбработанныеОбъекты,ОшибкиОбмена,РазмерПакета",
		"",Неопределено,Новый Соответствие,Новый Соответствие,0);
КонецФункции // ()

Функция ПолучитьОбработчикиЗагрузки()
	ТО	 = Новый ТаблицаЗначений;
	
	ТО.Колонки.Добавить("ТипОбъекта");	
	ТО.Колонки.Добавить("ИмяТипаХДТО");	
	ТО.Колонки.Добавить("ИмяТаблицы");	
	ТО.Колонки.Добавить("ПроцедураЗагрузки");
	
	ТО.Индексы.Добавить("ТипОбъекта");
	
	//Функция ДобавитьОбработчикЗагрузки(ТО,ИмяТипаХДТО,Знач ИмяТаблицы, Знач ПроцедураЗагрузки = "")
	
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.Бренды.Элемент",					"Справочник.ФР_Бренды.Элемент",				"ЗагрузитьСпр_Бренды_Элемент");
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.ВидыНоменклатуры.Группа",			"Справочник.ФР_ВидыНоменклатуры.Группа",	"ЗагрузитьСпр_ВидыНоменклатуры_Группа");
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.ВидыНоменклатуры.Элемент",		"Справочник.ФР_ВидыНоменклатуры.Элемент",	"ЗагрузитьСпр_ВидыНоменклатуры_Элемент");	
	
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.ПакетыДанных.Элемент",   			"Справочник.ФР_ПакетыДанных.Элемент",		"ЗагрузитьСпр_ПакетыДанных_Элемент");
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.ПодарочныеСертификаты.Элемент",   "Справочник.ПодарочныеСертификаты.Элемент");
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.ФизическиеЛица.Элемент",        	"Справочник.ФизическиеЛица.Элемент");
	// + HELP-1867 20241031 Михайловский
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.Акции.Группа",			"Справочник.Акции.Группа",	"ЗагрузитьСпр_Акции_Группа");
	ДобавитьОбработчикЗагрузки(ТО,"Справочник.Акции.Элемент",		"Справочник.Акции.Элемент",	"ЗагрузитьСпр_Акции_Элемент");
	// - HELP-1867 20241031 Михайловский	
//	ДобавитьОбработчикЗагрузки(ТО,"Документ.КассоваяСмена",						"Документ.КассоваяСмена",				"ЗагрузитьДок_КС");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.АктОРасхождениях",					"Документ.ЗаявкаНаРекламацию",			"ЗагрузитьДок_ЗРК_ЕЕ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЗаказПокупателя",					"Документ.Заказ",						"ЗагрузитьДок_ЗПК_ЕЕ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЗаявкаНаВозвратПоставщику",			"Документ.ЗаявкаНаВозвратОтПокупателя",	"ЗагрузитьДок_ЗНВПок");	
	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЗаявкаНаСкидки",					"Документ.ЗаявкаНаСкидки",				"ЗагрузитьДок_ЗНС_ЕЕ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЗаявкаНаУстановкуЦен",				"Документ.ЗаявкаНаУстановкуЦен",		"ЗагрузитьДок_ЗНЦ_ЕЕ");	
	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ИнвентаризацияТМЦ",					"Документ.Инвентаризация",				"ЗагрузитьДок_ИНВ");
	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ОприходованиеТМЦ",					"Документ.ОприходованиеТМЦ",			"ЗагрузитьДок_ОПР_ЕЕ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ПеремещениеДенежныхСредств",		"Документ.ПереводСредств",				"ЗагрузитьДок_ПС_ЕЕ");	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.СписаниеТМЦ",						"Документ.СписаниеТМЦ",					"ЗагрузитьДок_СПН_ЕЕ");
	//ДобавитьОбработчикЗагрузки(ТО,"Документ.ОприходованиеТоваров",			"Документ.ОприходованиеТМЦ",			"ЗагрузитьДок_ОПР_ЕД");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ОтчетОРозничныхПродажах",			"Документ.ОтчетКассовойСмены",			"ЗагрузитьДок_ОКС_ЕД");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ОтчетКассовойСмены",				"Документ.ОтчетКассовойСмены",			"ЗагрузитьДок_ОКС_ЕЕ");
	//+HELP-2306 20250220 Михайловский
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЗаявкаНаПостСторонАссорт",		"Документ.ЗаявкаНаПостСторонАссорт",	"ЗагрузитьДок_ПСАЗ");
	//-HELP-2306 20250220 Михайловский
	ДобавитьОбработчикЗагрузки(ТО,"Документ.Перемещение",						"Документ.Перемещение",					"ЗагрузитьДок_ПРМ");	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ПеремещениеДС",						"Документ.ПереводСредств",				"ЗагрузитьДок_ПC");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ПоступлениеТоваровУслуг",			"Документ.ПриходнаяНакладная",			"ЗагрузитьДок_ПНК");
	//Феданченков М.С. 06.07.2026 начало
	//Проблема 0000000187
	ДобавитьОбработчикЗагрузки(ТО, "Документ.ПриходнаяНакладная",               "Документ.ПриходнаяНакладная",          "ЗагрузитьДок_ПНК_ИзФР"); 
	//Феданченков М.С. 06.07.2026 конец
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ПриходныйКассовыйОрдер",			"Документ.ПриходныйКассовыйОрдер",		"ЗагрузитьДок_ПКО");	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.РасходнаяНакладная",				"Документ.РасходнаяНакладная",			"ЗагрузитьДок_РНК");	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.РасходныйКассовыйОрдер",			"Документ.РасходныйКассовыйОрдер",		"ЗагрузитьДок_РКО");	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.СписаниеЗапасов",					"Документ.СписаниеТМЦ",					"ЗагрузитьДок_СПН");	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.УстановкаСкидок",					"Документ.УстановкаСкидок",				"ЗагрузитьДок_УстановкаСкидок");		
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ХранилищеКодовМаркировки",			"Документ.ХранилищеКодовМаркировки",	"ЗагрузитьДок_ХКМ");
	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.МаркировкаОстатковТЦ",			"Документ.МаркировкаОстатковТЦ",	"ЗагрузитьДок_МКО");
	
	//+SNL-203 20260515 Михайловски
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЗаказИМ",		"Документ.ЗаказИМ",	"ЗагрузитьДок_ЗаказИМ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ВыкупИМ",		"Документ.ВыкупИМ",	"ЗагрузитьДок_ВыкупИМ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ВозвратИМ",		"Документ.ВозвратИМ",	"ЗагрузитьДок_ВозвратИМ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.Возврат1ИМ",		"Документ.Возврат1ИМ",	"ЗагрузитьДок_Возврат1ИМ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ОплатаИМ",		"Документ.ОплатаИМ",	"ЗагрузитьДок_ОплатаИМ");
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ВозвратОплатыИМ",		"Документ.ВозвратОплатыИМ",	"ЗагрузитьДок_ВозвратОплатыИМ");
	//-SNL-203 20260515 Михайловски
	
	ДобавитьОбработчикЗагрузки(ТО,"Документ.ЧекККМ",							"Документ.ЧекККМ",						"ЗагрузитьДок_ЧекККМ");
	
	Возврат ТО;
КонецФункции //ПолучитьОбработчикиЗагрузки()

Функция ДобавитьОбработчикЗагрузки(ТО,ИмяТипаХДТО,Знач ИмяТаблицы, Знач ПроцедураЗагрузки = "")
	
	Поля				= ФР_ОбщегоНазначения_КС.СтрокуВСтруктуру(ИмяТаблицы,"Тип,Вид,Суффикс",".");	
	ИмяТаблицыТек		= ПолучитьТипТек(Поля.Тип+"."+Поля.Вид);
	
	Если СтрНайти("Справочник,Документ,ПланВидовХарактеристик",Поля.Тип)<>0 Тогда
		Попытка
			ТипОбъекта	= СформироватьТипСсылки(ИмяТаблицыТек);	
		Исключение
			Сообщить_("Тип не определен: """+ИмяТаблицыТек+""" !",СтатусСообщения.Важное);
		КонецПопытки;		
	Иначе
		ТипОбъекта	= "";		
	КонецЕсли;	
	
	СтрокаТО			= ТО.Добавить();
	
	СтрокаТО.ИмяТипаХДТО= ИмяТипаХДТО;	
	
	СтрокаТО.ИмяТаблицы	= ИмяТаблицы;
	СтрокаТО.ТипОбъекта	= ТипОбъекта;	
	
	Если ПустаяСтрока(ПроцедураЗагрузки) Тогда		
		ПроцедураЗагрузки	= ФР_ОбщегоНазначения_КС.СлепитьЗаполненныеПараметры("_","Загрузить"+СокращениеТипа(Поля.Тип),Поля.Вид,Поля.Суффикс);
	КонецЕсли; 
	
	СтрокаТО.ПроцедураЗагрузки	= ПроцедураЗагрузки;
	
КонецФункции //ДобавитьОбработчикВыгрузки(ТО,	ИмяТаблицы, ВариантВыгрузки,ПроцедураВыгрузки)

Процедура ЗагрузитьДанныеИзОчереди(УзелПолучатель) Экспорт
	УзелПараметров	= ФР_ОбщегоНазначения_ПИ.ЭтотУзел();
	Если КомпонентаОбмена=Неопределено Тогда		
		ТекУзелПолучатель	= УзелПолучатель;
		Если НЕ ЗначениеЗаполнено(ТекУзелПолучатель) Тогда Возврат КонецЕсли;		
		Если НЕ ИнициализироватьКомпонентуОбмена(ТекУзелПолучатель) Тогда Возврат КонецЕсли;	
	КонецЕсли;	
	
	Сч			= 0;
	ВсегоБайт	= 0;
	
	ИмяОчереди	= "to_"+УзелПолучатель.Код;
	
	ФР_Регламент.ВыгрузитьЗаглушку(КомпонентаОбмена,ИмяОчереди,"Чудо текст"); // Пинок - почему то не считывает из очереди - если там одно сообщение
	
	КомпонентаОбмена.НачатьПриемСообщений(ИмяОчереди);		
	КомпонентаОбмена.Пауза(500);
	
	Сообщение		= "";
	НомерДоставки	= "";	
	
	ДопПараметры    = Новый Структура("ИД_Сеанса",Новый УникальныйИдентификатор());
	
	ДанныеСообщения		= КомпонентаОбмена.ПрочитатьСообщение(НомерДоставки);	
	
	Пока Число(НомерДоставки)<>0 Цикл				
		ОбработкаПрерыванияПользователя_(); 
		
		СообщениеСтрокой	= ПолучитьСтрокуИзДвоичныхДанных(ДанныеСообщения);
		
		Сообщить_(""+Сч+", размер ДД: "+ДанныеСообщения.Размер()+", размер строки: "+СтрДлина(СообщениеСтрокой));
		
		Сч=Сч+1;
		Если Сч%100=0 Тогда
			//Сообщить_(""+Сч+", размер ДД: "+ДанныеСообщения.Размер()+", размер строки: "+СтрДлина(СообщениеСтрокой));
		КонецЕсли;
		
		ВсегоБайт	= ВсегоБайт+ДанныеСообщения.Размер();
		
		ПрочитатьДанныеСообщения(СообщениеСтрокой,ДопПараметры);
		
		КомпонентаОбмена.ПодтвердитьЧтение(Число(НомерДоставки));
				
		Сообщение	= КомпонентаОбмена.ПрочитатьСообщение(НомерДоставки);
	КонецЦикла;
	
	
	ЗаписьЖурналаРегистрации("ОбменДанными",УровеньЖурналаРегистрации.Информация,Метаданные.ПланыОбмена.ФР_ОбменСФРК,ТекУзелПолучатель,"Отправлено: "+Сч+" объектов. Суммарный размер: "+ВсегоБайт);
	
КонецПроцедуры

Функция ПрочитатьДанныеСообщения(СообщениеСтрокой,ДопПараметры) Экспорт
	#ЕСЛИ КЛИЕНТ ТОГДА
	ОбработкаПрерыванияПользователя(); 
	#КОНЕЦЕСЛИ	
	
	Ошибки		= Новый Массив;
	
	//СтрокаХЗ	= ПолучитьСтрокуИзДвоичныхДанных(Сообщение);
	
	Пакет		= Неопределено;	
	Попытка
		Пакет	= ЗначениеИзСтрокиВнутр(СообщениеСтрокой);
	Исключение
		Ошибки.Добавить("Ошибка десериализации сообщения.");
	КонецПопытки;	
	
	ДанныеОбмена	= Неопределено;	
	
	ПротоколОбмена	= СоздатьПротоколОбмена();	
	Отправитель		= Неопределено;
	ИД_Пакета		= Неопределено;
	ИД_Сеанса		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ИД_Сеанса");
	НачалоОбработки	= ТекущаяДата();
	
	Если Пакет = Неопределено Тогда
		Ошибки.Добавить("Некорректные входящие данные. Невозможно разобрать пакет из строки.");
	ИначеЕсли ТипЗнч(Пакет)=Тип("Структура") Тогда
		ОбъектыОбмена.Очистить();		
		
		ИД_Пакета	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(Пакет,"ИД_Пакета");
		Если ИД_Пакета=Неопределено Тогда
			Пакет.Вставить("ИД_Пакета",Справочники.СтатистикаОбменов.ПустаяСсылка().УникальныйИдентификатор());		
		КонецЕсли; 
		
		Для Каждого Данные Из Пакет.Данные Цикл
			Попытка
				Значен	= XMLЗначение(Тип("ХранилищеЗначения"),Данные);		
				Строка	= Значен.Получить();						
				
				Попытка
					ДанныеОбмена	= ЗагрузитьФайлХДТО(Строка,ДопПараметры);
					Отправитель		= ДанныеОбмена.Отправитель; 
					
					Для Каждого ТекстОшибки Из ДанныеОбмена.Ошибки Цикл
						Ошибки.Добавить(ТекстОшибки);					
					КонецЦикла;					
				Исключение
					Ошибка			=  ОписаниеОшибки();
					Ошибки.Добавить(Ошибка);
					
					МЗ				= РегистрыСведений.ОшибкиОбмена.СоздатьМенеджерЗаписи();
					
					МЗ.КлючЗаписи	= Новый УникальныйИдентификатор();
					МЗ.Дата			= ТекущаяДата();
					МЗ.ДанныеПакета	= Строка;
					
					МЗ.ОписаниеОшибки = Ошибка;
					
					МЗ.Записать();
				КонецПопытки;				
			Исключение
				Ошибки.Добавить("Ошибка разбора XDTO. "+ОписаниеОшибки());				
			КонецПопытки;			
		КонецЦикла;
	Иначе
		Ошибки.Добавить("Некорректные входящие данные. Неверный тип данных пакета.");
	КонецЕсли;
	
	ЭлементСтатистики	= ЗаписатьЭлементСтатистики_Прием(СтрДлина(СообщениеСтрокой),Пакет,Ошибки,НачалоОбработки,ИД_Сеанса,СообщениеСтрокой);
	
	Возврат Новый Структура("ИД_Пакета,ЭлементСтатистики,Отправитель,Результат,Ошибки",ИД_Пакета,ЭлементСтатистики,Отправитель,(Ошибки.Количество()=0),Ошибки);
КонецФункции

Функция ЗагрузитьФайлХДТО(Строка=Неопределено,ДопПараметры=Неопределено) Экспорт
	ПротоколЗагрузки=СоздатьПротоколЗагрузки();
	
	Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
		фПерезаписыватьРеквизитыСправочников	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"фПерезаписыватьРеквизитыСправочников",	фПерезаписыватьРеквизитыСправочников);
		фПерезаписыватьДокументы				= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"фПерезаписыватьДокументы",				фПерезаписыватьДокументы);
	КонецЕсли;	
	
	ЧтениеXML = Новый ЧтениеXML;
	Если Строка=Неопределено Тогда
		ЧтениеXML.ОткрытьФайл(ИмяФайлаОбмена);
	Иначе
		ЧтениеXML.УстановитьСтроку(Строка);	
	КонецЕсли;	
	
	ЧтениеXML.Прочитать();		
	ТипXML		= ПолучитьXMLТип(ЧтениеXML);
	
	ЧтениеXML.Прочитать();
	ТипХДТО		= Фабрика.Тип("http://www.1c.ru/SSL/Exchange/Message","Header");		
	ОбъектХДТО	= Фабрика.ПрочитатьXML(ЧтениеXML,Фабрика.Тип("http://www.1c.ru/SSL/Exchange/Message","Header"));		
	
	КонфирмХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"Confirmation");
	Если КонфирмХДТО<>Неопределено Тогда
		
		ИмяПланаОбмена	= "ФР_ОбменСФРК";		
		Отправитель		= ПланыОбмена[ИмяПланаОбмена].НайтиПоКоду(КонфирмХДТО.From);		
		Если Отправитель = ФР_ОбщегоНазначения_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
			Отправитель = Неопределено;		
		КонецЕсли; 		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отправитель) Тогда
		Отправитель="Нечто";	
	КонецЕсли; 
	
	ПротоколЗагрузки.Отправитель=Отправитель;
	
	
	ТипXML		= ПолучитьXMLТип(ЧтениеXML);	
	ИмяТипаХДТО	= "";
	
	Сч			= 0;
	Ошибки		= Новый Массив;
	
	ЧтениеXML.Прочитать();	
	Пока ЧтениеXML.ТипУзла<>ТипУзлаXML.КонецЭлемента Цикл		
		
		ИмяТипаХДТО	= ПолучитьXMLТип(ЧтениеXML).ИмяТипа;
		ТипОбъекта	= РазложитьПолныйТип(ИмяТипаХДТО);		
		
		Попытка
			ОбъектХДТО	= Фабрика.ПрочитатьXML(ЧтениеXML);						
		Исключение			
			// + HELP-1867 20241031 Михайловский
			ЗагрБФ = Ложь;
			Если ИмяТипаХДТО = "Справочник.Акции.Элемент" Тогда
				ЗагрБФ = ЗагрузитьБезФабрики(Строка, ИмяТипаХДТО, ТипОбъекта);
			КонецЕсли;	
			// + HELP-1867 20241031 Михайловский
			ОбъектХДТО	= Неопределено;	
			// + HELP-1867 20241031 Михайловский
			//ТекстОшибки	= "Ошибка разбора ХДТО. Тип: "+ИмяТипаХДТО+"."+Символы.ПС+ОписаниеОшибки();
			ТекстОшибки	= "Ошибка разбора ХДТО. Тип: "+ИмяТипаХДТО+". Прямая загрузка из XML " + ?(ЗагрБФ, "выполнена", "не выполнена ") + Символы.ПС+ОписаниеОшибки();
			// - HELP-1867 20241031 Михайловский		
			ДобавитьОбъектВПротоколОбмена(ИмяТипаХДТО,,"ЧтениеХДТО",ТекстОшибки);			
			Ошибки.Добавить(ТекстОшибки);
			
			МЗ				= РегистрыСведений.ОшибкиОбмена.СоздатьМенеджерЗаписи();
			
			МЗ.КлючЗаписи	= Новый УникальныйИдентификатор();
			МЗ.Дата			= ТекущаяДата();
			МЗ.ДанныеПакета	= Строка;
			
			МЗ.ОписаниеОшибки = ТекстОшибки;
			
			МЗ.Записать();			
			
			Прервать;			
		КонецПопытки;		
		
		Вид 		= ТипОбъекта.Вид;
		Тип			= ТипОбъекта.Тип;
		
		Если Тип="Справочник" Тогда			
			ЗагрузитьСправочник(ОбъектХДТО,ИмяТипаХДТО,Отправитель);
		ИначеЕсли Тип="Документ" Тогда 
			ЗагрузитьДокумент(ОбъектХДТО,ИмяТипаХДТО,Отправитель);		
		ИначеЕсли Тип="РегистрСведений" Тогда
			ЗагрузитьРегистрСведений(ОбъектХДТО,Вид,Отправитель);		
		ИначеЕсли Тип="InformationRegisterRecordSet" Тогда
			НЗ=СериализаторXDTO.ПрочитатьXDTO(ОбъектХДТО);			
			ЗаписатьОбъект(НЗ,Отправитель);
		ИначеЕсли Тип="" Тогда
			Если Вид="ОбщиеСвойстваДанныеПодарочногоСертификата" Тогда
				ЗагрузитьСправочник(ОбъектХДТО,"Справочник.ПодарочныеСертификаты",Отправитель);
			КонецЕсли;			
		КонецЕсли;		
		
		Сч=Сч+1;
		
		Если Сч%100=0 Тогда
			Состояние_("Загружено: "+Сч);		
		КонецЕсли;
		ОбработкаПрерыванияПользователя_();		
	КонецЦикла; 
	
	ЧтениеXML.Закрыть();
	
	КодОтправителя=?(ТипЗнч(Отправитель)=Тип("Строка"),Отправитель,Отправитель.Код);
	
	Возврат Новый Структура("Отправитель,Ошибки",КодОтправителя,Ошибки);
КонецФункции

// + HELP-1867 20241031 Михайловский
Функция ИмяБезПИ(Имя)
	ОтвС = Новый Структура;
	ПозДД = СтрНайти(Имя, ":");
	ОтвС.Вставить("ПИм", ?(ПозДД, Лев(Имя, ПозДД - 1), ""));
	ОтвС.Вставить("Имя", ?(ПозДД, Сред(Имя, ПозДД + 1), Имя));
	Возврат ОтвС;
КонецФункции

Функция ЗагрузитьБезФабрики(СтрокаПотока, ИмяТипаХДТО, ТипОбъекта)
	Рез = Ложь;
	Вид 		= ТипОбъекта.Вид;
	Тип			= ТипОбъекта.Тип;
	Если ИмяТипаХДТО = "Справочник.Акции.Элемент" Тогда
		МасРекв = Новый Массив;
		МасРекв.Добавить("Ссылка");
		МасРекв.Добавить("Родитель");
		МасРекв.Добавить("Наименование");
		МасРекв.Добавить("Код");
		МасРекв.Добавить("ДатаНачала");
		МасРекв.Добавить("ДатаОкончания");
		МасРекв.Добавить("Описание");
		МасРекв.Добавить("ШтрихКод");
		МасРекв.Добавить("ДатаНачалаДействияПС");
		МасРекв.Добавить("ДатаОкончанияДействияПС");
		МасРекв.Добавить("КомплектРасширенная");
		МасРекв.Добавить("ОдинКупонНаЧек");
		МасРекв.Добавить("ПометкаУдаления");
		Попытка
			Соот = Новый Соответствие;
			ЧтениеXML = Новый ЧтениеXML;
			Уст = Ложь;
			Если НЕ СтрокаПотока = Неопределено Тогда
				ЧтениеXML.УстановитьСтроку(СтрокаПотока);
				Пока ЧтениеXML.Прочитать() Цикл
					ИмяБезПИ = ИмяБезПИ(ЧтениеXML.Имя).Имя;
					Если ИмяБезПИ = ИмяТипаХДТО Тогда
						ЗаписатьВЛог("Регламент","Обмен ФР. тип акции: "+ИмяБезПИ ,"Информация",Ложь);
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							Уст = Истина;
						КонецЕсли;
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
							Уст = Ложь;
						КонецЕсли;
					КонецЕсли;
					Если Уст И  ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
						//ЗаписатьВЛог("Регламент","Обмен ФР. рекв акции: "+ИмяБезПИ ,"Информация",Ложь);
						ЕстьЭл = ?(МасРекв.Найти(ИмяБезПИ) = Неопределено, Ложь, Истина);
						ИмяРекв = ИмяБезПИ;
						ЗначАттр = Истина;
					КонецЕсли;
					
					Если Уст И  ЕстьЭл И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						ИмяРекв = "";
						ЗначАттр = Ложь;
					КонецЕсли;
					
					 Если Уст И  ЗначАттр И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					//Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					    
						//Обмен ФР. Начало акции: ee:Ссылка
						Если НЕ ПустаяСтрока(ИмяРекв) Тогда
							Соот.Вставить(ИмяРекв, ЧтениеXML.Значение);
						КонецЕсли;	
					КонецЕсли;
					 
				КонецЦикла;
			КонецЕсли;
			//Для Каждого КлЗ Из Соот Цикл
			//	ЗаписатьВЛог("Регламент","Обмен ФР.  акции: ключ "+КлЗ.Ключ + " знач " + КлЗ.Значение,"Информация",Ложь);
			//КонецЦикла;
			
			Если Соот.Количество() Тогда
				СтрСсылка = Соот.Получить("Ссылка");
				СтрРод = Соот.Получить("Родитель");
				Если НЕ ПустаяСтрока(СтрСсылка) Тогда
					Ссылка = Справочники.Акции.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрСсылка));
					СпрОбъект = Ссылка.ПолучитьОбъект();
					Если СпрОбъект = Неопределено Тогда
						СпрОбъект = Справочники.Акции.СоздатьЭлемент();
						СпрОбъект.УстановитьСсылкуНового(Ссылка);
					КонецЕсли;
					//Обмен ФР.  акции: ключ Родитель знач 00000000-0000-0000-0000-000000000000
					Если НЕ СтрРод = "00000000-0000-0000-0000-000000000000" Тогда
						СсылкаРод = Справочники.Акции.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрРод));
						Если НЕ СсылкаРод.ПолучитьОбъект() = Неопределено Тогда
							СпрОбъект.Родитель = СсылкаРод;
						КонецЕсли;
					КонецЕсли;
					СпрОбъект.Код = Соот.Получить("Код");
					СпрОбъект.Наименование = Соот.Получить("Наименование");
					СпрОбъект.ДатаНачала = ПолучитьДатуИзСтр(Соот.Получить("ДатаНачала"));
					СпрОбъект.ДатаОкончания = ПолучитьДатуИзСтр(Соот.Получить("ДатаОкончания"));
					//СпрОбъект.ДатаНачалаДействияПС = ПолучитьДатуИзСтр(Соот.Получить("ДатаНачалаДействияПС"));
					//СпрОбъект.ДатаОкончанияДействияПС = ПолучитьДатуИзСтр(Соот.Получить("ДатаОкончанияДействияПС"));
					СпрОбъект.ШтрихКод = Соот.Получить("ШтрихКод");
					СпрОбъект.Описание = Соот.Получить("Описание");
					СпрОбъект.КомплектРасширенная = ?(НРег(СокрЛП(Соот.Получить("КомплектРасширенная"))) = "true" ИЛИ НРег(СокрЛП(Соот.Получить("КомплектРасширенная"))) = "да" ИЛИ НРег(СокрЛП(Соот.Получить("КомплектРасширенная"))) = "истина", Истина, Ложь);
					СпрОбъект.ОдинКупонНаЧек = ?(НРег(СокрЛП(Соот.Получить("ОдинКупонНаЧек"))) = "true" ИЛИ НРег(СокрЛП(Соот.Получить("ОдинКупонНаЧек"))) = "да" ИЛИ НРег(СокрЛП(Соот.Получить("ОдинКупонНаЧек"))) = "истина", Истина, Ложь);
					СпрОбъект.ПометкаУдаления = ?(НРег(СокрЛП(Соот.Получить("ПометкаУдаления"))) = "true" ИЛИ НРег(СокрЛП(Соот.Получить("ПометкаУдаления"))) = "да" ИЛИ НРег(СокрЛП(Соот.Получить("ПометкаУдаления"))) = "истина", Истина, Ложь);
					СпрОбъект.ДополнительныеСвойства.Вставить("НеРегистрировать", Истина);
					СпрОбъект.Записать();
				КонецЕсли;
			КонецЕсли;	
	
			
			Рез = Истина;
		Исключение
			ЗаписатьВЛог("Регламент","Обмен ФР.  акции: ошибка " + ОписаниеОшибки(),"Информация",Ложь);
		КонецПопытки;
	ИначеЕсли ИмяТипаХДТО = "Справочник.Акции.Группа" Тогда
		МасРекв = Новый Массив;
		МасРекв.Добавить("Ссылка");
		МасРекв.Добавить("Родитель");
		МасРекв.Добавить("Наименование");
		МасРекв.Добавить("Код");
		МасРекв.Добавить("ПометкаУдаления");
		Попытка
			Соот = Новый Соответствие;
			ЧтениеXML = Новый ЧтениеXML;
			Уст = Ложь;
			Если НЕ СтрокаПотока = Неопределено Тогда
				ЧтениеXML.УстановитьСтроку(СтрокаПотока);
				Пока ЧтениеXML.Прочитать() Цикл
					ИмяБезПИ = ИмяБезПИ(ЧтениеXML.Имя).Имя;
					Если ИмяБезПИ = ИмяТипаХДТО Тогда
						ЗаписатьВЛог("Регламент","Обмен ФР. тип акции: "+ИмяБезПИ ,"Информация",Ложь);
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							Уст = Истина;
						КонецЕсли;
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
							Уст = Ложь;
						КонецЕсли;
					КонецЕсли;
					Если Уст И  ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
						//ЗаписатьВЛог("Регламент","Обмен ФР. рекв акции: "+ИмяБезПИ ,"Информация",Ложь);
						ЕстьЭл = ?(МасРекв.Найти(ИмяБезПИ) = Неопределено, Ложь, Истина);
						ИмяРекв = ИмяБезПИ;
						ЗначАттр = Истина;
					КонецЕсли;
					
					Если Уст И  ЕстьЭл И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						ИмяРекв = "";
						ЗначАттр = Ложь;
					КонецЕсли;
					
					 Если Уст И  ЗначАттр И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					//Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					    
						//Обмен ФР. Начало акции: ee:Ссылка
						Если НЕ ПустаяСтрока(ИмяРекв) Тогда
							Соот.Вставить(ИмяРекв, ЧтениеXML.Значение);
						КонецЕсли;	
					КонецЕсли;
					 
				КонецЦикла;
			КонецЕсли;
			//Для Каждого КлЗ Из Соот Цикл
			//	ЗаписатьВЛог("Регламент","Обмен ФР.  акции: ключ "+КлЗ.Ключ + " знач " + КлЗ.Значение,"Информация",Ложь);
			//КонецЦикла;
			
			Если Соот.Количество() Тогда
				СтрСсылка = Соот.Получить("Ссылка");
				СтрРод = Соот.Получить("Родитель");
				Если НЕ ПустаяСтрока(СтрСсылка) Тогда
					Ссылка = Справочники.Акции.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрСсылка));
					СпрОбъект = Ссылка.ПолучитьОбъект();
					Если СпрОбъект = Неопределено Тогда
						СпрОбъект = Справочники.Акции.СоздатьГруппу();
						СпрОбъект.УстановитьСсылкуНового(Ссылка);
					КонецЕсли;
					//Обмен ФР.  акции: ключ Родитель знач 00000000-0000-0000-0000-000000000000
					Если НЕ СтрРод = "00000000-0000-0000-0000-000000000000" Тогда
						СсылкаРод = Справочники.Акции.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрРод));
						Если НЕ СсылкаРод.ПолучитьОбъект() = Неопределено Тогда
							СпрОбъект.Родитель = СсылкаРод;
						КонецЕсли;
					КонецЕсли;
					СпрОбъект.Код = Соот.Получить("Код");
					СпрОбъект.Наименование = Соот.Получить("Наименование");
					СпрОбъект.ПометкаУдаления = ?(НРег(СокрЛП(Соот.Получить("ПометкаУдаления"))) = "true" ИЛИ НРег(СокрЛП(Соот.Получить("ПометкаУдаления"))) = "да" ИЛИ НРег(СокрЛП(Соот.Получить("ПометкаУдаления"))) = "истина", Истина, Ложь);
					СпрОбъект.ДополнительныеСвойства.Вставить("НеРегистрировать", Истина);
					СпрОбъект.Записать();
				КонецЕсли;
			КонецЕсли;	
	
			
			Рез = Истина;
		Исключение
			ЗаписатьВЛог("Регламент","Обмен ФР.  акции: ошибка " + ОписаниеОшибки(),"Информация",Ложь);
		КонецПопытки;

	КонецЕсли;	
		
	Возврат Рез;
КонецФункции 

Функция ПолучитьДатуИзСтр(СтрДата) Экспорт
	
	Рез = Неопределено;
	Попытка
		СтрДата = СокрЛП(СтрДата);
		СтрРез = "";
		РаздТ = Найти(СтрДата,".");
		РаздТр = Найти(СтрДата,"-");
		РаздЗ = Найти(СтрДата,",");
		РаздСП = Найти(СтрДата,"/");
		РаздСО = Найти(СтрДата,"\");
		РаздДТ = Найти(СтрДата,":");
		Если (РаздТ>0) И (РаздТр>0) Тогда
			Если (РаздТ>РаздТр) Тогда
				РаздТ = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если (РаздТ > 0) ИЛИ (РаздЗ > 0) Тогда
			//сообщить("РаздСП "+строка(РаздСП));
			//предположим германский с разными разделителями
			Если (Сред(СтрДата,3,1) = ".") Тогда
				Попытка
					Если (РаздДТ > 0) Тогда
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						СтрЧМ = СокрЛП(Сред(СтрДата,11));
						СтрЧМ = СтрЗаменить(СтрЧМ,":","");
						СтрЧМ = СтрЗаменить(СтрЧМ,"T","");
						Если СтрДлина(СтрЧМ) = 5 Тогда
							СтрЧМ = "0" + СтрЧМ;
						КонецЕсли;
						Если СтрДлина(СтрЧМ)>6 Тогда
							СтрЧМ = Лев(СтрЧМ,6);
						КонецЕсли;
						Если НЕ(СтрЧМ = "000000") Тогда
							СтрРез = СтрРез + СтрЧМ;
						КонецЕсли;
						Рез = Дата(СтрРез);
					Иначе	
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						Рез = Дата(СтрРез);
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		ИначеЕсли РаздТр>0 Тогда
			
			Если Сред(СтрДата,3,1) = "-" Тогда
				Попытка
					Если РаздДТ>0 Тогда
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						СтрЧМ = СокрЛП(Сред(СтрДата,11));
						
						СтрЧМ = СтрЗаменить(СтрЧМ,":","");
						СтрЧМ = СтрЗаменить(СтрЧМ,"T","");
						Если СтрДлина(СтрЧМ) = 5 Тогда
							СтрЧМ = "0" + СтрЧМ;
						КонецЕсли;
						Если СтрДлина(СтрЧМ)>6 Тогда
							СтрЧМ = Лев(СтрЧМ,6);
						КонецЕсли;
						Если НЕ(СтрЧМ = "000000") Тогда
							СтрРез = СтрРез + СтрЧМ;
						КонецЕсли;
						Рез = Дата(СтрРез);
					Иначе	
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						Рез = Дата(СтрРез);
					КонецЕсли;
				Исключение
				КонецПопытки;
			Иначе
				СтрЧМ = СокрЛП(Сред(СтрДата,11));
				СтрРез = СтрЗаменить(СокрЛП(Лев(СтрДата,10)),"-","");
				СтрЧМ = СтрЗаменить(СтрЧМ,":","");
				СтрЧМ = СтрЗаменить(СтрЧМ,"T","");
				Если СтрДлина(СтрЧМ) = 5 Тогда
					СтрЧМ = "0" + СтрЧМ;
				КонецЕсли;
				Если СтрДлина(СтрЧМ)>6 Тогда
					СтрЧМ = Лев(СтрЧМ,6);
				КонецЕсли;
				Если НЕ(СтрЧМ = "000000") Тогда
					СтрРез = СтрРез + СтрЧМ;
				КонецЕсли;
				Рез = Дата(СтрРез);
			КонецЕсли;
			
		ИначеЕсли РаздСП>0 Тогда
			ДлС = СтрДлина(СтрДата);
			сообщить(длс);
			СтрГод = "";
			СтрМес = "";
			СтрДень = "";
			Поз = 1;
			СчтСлаш = 0;
			Пока Поз<= ДлС Цикл
				Если Сред(СтрДата, Поз, 1) = "/" Тогда
					СчтСлаш = СчтСлаш + 1;
				Иначе
					Если СчтСлаш = 0 Тогда
						СтрМес = СтрМес + Сред(СтрДата, Поз, 1);
					ИначеЕсли СчтСлаш = 1 Тогда
						СтрДень = СтрДень + Сред(СтрДата, Поз, 1);
					Иначе
						СтрГод = СтрГод + Сред(СтрДата, Поз, 1);
					КонецЕсли;
				КонецЕсли;
				Поз  =  Поз  +  1;
			КонецЦикла;
			СтрГод = ?(СтрДлина(СтрГод)>4, Лев(СтрГод,4), СтрГод);
			Рез = Дата(Число(СтрГод),Число(СтрМес), Число(СтрДень));
		Иначе
			//анси формат
			Если СтрДлина(СтрДата)>= 8 Тогда
				Рез = Дата(Лев(СтрДата,8));
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат Рез;
	
КонецФункции // - HELP-1867 20241031 Михайловский

Процедура ЗагрузитьРегистрСведений(ОбъектХДТО,Вид,Отправитель)
	Если Вид="КоличествоПосетителей" Тогда
		ЗагрузитьРС_КоличествоПосетителей(ОбъектХДТО,Отправитель);		
	ИначеЕсли Вид="СкидкиНоменклатуры" Тогда
		ЗагрузитьРС_СкидкиНоменклатуры(ОбъектХДТО,Отправитель);		
	Иначе
		Сообщить_("Загрузка регистра сведений: """+Вид+""" пока не разработана !",СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

Функция ЗагрузитьСправочник(ОбъектХДТО,ИмяТипаХДТО,Отправитель)
	ПолныйТипИст	= ИмяТипаХДТО;
	ПолныйТипТек	= ПолучитьТипТек(ПолныйТипИст);	
	
	Если ЗначениеЗаполнено(ПолныйТипТек) Тогда		
		ТипОбъекта	= РазложитьПолныйТип(ПолныйТипТек);
		ВидТек		= ТипОбъекта.Вид;
		
		ОбработчикЗагрузки	= ПолучитьОбработчикЗагрузки(ИмяТипаХДТО);
		Если ОбработчикЗагрузки.Найден Тогда
			Рез	= Вычислить(ОбработчикЗагрузки.ПроцедураЗагрузки+"(ОбъектХДТО,Отправитель)");
		КонецЕсли;		
	Иначе
		ТекстОшибки	= "Не найдено соответствие типа для: "+ПолныйТипИст;
		ДобавитьОбъектВПротоколОбмена(ПолныйТипИст,,"Поиск соответствия типов",ТекстОшибки);		
		Сообщить_(ТекстОшибки,СтатусСообщения.Важное);
	КонецЕсли;
	
КонецФункции //ЗагрузитьСправочник(ОбъектХДТО,ВидИст,Отправитель)

Функция ЗагрузитьРС_СкидкиНоменклатуры(ОбъектХДТО,Отправитель)
	ТипСкидок_Ист	= ОбъектХДТО.Отбор.ТипСкидок;
	ТипСкидок_Тек	= НайтиТипСкидок(ОбъектХДТО.Подразделение,ТипСкидок_Ист);
	
	Если НЕ ЗначениеЗаполнено(ТипСкидок_Тек) Тогда Возврат Неопределено КонецЕсли; 
	
	НЗ				= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
	
	НЗ.Отбор.Документ.Установить(ОбъектХДТО.Отбор.ДокументУстановкаСкидок,Истина);
	НЗ.Отбор.ТипСкидок.Установить(ТипСкидок_Тек,Истина);	
	
	Если ОбъектХДТО.Отбор.Номенклатура<>Неопределено Тогда
		НЗ.Отбор.Номенклатура.Установить(ОбъектХДТО.Отбор.Номенклатура,Истина);	
	КонецЕсли;	
	
	Для Каждого ЗаписьХДТО Из ОбъектХДТО.Строка Цикл
		Запись	= НЗ.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ЗаписьХДТО);		
		
		Запись.Документ	= ЗаписьХДТО.ДокументУстановкаСкидок;
		
		Запись.Период		= ОбъектХДТО.Период;
		Запись.ТипСкидок	= ТипСкидок_Тек;
	КонецЦикла;	
	
	НЗ.ОбменДанными.Загрузка=Истина;
	Если Отправитель<>Неопределено И Отправитель<>"Нечто" Тогда
		НЗ.ОбменДанными.Отправитель=Отправитель;	
	КонецЕсли; 
	
	ЗаписатьОбъект(НЗ,Отправитель);
КонецФункции //ЗагрузитьРС_СкидкиНоменклатуры(ОбъектХДТО,Отправитель=Неопределено)

Функция НайтиТипСкидок(Подразделение,БазовыйТипСкидок)
	Результат = Справочники.ТипыСкидок.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	РозничныйТипСкидок КАК ТипСкидок
	|ИЗ
	|	Справочник.Подразделения
	|ГДЕ
	|	РозничныйТипСкидок.Базовый = &БазовыйТипСкидок
	|	И Ссылка = &Подразделение
	|";
	
	//Запрос.УстановитьПараметр("",);
	Запрос.УстановитьПараметр("Подразделение",		Подразделение);
	Запрос.УстановитьПараметр("БазовыйТипСкидок",	БазовыйТипСкидок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.ТипСкидок;	
	КонецЦикла; 
	
	Возврат Выборка.ТипСкидок;
КонецФункции //НайтиТипСкидок(Подразделение,БазовыйТипСкидок)
 


#Область Загрузка_СлужебныеФункции


Функция ПолучитьТипТек(Знач ТипИст)
	Части	= СтрРазделить(ТипИст,".");
	Если Части.Количество()>2 Тогда
		ТипИст=Части[0]+"."+Части[1];			
	КонецЕсли; 
		
	ТипТек	= СоответствиеТиповОбъектов_ЕД.Получить(ТипИст);
	Если ТипТек = Неопределено Тогда		
		ТипТек	= СоответствиеТипов_Нов_Стар.Получить(ТипИст);	
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(ТипТек),ТипТек,ТипИст);
КонецФункции //ПолучитьТипТек(ТипИст)

Функция СокращениеТипа(Тип)
	Если Тип="ПланВидовХарактеристик" Тогда			
		Сокр="Пвх";		
	ИначеЕсли Тип="РегистрСведений" Тогда
		Сокр="РС";		
	Иначе
		Сокр=Лев(Тип,3);						
	КонецЕсли;
	
	Возврат Сокр;	
КонецФункции //СокращениеТипа(Тип)

Процедура ВывестиПротоколЗагрузки(Протокол) Экспорт
	Если Протокол.Ошибки.Количество()=0 Тогда
		Сообщить_("Загруженные объекты: ");
		Для Каждого Элемент Из ОбъектыОбмена Цикл
			ОбъектСсылка=Неопределено;
			Если СтрНайти(Элемент.ОбъектТип,"РегистрСведений.")=0 Тогда			
				Менеджер 	= ПолучитьМенеджерКласса(Элемент.ОбъектТип);
				Если Менеджер<>Неопределено Тогда				
					ОбъектСсылка= Менеджер.ПолучитьСсылку(Элемент.ОбъектСсылкаУИД);
				КонецЕсли;				
			КонецЕсли; 
			
			Сообщить_("	"+Элемент.ОбъектТип+" "+ОбъектСсылка+" ("+Элемент.ОбъектСсылкаУИД+")"+Элемент.ВариантВыгрузки);	
		КонецЦикла;
	Иначе
		ТекстОшибки=СтрСоединить(Протокол.Ошибки,Символы.ПС);
		Сообщить_(ТекстОшибки,СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры

Функция СоздатьПротоколЗагрузки()
	Возврат Новый Структура("ОшибкаРазбораФйла,Отправитель,ЗагруженныеОбъекты,ОшибкиЗагрузки","",Неопределено,Новый Соответствие,Новый Соответствие);
КонецФункции // ()

Функция ЗаписатьОбъект(Объект,Отправитель)
	Объект.ОбменДанными.Загрузка	= Истина;
	
	Если ЗначениеЗаполнено(Отправитель) И Отправитель<>"Нечто" Тогда		
		Попытка
			Объект.ОбменДанными.Отправитель	= Отправитель;			
		Исключение
			Сообщить_("Ошибка установки отправителя ! "+Объект+" "+ТипЗнч(Объект)+" "+Отправитель+" "+ТипЗнч(Отправитель));
		КонецПопытки;		
	КонецЕсли;	
	
	Попытка
		Если ЗначениеЗаполнено(Отправитель) И ТипЗнч(Отправитель) = Тип("ПланОбменаСсылка.ФР_ОбменСФРК") Тогда
			Объект.ДополнительныеСвойства.Вставить("НеРегистрировать", Истина);					
		КонецЕсли; 
		Объект.Записать();
		
		ДобавитьОбъектВПротоколОбмена(Объект,"Запись","Запись");
		
		Если ФР_ОбщегоНазначения_ПИ.ЭтоСсылочныйТип(ЗначениеВСтрокуВнутр(ТипЗнч(Объект))) Тогда
			Результат	= Объект.Ссылка;		
		Иначе
			Результат	= Неопределено;
		КонецЕсли;
	Исключение
		ТекстОшибки	= "Ошибка записи объекта: "+Объект+" "+ОписаниеОшибки();
		ДобавитьОбъектВПротоколОбмена(Объект,"Запись","Запись",ТекстОшибки);
		
		Сообщить_(ТекстОшибки,СтатусСообщения.Важное);				
	КонецПопытки;
	
	Возврат Результат;
КонецФункции //ЗаписатьОбъект(Объект,Отправитель)

Функция ПолучитьОбработчикЗагрузки(ИмяТипаХДТО)
	Результат	= Новый Структура("Найден,ПроцедураЗагрузки,ИмяТаблицы,Ошибки",Ложь,"","",Новый Массив);
	СтрокиТО	= ОбработчикиЗагрузки.НайтиСтроки(Новый Структура("ИмяТипаХДТО",ИмяТипаХДТО)); 
	Если СтрокиТО.Количество()=1 Тогда
		СтрокаТО					= СтрокиТО[0];						
		
		Результат.Найден			= Истина;
		Результат.ПроцедураЗагрузки = СтрокаТО.ПроцедураЗагрузки;
		Результат.ИмяТаблицы		= СтрокаТО.ИмяТаблицы;
	Иначе		
		Если СтрокиТО.Количество()=0 Тогда
			ТекстОшибки	= "Не найдена процедура загрузки ! Тип объекта: """+ИмяТипаХДТО+""" !";		
		Иначе
			ТекстОшибки	= "Определено несколько процедур загрузки ! Тип объекта: """+ИмяТипаХДТО+""" !";
		КонецЕсли;
		Сообщить_(ТекстОшибки,СтатусСообщения.Важное);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьОбработчикЗагрузки(ПолныйТипИст)

Функция РазложитьПолныйТип(ПолныйТип)
	Результат	= Новый Структура("Тип,Вид","","");
	
	ЧастиТипа	= СтрРазделить(ПолныйТип,".");
		
	Если ЧастиТипа.Количество()>1 Тогда
		Результат.Тип	= ЧастиТипа[0];
		Результат.Вид	= ЧастиТипа[1];
		
		Если ЧастиТипа.Количество()>2 И ЧастиТипа[2]="Группа" Тогда		
			Результат.Вид=Результат.Вид+ЧастиТипа[2];
		КонецЕсли;		
	Иначе
		Результат.Тип	= "";
		Результат.Вид	= ЧастиТипа[0];
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //РазложитьТипXML(ТипXML)


#КонецОбласти

#КонецОбласти


#Область Загрузка_Документы


Процедура ЗагрузитьДокумент(ОбъектХДТО,ВидИст,Отправитель)	
	Если ЗначениеЗаполнено(ВидИст) Тогда		
		ОбработчикЗагрузки	= ПолучитьОбработчикЗагрузки(ВидИст);
		Если ОбработчикЗагрузки.Найден Тогда
			Попытка
				Рез	= Вычислить(ОбработчикЗагрузки.ПроцедураЗагрузки+"(ОбъектХДТО,Отправитель)");
			Исключение				
				ТекстОшибки	= ОписаниеОшибки();
				Сообщить_(ТекстОшибки,СтатусСообщения.Важное);
				ДобавитьОбъектВПротоколОбмена(ВидИст,"","Ошибка",ТекстОшибки);
			КонецПопытки;			
		Иначе
			ДобавитьОбъектВПротоколОбмена(ВидИст,"","Ошибка","Не найден обработчик загрузки !");			
		КонецЕсли;		
	Иначе
		Сообщить_("Не найдено соответствие типа для: "+ВидИст,СтатусСообщения.Важное);
	КонецЕсли; 			
КонецПроцедуры

//Был вариант с Актом.......но почему бы не сделать еще парочку однотипны документов......см.  "ЗаявкаНаРекламацию"
Функция ЗагрузитьДок_АКТ_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.АктПриемки;	
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.АктПриемки.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,"Номер");	
	
	ДокОбъект.РНК						= ОбъектХДТО.ДокОснование;	
	ДокОбъект.НомерАкта					= ОбъектХДТО.Номер;
	ДокОбъект.ИдентификаторАктаПриемки	= ОбъектХДТО.Номер;
	
	Если ЗначениеЗаполнено(ДокОбъект.РНК) Тогда
		РеквизитыШ_Основание	= ПолучитьРеквизитыШапки(ДокОбъект.РНК,"Контрагент,ПунктДоставки,Склад,Организация","Документ");	
		ЗаполнитьЗначенияСвойств(ДокОбъект,РеквизитыШ_Основание);
	КонецЕсли;	
	
	Если НЕ РезультатПоиска.Найден ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.СостояниеДокумента) Тогда
		ДокОбъект.СостояниеДокумента = Перечисления.СостоянияНакладной.Доставлена;
		//ДокОбъект.СостояниеСогласования	= Перечисления.СостоянияСогласования.НаСогласованииЦО;
	КонецЕсли;	
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());	
			
			СтрокаТЧ.Заказано		= СтрокаТЧ_ХДТО.КоличествоПоДокументу;
			СтрокаТЧ.Отправлено		= СтрокаТЧ_ХДТО.КоличествоПоДокументу;
			СтрокаТЧ.Принято		= СтрокаТЧ_ХДТО.Количество;
			
			СтрокаТЧ.ЦенаПриемкиСНДС    = СтрокаТЧ_ХДТО.Цена;
			СтрокаТЧ.ЦенаПриемки		= СтрокаТЧ_ХДТО.Цена/(1+ПроцентНДСпоСтавке(СтрокаТЧ.Номенклатура.Родитель.СтавкаНДС));
			
			СтрокаТЧ.СуммаПриемки			= СтрокаТЧ.Принято*СтрокаТЧ.ЦенаПриемки;
			СтрокаТЧ.СуммаПриемкиСНДС		= СтрокаТЧ.Принято*СтрокаТЧ.СуммаПриемкиСНДС;
		КонецЦикла;
	КонецЕсли;
	
	Если ДокОбъект.ЭтоНовый() ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.Номер) Тогда
		ДокОбъект.УстановитьНовыйНомер("SNL-");	
	КонецЕсли; 
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_АКТ_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ЗРК_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ЗаявкаНаРекламацию;	
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ЗаявкаНаРекламацию.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);	
	
	ДокОбъект.ДокОснование	= ОбъектХДТО.ДокОснование;	
	ДокОбъект.Валюта		= ВалютаНац;
	ДокОбъект.Курс			= 1;
	
	Если ЗначениеЗаполнено(ДокОбъект.ДокОснование) Тогда
		РеквизитыШ_Основание	= ПолучитьРеквизитыШапки(ДокОбъект.ДокОснование,"Контрагент,ПунктДоставки,Склад,Организация","Документ");	
		РеквизитыШ_Основание.Вставить("Корреспондент", РеквизитыШ_Основание.Контрагент);
		
		ЗаполнитьЗначенияСвойств(ДокОбъект,РеквизитыШ_Основание);
	КонецЕсли;	
	
	Если НЕ РезультатПоиска.Найден ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.СостояниеЗаявки) Тогда
		Попытка
			ДокОбъект.СостояниеЗаявки = Перечисления.СостоянияКоррекции.ВРаботе;
		Исключение
		КонецПопытки;		
		//ДокОбъект.СостояниеСогласования	= Перечисления.СостоянияСогласования.НаСогласованииЦО;
	КонецЕсли;	
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());	
			
			СтрокаТЧ.КоличествоИсх	= СтрокаТЧ_ХДТО.КоличествоПоДокументу;
			СтрокаТЧ.КоличествоФакт	= СтрокаТЧ_ХДТО.Количество;
			СтрокаТЧ.Количество		= СтрокаТЧ.КоличествоФакт - СтрокаТЧ.КоличествоИсх;
			
			СтрокаТЧ.Единица		= ЕдиницаШт(СтрокаТЧ.Номенклатура);
			СтрокаТЧ.Коэффициент	= 1;	
			
			СтрокаТЧ.Цена		    = СтрокаТЧ_ХДТО.Цена;			
			
			СтрокаТЧ.Всего			= СтрокаТЧ.Количество*СтрокаТЧ.Цена;			
		КонецЦикла;
	КонецЕсли;
	
	Если ДокОбъект.ЭтоНовый() И НЕ ЗначениеЗаполнено(ДокОбъект.Номер) Тогда
		ДокОбъект.УстановитьНовыйНомер("SNL-");	
	КонецЕсли; 
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ЗРК_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ЗНС_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ЗаявкаНаСкидки;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект	= РезультатПоиска.Объект;
		
	ИменаТЧ		= "Скидки";
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,ИменаТЧ);
	
	ЗагрузитьТЧОбъекта(ДокОбъект,ОбъектХДТО,"Скидки");		
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ЗНС_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ЗНЦ_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ЗаявкаНаУстановкуЦен;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект	= РезультатПоиска.Объект;
	Если 1=2 Тогда
		ДокОбъект = Документы.ЗаявкаНаУстановкуЦен.СоздатьДокумент();	
	КонецЕсли; 
		
	ИменаТЧ		= "ЦеныНоменклатуры";
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,ИменаТЧ);
	
	Если СтрНайти(ДокОбъект.ТипЦен.Наименование,"SALE")<>0 Тогда
		ДокОбъект.ТипЦен = ДокОбъект.Подразделение.РозничныйТипЦенРаспродажа;
	Иначе
		ДокОбъект.ТипЦен = ДокОбъект.Подразделение.РозничныйТипЦен;		
	КонецЕсли; 
	
	ЗагрузитьРеквизитыСМультиТипами(ДокОбъект,ОбъектХДТО,"ДокОснование");
	
	ЗагрузитьТЧОбъекта(ДокОбъект,ОбъектХДТО,"ЦеныНоменклатуры");		
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ЗНЦ_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ЗНВПок(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ЗаявкаНаВозвратОтПокупателя;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ЗаявкаНаВозвратОтПокупателя.СоздатьДокумент();	
	КонецЕсли;
	
	ИменаТЧ	= "Товары";
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,ИменаТЧ);
	
	РеквизитыДоговора		= ПолучитьРеквизитыШапки(ДокОбъект.Договор,"Организация,Владелец","Справочник");
	
	ДокОбъект.Организация	= РеквизитыДоговора.Организация;
	ДокОбъект.Контрагент	= РеквизитыДоговора.Владелец;
	
	ДокОбъект.СостояниеСогласования_Покупатель	= ЗагрузитьПер("СостоянияСогласования",ОбъектХДТО.СостояниеСогласования_Покупатель);
	ДокОбъект.СостояниеСогласования_Поставщик	= ЗагрузитьПер("СостоянияСогласования",ОбъектХДТО.СостояниеСогласования_Поставщик);
	
	Если ДокОбъект.СостояниеСогласования_Покупатель=Перечисления.СостоянияСогласования.НаСогласованииЦО Тогда
		ДокОбъект.СостояниеСогласования_Покупатель=Перечисления.СостоянияСогласования.НаСогласованииКонтрагент;
	ИначеЕсли ДокОбъект.СостояниеСогласования_Покупатель=Перечисления.СостоянияСогласования.ОтмененЦО Тогда
		ДокОбъект.СостояниеСогласования_Покупатель=Перечисления.СостоянияСогласования.ОтмененКонтрагент;
	КонецЕсли;
	
	СоотвРекв_Товары	= Новый Структура("СоответствиеРеквизитов",	Новый Структура("ДокументОтгрузки","ПриходнаяНакладная"));
	ДопПараметры		= Новый Структура("Товары",					СоотвРекв_Товары);
	
	ЗагрузитьТЧОбъекта(ДокОбъект, ОбъектХДТО, ИменаТЧ, ДопПараметры);
	
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ЗНВПок(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ЗНВПок_СтатусОбмена(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ЗаявкаНаВозвратОтПокупателя;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);
	Если НЕ РезультатПоиска.Найден Тогда
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Не найден документ: "+ОбъектХДТО.Ссылка.УникальныйИдентификатор());
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект = ОбъектХДТО.Ссылка.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,"Ссылка");	
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ЗНВПок(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ЗПК_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.Заказ;	
	Вид			= "Заказ";
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект = РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект = Документы.Заказ.СоздатьДокумент();	
	КонецЕсли;
	
	Если РезультатПоиска.Найден Тогда
		Если ДокОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииКонтрагент
			ИЛИ ДокОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО Тогда		
			
			Если ОбъектХДТО.Состояние = "Согласован" Тогда			
				ДокОбъект.СостояниеСогласования	= Перечисления.СостоянияСогласования.Согласован;							
				ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);	
			КонецЕсли;			
			//Малахов 14.11.23
			//В SNL: при загрузке из ЦО_ФР редактируется только «подтвержденная заявка», за исключением первичной записи
			ТЧ_ХДТО	= ОбъектХДТО.Товары;
			Если ТЧ_ХДТО<>Неопределено Тогда
				Сч=0;
				Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
				ДокОбъект.Товары[Сч].ПодтвержденнаяЗаявка=СтрокаТЧ_ХДТО.ПодтвержденнаяЗаявка;
				Сч=Сч+1;
				КонецЦикла;
			ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);
			КонецЕсли;
			//Малахов 14.11.23
			Возврат ДокОбъект.Ссылка;
		КонецЕсли; 	
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,"Номер,Склад");	
	
	ДокОбъект.ВидОплаты				= Перечисления.ВидыОплаты.БН;
	ДокОбъект.Номер					= ОбъектХДТО.Номер;
	ДокОбъект.НомерЗаказа			= ОбъектХДТО.Номер;
	ДокОбъект.ДатаЗаказа			= ОбъектХДТО.Дата;		
	ДокОбъект.ОтсрочкаПлатежа		= ДокОбъект.Договор.ОтсрочкаПлатежа;
	
	Если НЕ РезультатПоиска.Найден ИЛИ Истина Тогда
		ДокОбъект.ИсточникЗаказа		= Перечисления.ИсточникЗаказа.БазаТЦфранчайзинг;
		ДокОбъект.Организация			= Справочники.Организации.НайтиПоКоду("SS-001");
		ДокОбъект.Склад 				= Справочники.Склады.НайтиПоКоду("STB-01");
		ДокОбъект.СостояниеНакладной    = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
		//ДокОбъект.ПунктДоставки			= ПолучитьПунктДоставкиПодразделения(ОбъектХДТО.Подразделение);
		ДокОбъект.ПунктДоставки			= ДокОбъект.Контрагент.ОсновнойПунктДоставки;
		ДокОбъект.ТипЦен				= ДокОбъект.Контрагент.ТипЦен;
		ДокОбъект.ТипЦенРаспродажа		= ДокОбъект.Контрагент.ТипЦенРаспродажа;
		
		ДокОбъект.ДополнительныеСклады.Очистить();
		Для Каждого Склад Из ПолучитьДопСклады(ДокОбъект.Склад) Цикл
			СтрокаС = ДокОбъект.ДополнительныеСклады.Добавить();		
			СтрокаС.Склад = Склад;		
		КонецЦикла;		
		
		ДокОбъект.СостояниеСогласования	= Перечисления.СостоянияСогласования.НаСогласованииЦО;			
		ДокОбъект.ДатаОтгрузки			= ОбъектХДТО.ДатаОтгрузкиПлан;
		ДокОбъект.ИсточникЗаказа		= Перечисления.ИсточникЗаказа.БазаТЦфранчайзинг;
		//ДокОбъект.ДатаОплаты			= ОбъектХДТО.ДатаОплаты;
		//ДокОбъект.СостояниеНакладной	= ЗагрузитьПер("СостоянияНакладной",ОбъектХДТО.Состояние);			
	КонецЕсли;	
	
	СуммаВключаетНДС		= Истина;	
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());	
			
			СтрокаТЧ.Единица		= Ед_Штука;
			СтрокаТЧ.Коэффициент	= 1;
			СтрокаТЧ.ЦенаИсточник	= СтрокаТЧ.Цена;
		КонецЦикла;
	КонецЕсли;

	
	
	ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
	
	ДокОбъект.ПометкаУдаления	= ОбъектХДТО.ПометкаУдаления;
	ДокОбъект.Проведен			= ОбъектХДТО.Проведен;
	
	ДокОбъект.ИБ = ИБ_SSP;	
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ЗПК_ЕЕ(ОбъектХДТО,Отправитель)

Функция ПолучитьДопСклады(Склад)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ Ссылка ИЗ Справочник.Склады 
	|ГДЕ 
	|	Ссылка = &ФизическийСклад 
//	|	И НЕ ФизическийСклад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//	|	И Ссылка<>&Склад
	|	И НЕ ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Склад", 			 Склад);	
	Запрос.УстановитьПараметр("ФизическийСклад", Склад.ФизическийСклад);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции // ()
 

Функция ЗагрузитьДок_ИНВ(ОбъектХДТО,Отправитель)
	Менеджер	= Документы.Инвентаризация;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);	
	Если РезПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли;
	
	ДокОбъект	= РезПоиска.Объект;	
	
	Если 1=2 Тогда
		ДокОбъект= Документы.Инвентаризация.СоздатьДокумент();	
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);	
	
	ДокОбъект.СостояниеНакладной	 	= ЗагрузитьПер("СостоянияНакладной", ОбъектХДТО.СостояниеНакладной, Перечисления.СостоянияНакладной.ВРаботе);
	ДокОбъект.СкладВременногоХранения	= ДокОбъект.Склад;
	ДокОбъект.НеФормироватьПроводки		= Истина;
	
	ДокОбъект.ИБ			= ФР_ОбщегоНазначения_ПИ.ТекущаяИБ();
	ДокОбъект.Валюта 		= ВалютаНац;	
	ДокОбъект.Курс			= ПолучитьКурсВалюты(ДокОбъект.Валюта, ДокОбъект.Дата).Курс;
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());	
			
			СтрокаТЧ.Единица		= Ед_Штука;
			СтрокаТЧ.Коэффициент	= 1;
		КонецЦикла;
	КонецЕсли;	
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезПоиска.Найден);	
КонецФункции //ЗагрузитьДокумент_ИНВ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ОКС_ЕЕ(ОбъектХДТО,Отправитель)
	
	Если ОбъектХДТО.Товары<>Неопределено Тогда
		ЗагрузитьДок_ОКС_ЕЕ_Продажа(ОбъектХДТО,Отправитель);		
	КонецЕсли;	
	
	Возвраты_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"Возвраты");
	Если Возвраты_ХДТО<>Неопределено И Возвраты_ХДТО.Строка.Количество()>0 Тогда	
		ЗагрузитьДок_ОКС_ЕЕ_Возврат(ОбъектХДТО,Отправитель);		
	КонецЕсли;	
	
КонецФункции //ЗагрузитьДокумент_ОКС(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ОКС_ЕЕ_Продажа(ОбъектХДТО,Отправитель)
	Вид			= "ОтчетКассовойСмены";
	Менеджер	= Документы[Вид];	
	КодОперации	= Перечисления.КодыОперацийОстатки.Реализация;	
	
	РезультатПоиска	= НайтиСоздатьОКС(ОбъектХДТО.Дата,ОбъектХДТО.Ссылка.УникальныйИдентификатор(),КодОперации);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ОтчетКассовойСмены.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,"Комментарий");	
	ДокОбъект.КодОперации	= КодОперации;
	
	СуммаВключаетНДС		= Истина;	
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
			СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧ.Количество*СтрокаТЧ.ЦенаБезСкидки;
			
			СтрокаТЧ.Единица		= Ед_Штука;
			СтрокаТЧ.Коэффициент	= 1;			
		КонецЦикла;
	КонецЕсли;
	
	//Оплата платежными картами
	СуммаОплатыБН	= 0;
	
	ТЧ_ХДТО	= ОбъектХДТО.Оплата;
	Если ТЧ_ХДТО<>Неопределено Тогда		
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			Если ЭтоБезнал(СтрокаТЧ_ХДТО.ВидОплаты) Тогда
				СуммаОплатыБН	= СуммаОплатыБН+СтрокаТЧ_ХДТО.СуммаОплаты;			
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;	
	
	ДокОбъект.ПодарочныеСертификаты.Очистить();	
	ТЧ_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"ПодарочныеСертификаты");
	Если ТЧ_ХДТО<>Неопределено Тогда		
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ							= ДокОбъект.ПодарочныеСертификаты.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
		КонецЦикла; 
	КонецЕсли;	
	
	СуммаОКС 		= ДокОбъект.Товары.Итог("Всего");
	СуммаОплатыСерт = ДокОбъект.ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");
	СуммаОплатыНал	= СуммаОКС-СуммаОплатыСерт-СуммаОплатыБН;
	
	ДокОбъект.ВидОплаты			=?(СуммаОплатыБН>0,Перечисления.ВидыОплаты.БН,Перечисления.ВидыОплаты.НАЛ);	
	ДокОбъект.Номер				= СформироватьНомерОКС(ОбъектХДТО.Номер,ДокОбъект.ВидОплаты);
	
	ДокОбъект.ПометкаУдаления	= ОбъектХДТО.ПометкаУдаления;
	ДокОбъект.Проведен			= ОбъектХДТО.Проведен;
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);
КонецФункции //ЗагрузитьДокумент_ОКС(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ОКС_ЕЕ_Возврат(ОбъектХДТО,Отправитель)
	Вид			= "ОтчетКассовойСмены";
	Менеджер	= Документы[Вид];	
	КодОперации	= Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
	
	РезПоиска	= НайтиСоздатьОКС(ОбъектХДТО.Дата,ОбъектХДТО.Ссылка.УникальныйИдентификатор(),КодОперации);	
	Если РезПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли;
	
	ДокОбъект				= РезПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ОтчетКассовойСмены.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,"Комментарий");
	ДокОбъект.КодОперации	= КодОперации;
	
	СуммаВключаетНДС	= Истина;	
	
	ДокОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТЧ_ХДТО Из ОбъектХДТО.Возвраты.Строка Цикл
		СтрокаТЧ				= ДокОбъект.Товары.Добавить();		
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);
		
		СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
		СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧ.Количество*?(СтрокаТЧ.ЦенаБезСкидки=0,СтрокаТЧ.Цена,СтрокаТЧ.ЦенаБезСкидки);
		СтрокаТЧ.Единица		= Ед_Штука;
		СтрокаТЧ.Коэффициент	= 1;
		СтрокаТЧ.Подразделение	= ДокОбъект.Подразделение;
	КонецЦикла;
	
	СуммаОплатыБН	= 0;
	ТЧ_ХДТО	= ОбъектХДТО.ВозвратОплаты;
	Если ТЧ_ХДТО<>Неопределено Тогда		
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			Если ЭтоБезнал(СтрокаТЧ_ХДТО.ВидОплаты) Тогда
				СуммаОплатыБН	= СуммаОплатыБН+СтрокаТЧ_ХДТО.СуммаОплаты;			
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;	
	
	ДокОбъект.ПодарочныеСертификаты.Очистить();
	
	СуммаОКС 		= ДокОбъект.Товары.Итог("Всего");
	СуммаОплатыСерт = ДокОбъект.ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");
	СуммаОплатыНал	= СуммаОКС-СуммаОплатыСерт-СуммаОплатыБН;	
	
	ДокОбъект.ВидОплаты			=?(СуммаОплатыБН>0,Перечисления.ВидыОплаты.БН,Перечисления.ВидыОплаты.НАЛ);	
	ДокОбъект.Номер				= СформироватьНомерОКС(ОбъектХДТО.Номер,ДокОбъект.ВидОплаты);	
	
	ДокОбъект.ПометкаУдаления	= ОбъектХДТО.ПометкаУдаления;
	ДокОбъект.Проведен			= ОбъектХДТО.Проведен;
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезПоиска.Найден);
КонецФункции //ЗагрузитьДокумент_ОКС(ОбъектХДТО,Отправитель)

Функция ЭтоБезнал(ВидОплатыЧекаККМ)
	Результат = Ложь;
	Если ТипЗнч(ВидОплатыЧекаККМ)=Тип("СправочникСсылка.ФР_ВидыОплатЧекаККМ") И
		ЗначениеЗаполнено(ВидОплатыЧекаККМ) Тогда
					
		Результат = (ПолучитьРеквизитШапки(ВидОплатыЧекаККМ,"ВидОплаты","Справочник")=Перечисления.ВидыОплаты.БН);
	КонецЕсли;
	
	Возврат	Результат;
КонецФункции // ()


Функция ЗагрузитьДок_ОКС_ЕД(ОбъектХДТО,Отправитель)
	
	Если ОбъектХДТО.ТоварыПродажа<>Неопределено Тогда
		ЗагрузитьДок_ОКС_ЕД_Продажа(ОбъектХДТО,Отправитель);		
	КонецЕсли;	
	
	Если ОбъектХДТО.ТоварыВозвратПродажи<>Неопределено И ОбъектХДТО.ТоварыВозвратПродажи.Строка.Количество()>0 Тогда	
		ЗагрузитьДок_ОКС_ЕД_Возврат(ОбъектХДТО,Отправитель);		
	КонецЕсли;	
	
КонецФункции //ЗагрузитьДокумент_ОКС(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ОКС_ЕД_Продажа(ОбъектХДТО,Отправитель)
	Вид			= "ОтчетКассовойСмены";
	Менеджер	= Документы[Вид];	
	КодОперации	= Перечисления.КодыОперацийОстатки.Реализация;
	
	КС_ХДТО		= ОбъектХДТО.КлючевыеСвойства;
	
	РезультатПоиска	= НайтиСоздатьОКС(КС_ХДТО.Дата,КС_ХДТО.Ссылка,КодОперации);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ОтчетКассовойСмены.СоздатьДокумент();	
	КонецЕсли;
		
	ДокОбъект.Дата			= КС_ХДТО.Дата;
	ДокОбъект.Номер			= КС_ХДТО.Номер;
	
	ДокОбъект.КодОперации	= КодОперации;
	
	ДокОбъект.Организация	= ЗагрузитьСпр_Организации_КС(КС_ХДТО.Организация);	
	
	ДокОбъект.Автор			= ЗагрузитьСпр_Пользователи_Элемент_КС(ОбъектХДТО.Ответственный);	
	
	ДокОбъект.СуммаДокумента= ОбъектХДТО.Сумма;	
	ДокОбъект.Валюта		= ЗагрузитьСпр_Валюты_КС(ОбъектХДТО.Валюта);
	ДокОбъект.Склад			= ЗагрузитьСпр_Склады_Элемент_КС(ОбъектХДТО.Склад);
	ДокОбъект.Касса			= ЗагрузитьСпр_Кассы_Элемент_КС(ОбъектХДТО.КассаККМ);
	
	ДокОбъект.Подразделение	= ЗагрузитьСпр_Подразделения_Элемент_КС(ОбъектХДТО.Подразделение);
	
	Контрагент_ЧЛ			= ПолучитьРеквизитШапки(ДокОбъект.Подразделение,"ЧастноеЛицо","Справочник");
	
	СуммаВключаетНДС		= ОбъектХДТО.СуммаВключаетНДС;
	
	//Малахов сдача с сертификатов 27.12.2023
	ДокОбъект.СуммаСдачиПодарочногоСертификата=ОбъектХДТО.СуммаСдачиПодарочногоСертификата;
	//Малахов конец 27.12.2023
	
	ДокОбъект.Товары.Очистить();
	Если ОбъектХДТО.ТоварыПродажа<>Неопределено Тогда	
		Для Каждого СтрокаТЧXDTO Из ОбъектХДТО.ТоварыПродажа.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			
			ДанныеНоменклатуры	= ДанныеНоменклатуры(СтрокаТЧXDTO);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,ДанныеНоменклатуры);			
			
			СтрокаТЧ.Количество		= СтрокаТЧXDTO.Количество;			
			СтрокаТЧ.Коэффициент	= 1;	
			СтрокаТЧ.Цена			= СтрокаТЧXDTO.Цена;
			
			СтрокаТЧ.НДС			= СтрокаТЧXDTO.СуммаНДС;
			СтрокаТЧ.Всего			= СтрокаТЧXDTO.Сумма+?(СуммаВключаетНДС,0,СтрокаТЧ.СуммаНДС);
			////////////////////////////////////////////////////////////////////////
			СтрокаТЧ.ВсегоОФД		= СтрокаТЧXDTO.ВсегоОФД;
			////////////////////////////////////////////////////////////////////////
			
			//СтрокаТЧ.СуммаБезНДС	= СтрокаТЧ.Всего-СтрокаТЧ.СуммаНДС;		
			СтрокаТЧ.СтавкаНДС		= ЗагрузитьПер_СтавкаНДС(СтрокаТЧXDTO.СтавкаНДС);
			
			СтрокаТЧ.НомерЧекаККМ	= СтрокаТЧXDTO.НомерЧекаККМ;
			СтрокаТЧ.Менеджер		= Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТЧXDTO.Продавец));
			СтрокаТЧ.Акция			= Справочники.Акции.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТЧXDTO.Акция));
			СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧXDTO.ВсегоБезСкидки;
			
			СтрокаТЧ.Сумма			= СтрокаТЧ.Всего-СтрокаТЧ.НДС;
			
			СтрокаТЧ.Подразделение	= ДокОбъект.Подразделение;
			
			СтрокаТЧ.Скидка			= ПривестиСтрокуКЧислу(ПолучитьСвойствоХДТО(СтрокаТЧXDTO,"Скидка"));
			СтрокаТЧ.СуммаСкидкиПоКупону=СтрокаТЧXDTO.СуммаСкидкиПоКупону;
			//+ HELP-1709 20241024 Михайловский
			Попытка
				СтрокаТЧ.СуммаСкидкиЗаВидОплаты=СтрокаТЧXDTO.СуммаСкидкиЗаВидОплаты;
			Исключение				
			КонецПопытки;
			//- HELP-1709 20241024 Михайловский
			Попытка
				СтрокаТЧ.Контрагент	= Контрагент_ЧЛ;
			Исключение				
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	//Оплата платежными картами
	СуммаОплатыБН	= 0;
	ОплатаПК_ХДТО	= ОбъектХДТО.ОплатаПлатежнымиКартами;
	Если ОплатаПК_ХДТО<>Неопределено Тогда		
		Для Каждого СтрокаТЧ_ХДТО Из ОплатаПК_ХДТО.Строка Цикл
			Если СтрокаТЧ_ХДТО.СуммаОплаты>0 Тогда				
				СуммаОплатыБН = СуммаОплатыБН+СтрокаТЧ_ХДТО.СуммаОплаты;			
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли; 
	//+HELP-5235 20250905 Михайловский	
	СуммаОплатыБНПодели	= 0;
	ОплатаПД_ХДТО	= ОбъектХДТО.ОплатаБанковскимиКредитами;
	Если ОплатаПД_ХДТО<>Неопределено Тогда		
		Для Каждого СтрокаТЧ_ХДТО Из ОплатаПД_ХДТО.Строка Цикл
			Если СтрокаТЧ_ХДТО.СуммаОплаты > 0 Тогда				
				СуммаОплатыБНПодели = СуммаОплатыБНПодели + СтрокаТЧ_ХДТО.СуммаОплаты;
				//ДокОбъект.КонтрагентПодели  
				ДокОбъект.ПроцентКомиссииПодели = ПривестиСтрокуКЧислу(ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО, "ПроцентКомиссии"));
				ДокОбъект.КонтрагентПодели		= Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТЧ_ХДТО.Эквайрер));
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	//-HELP-5235 20250905 Михайловский	
	
	ДокОбъект.ПодарочныеСертификаты.Очистить();
	
	ОплатаСертификатамиХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"ОплатаСертификатами");
	//Малахов начало Очистка сертификатов при загрузке возвратных ОКС в базу SNL 
	//Если ОплатаСертификатамиХДТО<>Неопределено Тогда
	Если ОплатаСертификатамиХДТО<>Неопределено Тогда
	//Малахов конец
		Для Каждого СтрокаПС_ХДТО Из ОплатаСертификатамиХДТО.Строка Цикл
			СтрокаТЧ							= ДокОбъект.ПодарочныеСертификаты.Добавить();		
			
			СтрокаТЧ.Сертификат 				= ЗагрузитьСпр_ПодарочныеСертификаты_Элемент_КС(СтрокаПС_ХДТО.ДанныеСертификата,Отправитель);
			СтрокаТЧ.СуммаОплатыСертификатами   = СтрокаПС_ХДТО.Сумма;
			
			СтрокаТЧ.НомерЧекаККМ				= СтрокаПС_ХДТО.НомерЧекаККМ;
			СтрокаТЧ.СуммаЧека					= СтрокаПС_ХДТО.СуммаЧека;
			
			АвторЧекаХДТО						= ПолучитьСвойствоХДТО(СтрокаПС_ХДТО,"АвторЧека");
			Если АвторЧекаХДТО<>Неопределено Тогда			
				СтрокаТЧ.АвторЧека				= ЗагрузитьСпр_Пользователи_Элемент_КС(АвторЧекаХДТО);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Сертификат) Тогда
				РеквизитыСертификата	= ПолучитьРеквизитыШапки(СтрокаТЧ.Сертификат,"ВидСертификата,КодСертификата,ОкончаниеДействия,НомерЧекаПогашения,Номинал");			
				
				СтрокаТЧ.ВидСертификата		= РеквизитыСертификата.ВидСертификата;
				СтрокаТЧ.НомерСертификата	= Прав(СокрЛП(РеквизитыСертификата.КодСертификата),7);
				СтрокаТЧ.СрокДействия		= РеквизитыСертификата.ОкончаниеДействия;
				СтрокаТЧ.НомерЧека			= РеквизитыСертификата.НомерЧекаПогашения;
				СтрокаТЧ.Контрагент			= ДокОбъект.Подразделение.ЧастноеЛицо;
				СтрокаТЧ.Номинал			= РеквизитыСертификата.Номинал;
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;	
	
	СуммаОКС 		= ДокОбъект.Товары.Итог("Всего");
	СуммаОплатыСерт = ДокОбъект.ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");
	СуммаОплатыНал	= СуммаОКС-СуммаОплатыСерт-СуммаОплатыБН;
	
	ДокОбъект.СуммаОплатыБН		= СуммаОплатыБН; 
	//+HELP-5235 20250905 Михайловский
	ДокОбъект.СуммаОплатыБНПодели = СуммаОплатыБНПодели;
	//-HELP-5235 20250905 Михайловский
	ДокОбъект.ВидОплаты			=?(СуммаОплатыБН>0 ИЛИ СуммаОплатыБНПодели > 0, Перечисления.ВидыОплаты.БН, Перечисления.ВидыОплаты.НАЛ);	
	//По логике Крохина смешанная оплата должна быть с типом оплаты НАЛ 
	Если СуммаОплатыНал<>0 И (СуммаОплатыБН<>0 ИЛИ СуммаОплатыБНПодели<>0) Тогда
		ДокОбъект.ВидОплаты		= Перечисления.ВидыОплаты.БН; 				
	КонецЕсли;
	ДокОбъект.Номер				= СформироватьНомерОКС(ОбъектХДТО.КлючевыеСвойства.Номер,ДокОбъект.ВидОплаты);
	
	ДокОбъект.ПометкаУдаления	= ОбъектХДТО.ПометкаУдаления;
	ДокОбъект.Проведен			= ОбъектХДТО.Проведен;
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);
КонецФункции //ЗагрузитьДокумент_ОКС(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ОКС_ЕД_Возврат(ОбъектХДТО,Отправитель)
	Вид			= "ОтчетКассовойСмены";
	Менеджер	= Документы[Вид];	
	КодОперации	= Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
	
	КС_ХДТО		= ОбъектХДТО.КлючевыеСвойства;
	
	РезПоиска	= НайтиСоздатьОКС(КС_ХДТО.Дата,КС_ХДТО.Ссылка,КодОперации);	
	Если РезПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли;
	
	ДокОбъект				= РезПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ОтчетКассовойСмены.СоздатьДокумент();	
	КонецЕсли;
	
	ДокОбъект.Дата			= КС_ХДТО.Дата-1;
	ДокОбъект.Номер			= КС_ХДТО.Номер;
	
	ДокОбъект.КодОперации	= КодОперации;
	
	ДокОбъект.Организация	= ЗагрузитьСпр_Организации_КС(КС_ХДТО.Организация);	
	
	ДокОбъект.Автор			= ЗагрузитьСпр_Пользователи_Элемент_КС(ОбъектХДТО.Ответственный);	
	
	ДокОбъект.СуммаДокумента= ОбъектХДТО.Сумма;	
	ДокОбъект.Валюта		= ЗагрузитьСпр_Валюты_КС(ОбъектХДТО.Валюта);
	ДокОбъект.Склад			= ЗагрузитьСпр_Склады_Элемент_КС(ОбъектХДТО.Склад);
	ДокОбъект.Касса			= ЗагрузитьСпр_Кассы_Элемент_КС(ОбъектХДТО.КассаККМ);
	
	ДокОбъект.Подразделение	= ЗагрузитьСпр_Подразделения_Элемент_КС(ОбъектХДТО.Подразделение);
	Контрагент_ЧЛ			= ПолучитьРеквизитШапки(ДокОбъект.Подразделение,"ЧастноеЛицо","Справочник");
	
	СуммаВключаетНДС		= ОбъектХДТО.СуммаВключаетНДС;	
	
	ДокОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТЧXDTO Из ОбъектХДТО.ТоварыВозвратПродажи.Строка Цикл
		СтрокаТЧ				= ДокОбъект.Товары.Добавить();
		
		ДанныеНоменклатуры		= ДанныеНоменклатуры(СтрокаТЧXDTO);
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ДанныеНоменклатуры);			
		
		СтрокаТЧ.Количество		= СтрокаТЧXDTO.Количество;			
		СтрокаТЧ.Коэффициент	= 1;	
		СтрокаТЧ.Цена			= СтрокаТЧXDTO.Цена;
		
		СтрокаТЧ.НДС			= СтрокаТЧXDTO.СуммаНДС;
		СтрокаТЧ.Всего			= СтрокаТЧXDTO.Сумма+?(СуммаВключаетНДС,0,СтрокаТЧ.СуммаНДС);
		//СтрокаТЧ.СуммаБезНДС	= СтрокаТЧ.Всего-СтрокаТЧ.СуммаНДС;		
		СтрокаТЧ.СтавкаНДС		= ЗагрузитьПер_СтавкаНДС(СтрокаТЧXDTO.СтавкаНДС);
		
		СтрокаТЧ.НомерЧекаККМ	= СтрокаТЧXDTO.НомерЧекаККМПродажи;
		
		СтрокаТЧ.Сумма			= СтрокаТЧ.Всего-СтрокаТЧ.НДС;
		Попытка
			СтрокаТЧ.Контрагент		= Контрагент_ЧЛ;
		Исключение				
		КонецПопытки;
	КонецЦикла;	

	//Оплата платежными картами
	СуммаОплатыБН	= 0;
	ОплатаПК_ХДТО	= ОбъектХДТО.ОплатаПлатежнымиКартами;
	Если ОплатаПК_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ОплатаПК_ХДТО.Строка Цикл
			Если СтрокаТЧ_ХДТО.СуммаОплаты<0 Тогда								
				СуммаОплатыБН	= СуммаОплатыБН-СтрокаТЧ_ХДТО.СуммаОплаты;			
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	СуммаОплатыБНПодели	= 0;
	ОплатаПД_ХДТО	= ОбъектХДТО.ОплатаБанковскимиКредитами;
	Если ОплатаПД_ХДТО<>Неопределено Тогда		
		Для Каждого СтрокаТЧ_ХДТО Из ОплатаПД_ХДТО.Строка Цикл
			Если СтрокаТЧ_ХДТО.СуммаОплаты < 0 Тогда				
				СуммаОплатыБНПодели = СуммаОплатыБНПодели - СтрокаТЧ_ХДТО.СуммаОплаты;
				//ДокОбъект.КонтрагентПодели
				ДокОбъект.ПроцентКомиссииПодели = ПривестиСтрокуКЧислу(ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО, "ПроцентКомиссии"));
				ДокОбъект.КонтрагентПодели		= Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТЧ_ХДТО.Эквайрер));
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	ОплатаСертификатамиХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"ОплатаСертификатами");
	Если ОплатаСертификатамиХДТО<>Неопределено Тогда
		ДокОбъект.ПодарочныеСертификаты.Очистить();
		
		//Для Каждого СтрокаПС_ХДТО Из ОплатаСертификатамиХДТО.Строка Цикл
		//	СтрокаТЧ							= ДокОбъект.ПодарочныеСертификаты.Добавить();		
		//	
		//	СтрокаТЧ.Сертификат 				= ЗагрузитьСпр_ПодарочныеСертификаты_Элемент_КС(СтрокаПС_ХДТО.ДанныеСертификата,Отправитель);
		//	СтрокаТЧ.СуммаОплатыСертификатами   = СтрокаПС_ХДТО.Сумма;
		//	
		//	СтрокаТЧ.НомерЧекаККМ				= СтрокаПС_ХДТО.НомерЧекаККМ;
		//	СтрокаТЧ.СуммаЧека					= СтрокаПС_ХДТО.СуммаЧека;
		//	СтрокаТЧ.АвторЧека					= ЗагрузитьСпр_Пользователи_Элемент_КС(СтрокаПС_ХДТО.АвторЧека);
		//КонецЦикла; 
	КонецЕсли;	
	
	//ДокОбъект.ПодарочныеСертификаты.Очистить();	
	
	СуммаОКС 		= ДокОбъект.Товары.Итог("Всего");
	СуммаОплатыСерт = ДокОбъект.ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");
	СуммаОплатыНал	= СуммаОКС-СуммаОплатыСерт-СуммаОплатыБН;	
	
	ДокОбъект.СуммаОплатыБН		= СуммаОплатыБН;
	ДокОбъект.СуммаОплатыБНПодели = СуммаОплатыБНПодели;
	ДокОбъект.ВидОплаты			=?(СуммаОплатыБН>0 ИЛИ СуммаОплатыБНПодели > 0, Перечисления.ВидыОплаты.БН, Перечисления.ВидыОплаты.НАЛ);	
	//По логике Крохина смешанная оплата должна быть с типом оплаты НАЛ 
	Если СуммаОплатыНал<>0 И (СуммаОплатыБН<>0 ИЛИ СуммаОплатыБНПодели<>0) Тогда
		ДокОбъект.ВидОплаты		= Перечисления.ВидыОплаты.БН; 				
	КонецЕсли;
	ДокОбъект.Номер				= СформироватьНомерОКС(ОбъектХДТО.КлючевыеСвойства.Номер,ДокОбъект.ВидОплаты);	
	
	ДокОбъект.ПометкаУдаления	= ОбъектХДТО.ПометкаУдаления;
	ДокОбъект.Проведен			= ОбъектХДТО.Проведен;
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезПоиска.Найден);
КонецФункции //ЗагрузитьДокумент_ОКС(ОбъектХДТО,Отправитель)

Функция СформироватьНомерОКС(ИсходныйНомер,ВидОплаты)
	ДлиннаНомера= Метаданные.Документы.ОтчетКассовойСмены.ДлинаНомера;
	ПоляНомера	= ФР_ОбщегоНазначения_КС.СтрокуВСтруктуру(ИсходныйНомер,"Префикс,Номер","-");
	
	НовНомер	= ПоляНомера.Префикс+?(ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн")+"-";
	
	Возврат НовНомер+Прав(ИсходныйНомер,ДлиннаНомера-СтрДлина(НовНомер));	
КонецФункции //СформироватьНомерОКС()
 
Функция НайтиСоздатьОКС(Дата,Ссылка,КодОперации)
	ПолноеИмяТипа	= Метаданные.Документы.ОтчетКассовойСмены.ПолноеИмя();
	Результат		= Новый Структура("Найден,Ссылка,Объект,ПолноеИмяТипа",
		Ложь,Документы.ОтчетКассовойСмены.ПустаяСсылка(),Неопределено,ПолноеИмяТипа);
	
	Комментарий	= "#ОКС ФР "+КодОперации+" "+Ссылка;
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.ОтчетКассовойСмены	
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Дата,Год)			= &Дата_Год
	|	И ПОДСТРОКА(Комментарий,1,200)	= &Комментарий
	|УПОРЯДОЧИТЬ ПО ПометкаУдаления
	|";	
	
	Запрос.УстановитьПараметр("Дата_Год",	НачалоГода(Дата));
	Запрос.УстановитьПараметр("Комментарий",Комментарий);	
	
	ДокОбъект	= Неопределено;
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат.Найден	= Истина;		
		Результат.Ссылка		= Выборка.Ссылка;
		Если фПерезаписыватьДокументы Тогда
			ДокОбъект	= Выборка.Ссылка.ПолучитьОбъект();				
		КонецЕсли; 
	Иначе
		ДокОбъект				= Документы.ОтчетКассовойСмены.СоздатьДокумент();	
		ДокОбъект.Комментарий	= Комментарий;		
	КонецЕсли; 
	
	Результат.Объект = ДокОбъект;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьОКС()

Функция ЗагрузитьДок_ОПР_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ОприходованиеТМЦ;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект = РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ОприходованиеТМЦ.СоздатьДокумент();	
	КонецЕсли;
	
	ИменаТЧ	= "Товары";
	ЗаполнитьЗначенияСвойств(ДокОбъект, ОбъектХДТО ,, ИменаТЧ);
	
	ДокОбъект.КодОперации 			= ЗагрузитьПер("КодыОперацийОстатки", ОбъектХДТО.КодОперации, Перечисления.КодыОперацийОстатки.Оприходование);	
	ДокОбъект.СостояниеНакладной	= Перечисления.СостоянияНакладной[ОбъектХДТО.СостояниеНакладной];
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());	
			
			СтрокаТЧ.Единица		= Ед_Штука;
			СтрокаТЧ.Коэффициент	= 1;
		КонецЦикла;
	КонецЕсли;
	
	ЗагрузитьРеквизитыСМультиТипами(ДокОбъект,ОбъектХДТО,"ДокОснование");
	
	ДокОбъект.ИБ = ИБ_SSP;
	//+ ASU-1025, ASU-946 20241220 Михайловский
	ТЧ_Сертификаты_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"Сертификаты");
	Если ТЧ_Сертификаты_ХДТО<>Неопределено И ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
		ЗагрузитьХПС(ДокОбъект,ТЧ_Сертификаты_ХДТО,Отправитель);	
	КонецЕсли;
	//- ASU-1025, ASU-946 20241220 Михайловский
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ОПР_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ПКО(ОбъектХДТО,Отправитель)
	Вид			= "ПриходныйКассовыйОрдер";	
	Менеджер	= Документы[Вид];
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
	
	//Если Сокрлп(ОбъектХДТО.ВидОперации) = "ВозвратОтПодотчетногоЛица" Тогда
	//	ДокОбъект.ВидОперации	= Перечисления.ВидыОперацийПКО.ВозвратАвансовыйОтчет;
	//Иначе
		ДокОбъект.ВидОперации	= ЗагрузитьПер("ВидыОперацийПКО",ОбъектХДТО.ВидОперации);  // "ВозвратОтПодотчетногоЛица"
	//КонецЕсли;
	
	ЗагрузитьРеквизитыСМультиТипами(ДокОбъект,ОбъектХДТО,"Контрагент,ДокОснование");
	
	ДокОбъект.ИБ	= ФР_ОбщегоНазначения_ПИ.ТекущаяИБ();
		
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);
КонецФункции //ЗагрузитьДок_ПКО(ОбъектХДТО,Отправитель)

//+HELP-3414 HELP-3399 20250314 Михайловский
Функция ЭтоПРМКассаСНЛ(Склад, СкладПолучатель, ДокНом)
	Рез = Ложь;
	Запр = Новый Запрос;
	Запр.Текст = 
	"ВЫБРАТЬ
	|	Кассы.РозничныйСклад КАК РозничныйСклад
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.ПодразделениеДляУчета = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|";
	Выб = Запр.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		//Если Выб.РозничныйСклад = Склад ИЛИ Выб.РозничныйСклад = СкладПолучатель Тогда
		Если Выб.РозничныйСклад = СкладПолучатель Тогда
			Рез = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	//Если Рез И НЕ Лев(ДокНом, 3) = "SNM" Тогда
	//	Рез = Ложь;
	//КонецЕсли;
	Возврат Рез;
КонецФункции
//-HELP-3414 HELP-3399 20250314 Михайловский

Функция ЗагрузитьДок_ПРМ(ОбъектХДТО,Отправитель)
	Менеджер	= Документы.Перемещение;
	Вид			= Метаданные.НайтиПоТипу(ТипЗнч(Менеджер.ПустаяСсылка())).Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	//+Корр обм 20260205 Михайловский
	ДокОбъект.ОбменДанными.Отправитель	= Отправитель;
	//-Корр обм 20260205 Михайловский
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);	
	ДокОбъект.СостояниеНакладной			= ЗагрузитьПер("СостоянияНакладной", ОбъектХДТО.СостояниеНакладной, Перечисления.СостоянияНакладной.ВРаботе);
	ДокОбъект.СостояниеНакладнойУПолучателя = ЗагрузитьПер("СостоянияНакладной", ОбъектХДТО.СостояниеНакладнойУПолучателя, Перечисления.СостоянияНакладной.ВРаботе);
	
	//+HELP-3414 HELP-3399 20250314 Михайловский
	ЭтоОтвКассаСНЛ = РезультатПоиска.Найден И ЭтоПРМКассаСНЛ(ДокОбъект.Склад, ДокОбъект.СкладПолучатель, ДокОбъект.Номер);  
	Если НЕ ЭтоОтвКассаСНЛ Тогда
	//-HELP-3414 HELP-3399 20250314 Михайловский
		//+HELP-7543 20251023 Михайловский
		//ПровПодтвЗаяв = ?((ДокОбъект.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.ВРаботе) И (ДокОбъект.Склад.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ) И (ДокОбъект.СкладПолучатель.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ), Истина, Ложь);
		//+20260114 Кривые ПРМ Михайловский
		//ПровПодтвЗаяв = ?((ДокОбъект.Склад.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ) И (ДокОбъект.СкладПолучатель.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ), Истина, Ложь);
		ПровПодтвЗаяв = ?((ДокОбъект.Склад.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ) ИЛИ (ДокОбъект.СкладПолучатель.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ), Истина, Ложь);
        //-20260114 Кривые ПРМ Михайловский
		//-HELP-7543 20251023 Михайловский
		ЗагрузитьТЧОбъекта(ДокОбъект,ОбъектХДТО,"Товары");
		//+HELP-7543 20251023 Михайловский
		ПровПодтвЗаяв1 = ?(ДокОбъект.Товары.Итог("ПодтвержденнаяЗаявка") = 0, Истина, Ложь);
		//-HELP-7543 20251023 Михайловский
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			//+HELP-7543 20251023 Михайловский
			Если ПровПодтвЗаяв И ПровПодтвЗаяв1 Тогда
				Если НЕ (СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаТЧ.Заявка) И (СтрокаТЧ.ПодтвержденнаяЗаявка = 0) Тогда
					СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаТЧ.Заявка;
				КонецЕсли;
				Если (СтрокаТЧ.ПодтвержденнаяЗаявка < СтрокаТЧ.Количество) Тогда
					СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаТЧ.Количество;
				КонецЕсли;
			КонецЕсли;	
			//-HELP-7543 20251023 Михайловский
			СтрокаТЧ.ПодтвержденнаяЗаявкаПеремещения 	= СтрокаТЧ.ПодтвержденнаяЗаявка;	
			СтрокаТЧ.ЦенаБезСкидки						= СтрокаТЧ.Цена;
			СтрокаТЧ.ВсегоБезСкидки						= СтрокаТЧ.Всего;
			ЗаполнитьСтавкуНДСТабЧасти(СтрокаТЧ, ДокОбъект);		
		КонецЦикла;	
	КонецЕсли;

	Если ДокОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		ДокОбъект.Отгружен  = Перечисления.Отгружен.Отгружен;
	Иначе
		ДокОбъект.Отгружен  = Перечисления.Отгружен.Резерв;			
	КонецЕсли;
	
	ДокОбъект.ПунктДоставки	= ПолучитьПунктДоставки(ДокОбъект.СкладПолучатель);	
	ДокОбъект.ИБ			= ФР_ОбщегоНазначения_ПИ.ТекущаяИБ();
	ДокОбъект.Валюта 		= ВалютаНац;	
	ДокОбъект.Курс			= ПолучитьКурсВалюты(ДокОбъект.Валюта, ДокОбъект.Дата).Курс;
	
	Описание				= "";
	ЕстьРассогласования		= Ложь;
	ОтправитьОбратно		= Ложь;	
	
	Если 1=2 Тогда
		ДокОбъект=Документы.Перемещение.СоздатьДокумент();	
	КонецЕсли; 
	
	ОтправительДляЕЕ	= ОтправительПеремещенияДляЦО_ЕЕ(ДокОбъект.Склад,ДокОбъект.СкладПолучатель,ДокОбъект.СостояниеНакладнойУПолучателя);
	
	ЭтотУзел			= ФР_ОбщегоНазначения_ПИ.ЭтотУзел("Основной").ПолучитьОбъект();
	ВариантЗагрузки		= ЭтотУзел.ПолучитьВариантЗагрузки(ДокОбъект,"Документ",ОтправительДляЕЕ,Описание);
	
	Если ВариантЗагрузки="Полная" Тогда
		ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);
	ИначеЕсли ВариантЗагрузки="Частичная" Тогда
		//+ASU-824 20260316 Михайловский
		Если НЕ ОбщегоНазначения_ПИ.КонтрольДатыЗапрета_ПИ(ДокОбъект.Метаданные().Имя, ДокОбъект.Дата) Тогда
			//-ASU-824 20260316 Михайловский
			ДобавитьОбъектВПротоколОбмена(ДокОбъект,"","Пропущен", "Объект находится за границей редактирования.");
		Иначе
			Записан = ЭтотУзел.ЗаписатьВозможныеДанныеВБазу(ДокОбъект,"Документ",ОтправительДляЕЕ,Описание,НЕ РезультатПоиска.Найден,ЕстьРассогласования,ОтправитьОбратно);
			Если Записан Тогда
				//+HELP-8861 20260316 Михайловский
				Если НЕ ЭтоОтвКассаСНЛ Тогда
					ПровПодтвЗаяв = ?((ДокОбъект.Склад.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ) ИЛИ (ДокОбъект.СкладПолучатель.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ), Истина, Ложь);
					ПровПодтвЗаяв1 = ?(ДокОбъект.Товары.Итог("ПодтвержденнаяЗаявка") = 0, Истина, Ложь);
					Если ПровПодтвЗаяв И ПровПодтвЗаяв1 Тогда
						Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
							
							Если НЕ (СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаТЧ.Заявка) И (СтрокаТЧ.ПодтвержденнаяЗаявка = 0) Тогда
								СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаТЧ.Заявка;
								СтрокаТЧ.ПодтвержденнаяЗаявкаПеремещения 	= СтрокаТЧ.ПодтвержденнаяЗаявка;
							КонецЕсли;
							
						КонецЦикла;	
						ДокОбъект.Записать();
					КонецЕсли;
				КонецЕсли;
				//-HELP-8861 20260316 Михайловский
				Статус			= "Записан";
				СтатусЗаписи    = ?(РезультатПоиска.Найден,"Перезапись","Новый");		
				
				Если ДокОбъект.Проведен Тогда			
					Статус			= "Проведен";			
				КонецЕсли;		
				ДобавитьОбъектВПротоколОбмена(ДокОбъект,СтатусЗаписи,Статус);		
			Иначе
				ДобавитьОбъектВПротоколОбмена(ДокОбъект,"","Пропущен",Описание);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДобавитьОбъектВПротоколОбмена(ДокОбъект,"","Пропущен",Описание);		
	КонецЕсли;	
	
	ТЧ_Сертификаты_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"Сертификаты");
	Если ТЧ_Сертификаты_ХДТО<>Неопределено И ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
		ЗагрузитьХПС(ДокОбъект,ТЧ_Сертификаты_ХДТО,ОтправительДляЕЕ);	
	КонецЕсли;
	
	//+HELP-3182 20250313 Михайловский
	Если ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
		ПроверитьХКМ(ДокОбъект.Ссылка);	
	КонецЕсли;
	//-HELP-3182 20250313 Михайловский
	
КонецФункции //ЗагрузитьДок_ПРМ(ОбъектХДТО,Отправитель)

// Феданченков М.С. 06.07.2026 начало
//Проблема 0000000187
Функция ЗагрузитьДок_ПНК_ИзФР(ОбъектХДТО, Отправитель)
	
	Если ОбъектХДТО = Неопределено ИЛИ Отправитель = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СостояниеПНК = ОбъектХДТО.СостояниеНакладной; 
	
	Если СостояниеПНК <> "Принята" ИЛИ ОбъектХДТО.ВидВходящегоДокумента <> "ПРМ" Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Вид = "Перемещение";
	
	УИД = ОбъектХДТО.Ссылка.УникальныйИдентификатор();
	Ссылка = Документы.Перемещение.ПолучитьСсылку(УИД);
		
	ДокОбъект = Ссылка.ПолучитьОбъект();
	Если ДокОбъект = Неопределено Тогда
		СтрокаТО = ОбъектыОбмена.Добавить();
		СтрокаТО.ОбъектТип = Вид;
		СтрокаТО.Ошибки = "ПРМ не найден по ссылке: " + УИД;
		СтрокаТО.Действие = "Ошибка";
		СтрокаТО.СтатусЗаписи = "ОшибкаЗагрузки";
		Возврат Неопределено;
	КонецЕсли;
	
	ДокОбъект.ОбменДанными.Отправитель = Отправитель;
	
	НоваяДатаПриемки = ОбъектХДТО.Дата;
	НовыйСтатусПРМ = Перечисления.СостоянияНакладной.Принята;
	
	ДатаИзменилась = (ДокОбъект.ДатаПриемки <> НоваяДатаПриемки) И ЗначениеЗаполнено(НоваяДатаПриемки);
	СтатусИзменился = Ложь;
	
	Если СостояниеПНК = "Принята" И ДокОбъект.СостояниеНакладнойУПолучателя <> НовыйСтатусПРМ Тогда
		СтатусИзменился = Истина;
	КонецЕсли;
	
	Если СтатусИзменился ИЛИ ДатаИзменилась Тогда 
		
		ДокОбъект.СостояниеНакладнойУПолучателя = НовыйСтатусПРМ;
		ДокОбъект.ДатаПриемки = НоваяДатаПриемки;     
		
		Попытка
			ДокОбъект.ДополнительныеСвойства.Вставить("НеРегистрировать", Истина);
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			// Обработка ошибок перепроведения
			ОписаниеОшибки = ОписаниеОшибки();
			
			// Записываем в протокол обмена
			СтрокаТО = ОбъектыОбмена.Добавить();
			СтрокаТО.ОбъектТип = "Документ.Перемещение";
			СтрокаТО.ОбъектСсылкаУИД = ДокОбъект.Ссылка.УникальныйИдентификатор();
			СтрокаТО.Ошибки = "Ошибка при обновлении ПРМ " + ДокОбъект.Ссылка + ": " + ОписаниеОшибки;
			СтрокаТО.Действие = "Ошибка";
			СтрокаТО.СтатусЗаписи = "";
			
			Возврат Неопределено;
		КонецПопытки;  
		
	КонецЕсли;  
	
	Возврат ДокОбъект.Ссылка;
	
КонецФункции
// Феданченков М.С. 06.07.2026 конец

//+HELP-3182 20250313 Михайловский
Процедура ПроверитьХКМ(ДокСсылка);	
	Попытка
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|ГДЕ
		|	ХранилищеКодовМаркировки.ДокОснование = &ДокСсылка";
		Запр.УстановитьПараметр("ДокСсылка", ДокСсылка);
		Выб = Запр.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Если НЕ ДокСсылка.ТребуетсяМаркировка Тогда
				ДокОб = ДокСсылка.ПолучитьОбъект();
				Если НЕ ДокОб = Неопределено Тогда
					ДокОб.ТребуетсяМаркировка = Истина;
					ДокОб.Записать();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры //-HELP-3182 20250313 Михайловский

//+HELP-2306 20250220 Михайловский
Функция ЗагрузитьДок_ПСАЗ(ОбъектХДТО,Отправитель)
	Менеджер	= Документы.ЗаявкаНаПостСторонАссорт;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);	
	//Если РезПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли;
	Если РезПоиска.Найден Тогда Возврат Неопределено КонецЕсли;
	ДокОбъект				= РезПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.ЗаявкаНаПостСторонАссорт.СоздатьДокумент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, ОбъектХДТО);
	ДокОбъект.Состояние = ЗагрузитьПер("СостоянияЗаявкиНаСторонПост",ОбъектХДТО.Состояние);
	ДокОбъект.Подразделение = Справочники.Подразделения.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(ОбъектХДТО.Подразделение)));
	//Строка.ВидДокумента = Справочники.НМТ_ВидыДокументов.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.ComplianceDocumentTax.TypeDoc.UID));
	//ДокОбъект.СостояниеНакладной			= ЗагрузитьПер("СостоянияНакладной",ОбъектХДТО.СостояниеНакладной);
	
	//ЗаполнитьТЧпоХДТО(ДокОбъект.ИменаКолонок,	ОбъектХДТО.ИменаКолонок);
	//ЗаполнитьТЧпоХДТО(ДокОбъект.ЗначенияКолонок,	ОбъектХДТО.ЗначенияКолонок);
	//ЗаполнитьТЧпоХДТО(ДокОбъект.Товары,							ОбъектХДТО.Товары);
	//ЗаполнитьТЧпоХДТО(ДокОбъект.Брэнды,						ОбъектХДТО.Брэнды);
	//ЗаполнитьТЧпоХДТО(ДокОбъект.ВидыНоменклатуры,			ОбъектХДТО.ВидыНоменклатуры);
	//ЗаполнитьТЧпоХДТО(ДокОбъект.Цвета,							ОбъектХДТО.Цвета);
	//ЗаполнитьТЧпоХДТО(ДокОбъект.Размеры,					ОбъектХДТО.Размеры);
	ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "ИменаКолонок,ЗначенияКолонок,Товары,Брэнды,ВидыНоменклатуры,Цвета,Размеры,Коллекции");
	//ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "ЗначенияКолонок");
	//ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "Товары");
	//ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "Брэнды");
	//ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "ВидыНоменклатуры");
	//ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "Цвета");
	//ЗагрузитьТЧОбъектаСторАс(ДокОбъект, ОбъектХДТО, "Размеры");
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезПоиска.Найден);
КонецФункции  

Функция ЗагрузитьТЧОбъектаСторАс(Объект,ОбъектХДТО,ИменаТЧ,ДопПараметы=Неопределено)
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл		
		текДопПараметры	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметы,ИмяТЧ);
		СоотвРеквизитов	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(текДопПараметры,"СоответствиеРеквизитов",Новый Структура);
		
		ТЧ_Объекта	= Объект[ИмяТЧ];
		
		МетаТЧ		= Объект.Метаданные().ТабличныеЧасти[ИмяТЧ];
		ЕстьЕдиница	= (МетаТЧ.Реквизиты.Найти("Единица")<>Неопределено); 
		
		ТЧ_Объекта.Очистить();
		ТЧ_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,ИмяТЧ);
		Если ТЧ_ХДТО<>Неопределено Тогда
			Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
				СтрокаТЧ	= ТЧ_Объекта.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);
				Если ИмяТЧ = "Товары" Тогда
					Харка_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"ХарактеристикаНоменклатуры");
					Ном_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"Номенклатура");
					СтрокаТЧ.ХарактеристикаНоменклатуры = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(Харка_ХДТО)));
					СтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(Ном_ХДТО)));
				ИначеЕсли ИмяТЧ = "Брэнды" Тогда
					УИД_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"УИД");
					Если НЕ УИД_ХДТО = "00000000-0000-0000-0000-000000000000" И НЕ ПустаяСтрока(УИД_ХДТО) Тогда
						СтрокаТЧ.Брэнд = Справочники.ФР_Бренды.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(УИД_ХДТО)));
					КонецЕсли;
				ИначеЕсли ИмяТЧ = "ВидыНоменклатуры" Тогда
					УИД_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"УИД");
					Если НЕ УИД_ХДТО = "00000000-0000-0000-0000-000000000000" И НЕ ПустаяСтрока(УИД_ХДТО) Тогда
						СтрокаТЧ.ВидНоменклатуры = Справочники.ФР_ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(УИД_ХДТО)));
					КонецЕсли;
				ИначеЕсли ИмяТЧ = "Коллекции" Тогда
					УИД_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"УИД");
					Если НЕ УИД_ХДТО = "00000000-0000-0000-0000-000000000000" И НЕ ПустаяСтрока(УИД_ХДТО) Тогда
						СтрокаТЧ.Коллекция = Справочники.ФР_Коллекции.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(УИД_ХДТО)));
					КонецЕсли;
				ИначеЕсли ИмяТЧ = "Цвета" Тогда
					УИД_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"УИД");
					Если НЕ УИД_ХДТО = "00000000-0000-0000-0000-000000000000" И НЕ ПустаяСтрока(УИД_ХДТО) Тогда
						СтрокаТЧ.Цвет = Справочники.Цвета.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(УИД_ХДТО)));
					КонецЕсли;
				ИначеЕсли ИмяТЧ = "Размеры" Тогда
					УИД_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"УИД");
					Если НЕ УИД_ХДТО = "00000000-0000-0000-0000-000000000000" И НЕ ПустаяСтрока(УИД_ХДТО) Тогда
						СтрокаТЧ.Размер = Справочники.Размеры.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(УИД_ХДТО)));
					КонецЕсли;
				КонецЕсли;	
				//Харка_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"ХарактеристикаНоменклатуры");
				//Если Харка_ХДТО<>Неопределено И Харка_ХДТО<>Справочники.Номенклатура.ПустаяСсылка() Тогда
				//	СтрокаТЧ.Номенклатура	= Харка_ХДТО;
				//КонецЕсли;
				//Если ЕстьЕдиница Тогда
				//	СтрокаТЧ.Единица	= ЕдиницаШт(СтрокаТЧ.Номенклатура);				
				//КонецЕсли; 
				//Для Каждого Элемент Из СоотвРеквизитов Цикл
				//	СтрокаТЧ[Элемент.Ключ]	= СтрокаТЧ_ХДТО[Элемент.Значение];
				//КонецЦикла;
			КонецЦикла; 			
		КонецЕсли;
	КонецЦикла;
КонецФункции //-HELP-2306 20250220 Михайловский

Функция ЗагрузитьДок_МКО(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.МаркировкаОстатковТЦ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
	
	ДокОбъект.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(ОбъектХДТО.Организация)));
	ДокОбъект.Подразделение = Справочники.Подразделения.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(ОбъектХДТО.Подразделение)));	
	ИменаТЧ	= "Товары";
	
	ЗагрузитьТЧОбъектаМКО(ДокОбъект, ОбъектХДТО, ИменаТЧ);
	
	//ЗагрузитьРеквизитыСМультиТипами(ДокОбъект, ОбъектХДТО, "ДокОснование,Отправитель,Получатель");
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
	
	
КонецФункции

//+SNL-203 20260515 Михайловский

Функция ЗагрузитьТЧОбъекта1(Объект,ОбъектХДТО,ИменаТЧ,ДопПараметы = Неопределено)
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл
		текДопПараметры		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметы,ИмяТЧ);
		СоотвРеквизитов		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(текДопПараметры,"СоответствиеРеквизитов",	Новый Структура);
		ЗначенияПоУмолчанию = ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(текДопПараметры,"ЗначенияПоУмолчанию",		Новый Структура);
		
		ТЧ_Объекта	= Объект[ИмяТЧ];
		ТЧ_Объекта.Очистить();
		ТЧ_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,ИмяТЧ);
		Ед_Штука					= Справочники.ОКЕИ.НайтиПоКоду("796");
		Если ТЧ_ХДТО<>Неопределено Тогда
			Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
				СтрокаТЧ	= ТЧ_Объекта.Добавить();
								
				Попытка
					Если ИмяТЧ = "Товары" Тогда
						ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО, ,"СтавкаНДС,Единица");
						СтрокаТЧ.СтавкаНДС = ЗагрузитьПер_СтавкаНДС(СтрокаТЧ_ХДТО.СтавкаНДС); 
						СтрокаТЧ.Единица = Ед_Штука;
					Иначе
						ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО); 
					КонецЕсли;	
				Исключение
				КонецПопытки;	
				
				//Если Прав(ИмяТипаХДТО, 6) = "Товары" Тогда
				//	ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаТЧ, ,"СтавкаНДС");  
				//	
				//	Попытка
				//		УстановитьСвойствоХДТО(СтрокаТЧ_ХДТО, "СтавкаНДС", ВыгрузитьПер_СтавкаНДС(ВыборкаТЧ.СтавкаНДС));
				//	Исключение
				//	КонецПопытки;
				//Иначе
				//	ЗаполнитьЗначенияСвойств(СтрокаТЧ_ХДТО,ВыборкаТЧ);
				//КонецЕсли;
				
				Для Каждого Элемент Из СоотвРеквизитов Цикл
					СтрокаТЧ[Элемент.Ключ]	= СтрокаТЧ_ХДТО[Элемент.Значение];
				КонецЦикла; 
				Для Каждого Элемент Из ЗначенияПоУмолчанию Цикл				
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ[Элемент.Ключ]) Тогда
						СтрокаТЧ[Элемент.Ключ]	= Элемент.Значение;
					КонецЕсли;
				КонецЦикла; 
			КонецЦикла; 			
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ЗагрузитьДок_ЗаказИМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.ЗаказИМ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок,ШтрихкодыУпаковокВозврат,Возвраты";
	
	ЗагрузитьТЧОбъекта1(ДокОбъект, ОбъектХДТО, ИменаТЧ);
	ДокОбъект.Статус = ЗагрузитьПер("СтатусЗаказаИМ",ОбъектХДТО.Статус);
	ДокОбъект.УсловияОплаты= ЗагрузитьПер("УсловияОплаты",ОбъектХДТО.УсловияОплаты);
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
КонецФункции

Функция ЗагрузитьДок_ВозвратИМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.ВозвратИМ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	
	ЗагрузитьТЧОбъекта1(ДокОбъект, ОбъектХДТО, ИменаТЧ);
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
КонецФункции

Функция ЗагрузитьДок_Возврат1ИМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.Возврат1ИМ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	
	ЗагрузитьТЧОбъекта1(ДокОбъект, ОбъектХДТО, ИменаТЧ);
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
КонецФункции

Функция ЗагрузитьДок_ВыкупИМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.ВыкупИМ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	
	ЗагрузитьТЧОбъекта1(ДокОбъект, ОбъектХДТО, ИменаТЧ);
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
КонецФункции

Функция ЗагрузитьДок_ОплатаИМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.ОплатаИМ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
КонецФункции

Функция ЗагрузитьДок_ВозвратОплатыИМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.ВозвратОплатыИМ;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
КонецФункции
//-SNL-203 20260515 Михайловский

Функция ЗагрузитьТЧОбъектаМКО(Объект,ОбъектХДТО,ИменаТЧ,ДопПараметы=Неопределено)
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл		
		текДопПараметры	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметы,ИмяТЧ);
		СоотвРеквизитов	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(текДопПараметры,"СоответствиеРеквизитов",Новый Структура);
		
		ТЧ_Объекта	= Объект[ИмяТЧ];
		
		МетаТЧ		= Объект.Метаданные().ТабличныеЧасти[ИмяТЧ];
		ЕстьЕдиница	= (МетаТЧ.Реквизиты.Найти("Единица")<>Неопределено); 
		
		ТЧ_Объекта.Очистить();
		ТЧ_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,ИмяТЧ);
		Если ТЧ_ХДТО<>Неопределено Тогда
			Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
				СтрокаТЧ	= ТЧ_Объекта.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);
				
				Если ИмяТЧ = "Товары" Тогда
					Харка_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"ХарактеристикаНоменклатуры");
					Ном_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"Номенклатура");
					СтрокаТЧ.ХарактеристикаНоменклатуры = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(Харка_ХДТО)));
					СтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(XMLСтрока(Ном_ХДТО)));
				КонецЕсли;
			КонецЦикла; 			
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ЗагрузитьХПС(ДокОбъект,ТЧ_Сертификаты_ХДТО,Отправитель)
	Найден 		= Ложь;
	ХПС_Ссылка	= НайтиДокумент("ХранилищеПодарочныхСертификатов",Новый Структура("ДокОбъект",ДокОбъект.Ссылка));
	Если ЗначениеЗаполнено(ХПС_Ссылка) Тогда
		ХПС_Объект	= ХПС_Ссылка.ПолучитьОбъект();
		Найден		= Истина;
	Иначе		
		Если ТЧ_Сертификаты_ХДТО.Строка.Количество()=0 Тогда
			Возврат Неопределено; //Пустая ТЧ Сертификаты 
		Иначе			
			ХПС_Объект = Документы.ХранилищеПодарочныхСертификатов.СоздатьДокумент();
		КонецЕсли;		
	КонецЕсли;
	
	ХПС_Объект.Дата			= ДокОбъект.Дата;
	ХПС_Объект.ДокОбъект 	= ДокОбъект.Ссылка;
	//+ ASU-1025, ASU-946 20241220 Михайловский
	//вместо
	//ХПС_Объект.Склад 		= ДокОбъект.Склад;
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.ОприходованиеТМЦ") Тогда
		ХПС_Объект.СкладПолучатель 	= ДокОбъект.Склад;
	Иначе
		ХПС_Объект.Склад 		= ДокОбъект.Склад;
	КонецЕсли;
	//- ASU-1025, ASU-946 20241220 Михайловский
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.Перемещение") Тогда
		ХПС_Объект.СкладПолучатель 	= ДокОбъект.СкладПолучатель;
	КонецЕсли;
	
	ХПС_Объект.Сертификаты.Очистить();
	Для Каждого СтрокаХДТО Из ТЧ_Сертификаты_ХДТО.Строка Цикл
		СтрокаТЧ = ХПС_Объект.Сертификаты.Добавить();	
		
		СтрокаТЧ.Сертификат		= СтрокаХДТО.ПодарочныйСертификат;
		
		СтрокаТЧ.Количество		= 1;
		СтрокаТЧ.КоличествоРасч	= 1;
		СтрокаТЧ.КоличествоФакт	= 1;
		СтрокаТЧ.Принято		= 1;
		
		Если ОбъектСуществует(СтрокаТЧ.Сертификат,"Справочник.ПодарочныеСертификаты") Тогда
			РеквизитыСертификата	= ПолучитьРеквизитыШапки(СтрокаТЧ.Сертификат,"Владелец,КодСертификата,Номинал");				
			
			СтрокаТЧ.КодСертификата		= Прав(СокрЛП(РеквизитыСертификата.КодСертификата),7);			
			СтрокаТЧ.Номенклатура		= РеквизитыСертификата.Владелец;
			СтрокаТЧ.Номинал			= РеквизитыСертификата.Номинал;
		КонецЕсли; 
	КонецЦикла;
	
	Если НЕ Найден Тогда
		Префикс = СокрЛП(ДокОбъект.Склад.Подразделение.КодФизическогоУзла77);
		
		Если ЗначениеЗаполнено(Префикс) Тогда		
			ХПС_Объект.УстановитьНовыйНомер(Префикс+"-");
		КонецЕсли;		
	КонецЕсли; 
	
	ЗаписатьДокумент(ХПС_Объект,Отправитель,Найден);	
КонецФункции //ЗагрузитьХПС(ДокОбъект,ТЧ_Сертификаты_ХДТО,Отправитель)

Функция ПолучитьПунктДоставки(Склад)
	Менеджер	= Справочники.ПунктыДоставки;	
	Результат	= Менеджер.ПустаяСсылка();
	
	//крохин начало 28.07.2011
	//выбираем первый по наименованию
	//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
	Выборка=Менеджер.Выбрать(,Склад,,"Наименование Убыв");
	//крохин конец 28.07.2011
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Ссылка;			
	КонецЦикла;
	//крохин конец
	
	Возврат Результат;
КонецФункции // ()

Функция ЗагрузитьДок_РКО(ОбъектХДТО,Отправитель)	
	Вид			= "РасходныйКассовыйОрдер";	
	Менеджер	= Документы[Вид];
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
	
	ДокОбъект.ВидОперации	= ЗагрузитьПер("ВидыОперацийРКО",ОбъектХДТО.ВидОперации);	
	
	ЗагрузитьРеквизитыСМультиТипами(ДокОбъект,ОбъектХДТО,"Контрагент");	
	
	Если ТипЗнч(ДокОбъект.Контрагент)=ТипЗнч(Справочники.Контрагенты.ПустаяСсылка()) Тогда
		ДокОбъект.КонтрагентЦБ = ДокОбъект.Контрагент.Ведущий;	
	КонецЕсли;	
	
	ДокОбъект.ИБ	= ФР_ОбщегоНазначения_ПИ.ТекущаяИБ();
		
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);
КонецФункции //ЗагрузитьДок_РКО(ОбъектХДТО,Отправитель)

Функция ОтправительПеремещенияДляЦО_ЕЕ(Склад,СкладПолучатель,СостояниеНакладнойУПолучателя)
	Если СравнитьЗначенияПеречисления(СостояниеНакладнойУПолучателя,Перечисления.СостоянияНакладной.ВРаботе)>0 Тогда
		Реквизиты = ПолучитьРеквизитыШапки(СкладПолучатель,"Подразделение,Подразделение.ВидПодразделения");
		Если Реквизиты.Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Торговое
			ИЛИ Реквизиты.Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
			Возврат ФР_ОбщегоНазначения_ПИ.УзелПодразделения(Реквизиты.Подразделение);	
		КонецЕсли;	
	КонецЕсли;
	
	Реквизиты = ПолучитьРеквизитыШапки(Склад,"Подразделение,Подразделение.ВидПодразделения");
	Если Реквизиты.Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Торговое 
		ИЛИ Реквизиты.Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
		Возврат ФР_ОбщегоНазначения_ПИ.УзелПодразделения(Реквизиты.Подразделение);	
	КонецЕсли;
	
	Возврат ПланыОбмена.Основной.ПустаяСсылка();
КонецФункции //ОтправительПеремещенияДляЦО_ЕЕ()
 

Функция ЗагрузитьРеквизитыСМультиТипами(Объект,ОбъектХДТО,Знач ИменаРеквизитов)
	ИменаРеквизитов	= СтрРазделить(ИменаРеквизитов,",");
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		ДанныеРекв	= ОбъектХДТО[ИмяРеквизита];
		ИмяТипа		= ОбъектХДТО[ИмяРеквизита+"Тип"];
		
		Если ЗначениеЗаполнено(ДанныеРекв) И ЗначениеЗаполнено(ИмяТипа) Тогда
			ИмяТипа = ПолучитьПолноеИмяТипаТек(ИмяТипа);
			Если ТипЗнч(ДанныеРекв)=Тип("Строка") Тогда
				УИД = Новый УникальныйИдентификатор(ДанныеРекв);
			Иначе
				УИД = ДанныеРекв.УникальныйИдентификатор();			
			КонецЕсли; 
			//+ASU-946 20250130 Михайловский
			Если ИмяРеквизита = "ДокОснование" И ИмяТипа = "Документ.АктОРасхождениях" Тогда
				Объект[ИмяРеквизита] = ФР_ОбщегоНазначения_ПИ.ПолучитьМенеджер("Документ.ЗаявкаНаРекламацию").ПолучитьСсылку(УИД);
			//-ASU-946 20250130 Михайловский
			//+HELP-8926 20260327 Михайловский
			ИначеЕсли ИмяРеквизита = "ДокОснование" И ИмяТипа = "Документ.ЗаявкаНаВозвратПоставщику" Тогда
				Объект[ИмяРеквизита] = ФР_ОбщегоНазначения_ПИ.ПолучитьМенеджер("Документ.ЗаявкаНаВозвратОтПокупателя").ПолучитьСсылку(УИД);
			//-HELP-8926 20260327 Михайловский	
			Иначе	
				Объект[ИмяРеквизита] = ФР_ОбщегоНазначения_ПИ.ПолучитьМенеджер(ИмяТипа).ПолучитьСсылку(УИД);
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
КонецФункции // ()
 

Функция ЗагрузитьДок_ПС_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.ПереводСредств;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);	
	
	ДокОбъект.ВидОперации	= ЗагрузитьПер("ВидыОперацийПС",ОбъектХДТО.ВидОперации);
	ДокОбъект.Сумма			= ОбъектХДТО.СуммаДокумента;	
	ДокОбъект.ИБ 			= ИБ_SSP;
	
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_ПС_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_СПН_ЕЕ(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.СписаниеТМЦ;	
	Вид			= Менеджер.ПолучитьСсылку().Метаданные().Имя;
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка.УникальныйИдентификатор(),Вид);	
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда 
		ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,"Пропущен существующий объект.");
		Возврат РезультатПоиска.Ссылка;
	КонецЕсли;
	
	ДокОбъект				= РезультатПоиска.Объект;
	
	Если 1=2 Тогда
		ДокОбъект=Документы.СписаниеТМЦ.СоздатьДокумент();	
	КонецЕсли;
	
	ИменаТЧ	= "Товары";
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО,,ИменаТЧ);
	
	ДокОбъект.КодОперации			= Перечисления.КодыОперацийОстатки.Списание;
	ДокОбъект.СостояниеНакладной	= Перечисления.СостоянияНакладной[ОбъектХДТО.СостояниеНакладной];
	
	ТЧ_ХДТО	= ОбъектХДТО.Товары;
	ДокОбъект.Товары.Очистить();
	Если ТЧ_ХДТО<>Неопределено Тогда	
		Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
			СтрокаТЧ	= ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);			
			
			СтрокаТЧ.Номенклатура	= Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЧ_ХДТО.ХарактеристикаНоменклатуры.УникальныйИдентификатор());	
			
			СтрокаТЧ.Единица		= Ед_Штука;
			СтрокаТЧ.Коэффициент	= 1;
		КонецЦикла;
	КонецЕсли;
	
	ЗагрузитьРеквизитыСМультиТипами(ДокОбъект,ОбъектХДТО,"ДокОснование");	
	
	ДокОбъект.ИБ = ИБ_SSP;
	//+ ASU-1025, ASU-946 20241220 Михайловский
	ТЧ_Сертификаты_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,"Сертификаты");
	Если ТЧ_Сертификаты_ХДТО<>Неопределено И ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
		ЗагрузитьХПС(ДокОбъект,ТЧ_Сертификаты_ХДТО,Отправитель);	
	КонецЕсли;
	//- ASU-1025, ASU-946 20241220 Михайловский
	ЗаписатьДокумент(ДокОбъект,Отправитель,РезультатПоиска.Найден);	
КонецФункции //ЗагрузитьДок_СПН_ЕЕ(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_УстановкаСкидок(ОбъектХДТО,Отправитель)	
	Менеджер	= Документы.УстановкаСкидок;
	Вид			= Метаданные.НайтиПоТипу(ТипЗнч(Менеджер.ПустаяСсылка())).Имя;
	
	Результат	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	
	Если Результат.Объект<>Неопределено Тогда		
		ТипСкидок_Ист	= ОбъектХДТО.ТипСкидок;
		ТипСкидок_Тек	= НайтиТипСкидок(ОбъектХДТО.Подразделение,ТипСкидок_Ист);
		
		ДокОбъект	= Результат.Объект;
		ДокСсылка	= Результат.Ссылка;
		
		Если 1=2 Тогда
			ДокОбъект=Документы.УстановкаСкидок.СоздатьДокумент();	
		КонецЕсли;	
		
		ДокОбъект.Дата			= ОбъектХДТО.Дата;
		ДокОбъект.Номер			= ОбъектХДТО.Номер;		
		ДокОбъект.Автор			= ОбъектХДТО.Автор;
		ДокОбъект.ТипСкидок		= ТипСкидок_Тек;				
		
		Подразделение			= ПолучитьСвойствоХДТО(ОбъектХДТО,"Подразделение");			
		
		ДокОбъект.Дата2			= ОбъектХДТО.ДействителенПо;

		ДокОбъект.ПометкаУдаления	= ОбъектХДТО.ПометкаУдаления;
		Если НЕ ДокОбъект.ПометкаУдаления Тогда
			ДокОбъект.Проведен = Истина;		
		КонецЕсли;
		
		ЗаписатьДокумент(ДокОбъект,Отправитель,Результат.Найден);
		
		Если ДокОбъект.ПометкаУдаления Тогда
			НЗ			= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();		
			НЗ.Отбор.ДокументУстановкаСкидок.Установить(ДокСсылка,Истина);
			
			НЗ.Очистить();		
			
			ЗаписатьОбъект(НЗ,Отправитель);			
		КонецЕсли;	
	Иначе
		ЗаписатьВПротокол_ОбъектПропущен(Результат);		
	КонецЕсли;	
	
	Возврат Результат.Ссылка;
КонецФункции //ЗагрузитьДокумент_ПрайсЛист(ОбъектХДТО,Отправитель)

Функция ЗагрузитьДок_ХКМ(ОбъектХДТО, Отправитель)
	Менеджер	= Документы.ХранилищеКодовМаркировки;
	Вид			= Менеджер.ПустаяСсылка().Метаданные().Имя;	
	
	РезультатПоиска	= НайтиСоздатьДокумент(ОбъектХДТО.Ссылка,Вид);
	Если РезультатПоиска.Найден И НЕ фПерезаписыватьДокументы Тогда Возврат Неопределено КонецЕсли; 
	
	ДокОбъект	= РезультатПоиска.Объект;
	ЗаполнитьЗначенияСвойств(ДокОбъект,ОбъектХДТО);
		
	ИменаТЧ	= "Товары,ШтрихкодыУпаковок";
	
	ЗагрузитьТЧОбъекта(ДокОбъект, ОбъектХДТО, ИменаТЧ);
	
	ЗагрузитьРеквизитыСМультиТипами(ДокОбъект, ОбъектХДТО, "ДокОснование,Отправитель,Получатель");
		
	ЗаписатьДокумент(ДокОбъект, Отправитель, РезультатПоиска.Найден);
	//+HELP-3182 20250313 Михайловский
	Если ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
		Если ТипЗнч(ДокОбъект.Ссылка.ДокОснование) = Тип("ДокументСсылка.Перемещение") Тогда
			ПроверитьПРМ(ДокОбъект.Ссылка.ДокОснование);
		КонецЕсли;	
	КонецЕсли;	
	//-HELP-3182 20250313 Михайловский
	
КонецФункции //ЗагрузитьДок_ХКМ(ОбъектХДТО,Отправитель)

//+HELP-3182 20250313 Михайловский
Процедура ПроверитьПРМ(ДокОснование)	
	Попытка
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		|	Перемещение.Ссылка,
		|	Перемещение.ТребуетсяМаркировка
		|ИЗ
		|	Документ.Перемещение КАК Перемещение
		|ГДЕ
		|	Перемещение.Ссылка = &ДокОснование";
		Запр.УстановитьПараметр("ДокОснование", ДокОснование);
		Выб = Запр.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Если НЕ Выб.ТребуетсяМаркировка Тогда
				ДокОб = Выб.Ссылка.ПолучитьОбъект();
				Если НЕ ДокОб = Неопределено Тогда
					ДокОб.ТребуетсяМаркировка = Истина;
					ДокОб.Записать();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры //-HELP-3182 20250313 Михайловский

#Область ЗагрузкаДокументовСлужебные


Функция ПолучитьПунктДоставкиПодразделения(Подразделение)
	Результат = Справочники.ПунктыДоставки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Справочник КАК ПунктДоставки
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	ИмяРеквизита		= ""ПодразделениеФранчайзинга""
	|	И ЗначениеРеквизита	= &Подразделение
	|	И Справочник Ссылка Справочник.ПунктыДоставки
	|";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ПунктДоставки) Тогда
		Результат = Выборка.ПунктДоставки; 	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()
 

Функция НайтиСоздатьДокумент(ТекстСсылки,Вид)
	Менеджер		= Документы[Вид];
	
	Результат 		= Новый Структура("Найден,Ссылка,Объект,ПолноеИмяТипа",Ложь,Менеджер.ПустаяСсылка(),Неопределено,Метаданные.Документы[Вид].ПолноеИмя());
	
	Если ТипЗнч(ТекстСсылки)=Тип("Строка") Тогда
		Результат.Ссылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекстСсылки));	
	ИначеЕсли ТипЗнч(ТекстСсылки)=Тип("УникальныйИдентификатор") Тогда
		Результат.Ссылка = Менеджер.ПолучитьСсылку(ТекстСсылки);			
	Иначе
		Результат.Ссылка = ТекстСсылки;		
	КонецЕсли;
	
	Если ОбъектСуществует(Результат.Ссылка,"Документ."+Вид) Тогда			
		Результат.Найден	= Истина;
		Если фПерезаписыватьДокументы Тогда
			Результат.Объект = Результат.Ссылка.ПолучитьОбъект();		
		КонецЕсли;		
	Иначе
		ДокОбъект	= Менеджер.СоздатьДокумент();		
		ДокОбъект.УстановитьСсылкуНового(Результат.Ссылка);
		
		Результат.Объект = 	ДокОбъект;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьДокумент(ТекстСсылки,Вид)

Функция ДанныеНоменклатуры(ОбъектХДТО)
	Результат=Новый Структура;
	
	Номенклатура_УИД	= Новый УникальныйИдентификатор(ОбъектХДТО.ДанныеНоменклатуры.Номенклатура.Ссылка);
	Характеристика_УИД	= Новый УникальныйИдентификатор(ОбъектХДТО.ДанныеНоменклатуры.Характеристика.Ссылка);
	
	Результат.Вставить("Номенклатура",	Справочники.Номенклатура.ПолучитьСсылку(Характеристика_УИД));	
	
	Возврат Результат;
КонецФункции //ПолучитьДанныеНоменклатуры(ОбъектХДТО)

Функция ЗаписатьДокумент(ДокОбъект,Отправитель,Найден)
	Если ДокОбъект.Метаданные().Имя="УстановкаСкидок" Тогда
		ПроверятьЛогикуОбмена = Ложь;
	Иначе
		ПроверятьЛогикуОбмена = Истина;			
	КонецЕсли; 
	
	Результат = МожноЗаписатьДокумент_(ДокОбъект,Отправитель,Найден,ПроверятьЛогикуОбмена);
	Если Результат.Результат Тогда
		ДокОбъект.ОбменДанными.Загрузка	= Истина;
		Если Отправитель<>"Нечто" Тогда
			Попытка
				ДокОбъект.ОбменДанными.Отправитель = Отправитель;	
			Исключение
				#ЕСЛИ КЛИЕНТ ТОГДА
				Сообщить("Ошибка установки отправителя: "+ОписаниеОшибки(), СтатусСообщения.Важное);
				#КОНЕЦЕСЛИ
			КонецПопытки;			
		КонецЕсли; 
		
		ДокОбъект.Записать();	
		
		Статус			= "Записан";
		СтатусЗаписи    = ?(Найден,"Перезапись","Новый");		
		
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.ОбменДанными.Загрузка=Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
			
			Статус			= "Проведен";			
		Иначе
			Если ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
				ОчиститьДвиженияДокумента(ДокОбъект.Ссылка, Истина);			
			КонецЕсли;			
		КонецЕсли;
		ДобавитьОбъектВПротоколОбмена(ДокОбъект,СтатусЗаписи,Статус);
	Иначе
		ДобавитьОбъектВПротоколОбмена(ДокОбъект,"","Пропущен",СтрСоединить(Результат.Ошибки,Символы.ПС));		
	КонецЕсли;
КонецФункции //ЗаписатьДокумент(ДокОбъект)

Функция МожноЗаписатьДокумент_(ДокОбъект,Отправитель,Найден,ПроверятьЛогикуОбмена=Истина)
	Результат 		= Новый Структура("Результат,Ошибки",Истина,Новый Массив);	
	
	ИмяПланаОбмена	= "ФР_ОбменСФРК";
	ИмяТаблицы		= ДокОбъект.Метаданные().ПолноеИмя();	
	
	Если ПроверятьЛогикуОбмена И НЕ ФР_ОбщегоНазначения_ПИ.ОбъектХодитСнизуВверх(ИмяПланаОбмена,ИмяТаблицы) Тогда
		Результат.Результат = Ложь;
		Результат.Ошибки.Добавить("Объект не ходит снизу вверх.");		
	Иначе		
		//+ASU-824 20260316 Михайловский
		//вместо
		//Если НЕ КонтрольДатыЗапрета(ДокОбъект) Тогда
		Если НЕ ОбщегоНазначения_ПИ.КонтрольДатыЗапрета_ПИ(ДокОбъект.Метаданные().Имя, ДокОбъект.Дата) Тогда
		//-ASU-824 20260316 Михайловский
			Результат.Результат = Ложь;
			Результат.Ошибки.Добавить("Объект находится за границей редактирования.");
		Иначе
			Если Найден Тогда			 
				Если ТипЗнч(ДокОбъект)=Тип("ДокументОбъект.Заказ") Тогда
					СостояниеЗаказа = ПолучитьРеквизитШапки(ДокОбъект.Ссылка,"СостояниеНакладной","Документ");
					Если СостояниеЗаказа<>Перечисления.СостоянияЗаказаКонтрагента.ВРаботе Тогда
						ТекстОшибки = СтрШаблон("Недопустимое состояние заказа в базе SNL: '%1' !",СостояниеЗаказа);
						Результат.Результат = Ложь;
						Результат.Ошибки.Добавить(ТекстОшибки);
					КонецЕсли; 
				ИначеЕсли ТипЗнч(ДокОбъект)=Тип("ДокументОбъект.ЗаявкаНаВозвратОтПокупателя") Тогда
					РеквизитыШ = ПолучитьРеквизитШапки(ДокОбъект.Ссылка,"СостояниеСогласования_Поставщик,СостояниеСогласования_Покупатель","Документ");
					
					Если СравнитьЗначенияПеречисления(РеквизитыШ.СостояниеСогласования_Поставщик,Перечисления.СостоянияСогласования.НаСогласованииЦО)>0
						И СравнитьЗначенияПеречисления(РеквизитыШ.СостояниеСогласования_Покупатель,Перечисления.СостоянияСогласования.ОтмененКонтрагент)>=0 Тогда
						ТекстОшибки = СтрШаблон("Недопустимое состояние заявки в базеSNL ! Поставщик: '%1', покупатель: '%2' !",
							РеквизитыШ.СостояниеСогласования_Поставщик,
							РеквизитыШ.СостояниеСогласования_Покупатель
						);
						
						Результат.Результат = Ложь;
						Результат.Ошибки.Добавить(ТекстОшибки);
					КонецЕсли; 					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //МожноЗаписатьДокумент_(ДокОбъект,Отправитель,Найден)

Функция ДобавитьОбъектВПротоколОбмена(Знач Объект,СтатусЗаписи,Действие,ТекстОшибки=Неопределено)	
	
	Если ТипЗнч(Объект)=Тип("Строка") Тогда
		ИмяТаблицы	= ПолучитьТипТек(Объект);
		Ссылка		= Неопределено;
	Иначе
		ИмяТаблицы		= Объект.Метаданные().ПолноеИмя();
		ТипЗнчСтрВнутр	= ЗначениеВСтрокуВнутр(ТипЗнч(Объект));	
		
		Если ФР_ОбщегоНазначения_ПИ.ЭтоСсылочныйТип(ТипЗнчСтрВнутр) Тогда
			Если ФР_ОбщегоНазначения_ПИ.ЭтоСсылка(ТипЗнчСтрВнутр) Тогда
				Ссылка= Объект;
			Иначе
				Ссылка= Объект.Ссылка;				
			КонецЕсли;			
		Иначе						
			Ссылка= Неопределено;			
		КонецЕсли;		
	КонецЕсли; 
	
	СтрокаТО				= ОбъектыОбмена.Добавить();
	
	СтрокаТО.ОбъектТип			= ИмяТаблицы;
	Если Ссылка<>Неопределено Тогда
		СтрокаТО.ОбъектСсылкаУИД= Ссылка.УникальныйИдентификатор();	
	КонецЕсли;	
	СтрокаТО.Ошибки				= ТекстОшибки;	
	СтрокаТО.Действие			= Действие;
	СтрокаТО.СтатусЗаписи		= СтатусЗаписи;
	СтрокаТО.Ссылка				= Ссылка;
	
	Если СтрНайти(ИмяТаблицы,"РегистрСведений.")=1 Тогда
		СтрокаТО.КоличествоЗаписей = Объект.Количество();		
	КонецЕсли; 
	
КонецФункции //ДобавитьОбъектВПротоколЗагрузки()

Функция ЗаписатьВПротокол_ОбъектПропущен(РезультатПоиска,Ошибки="")	
		
	СтрокаТО				= ОбъектыОбмена.Добавить();
	
	СтрокаТО.ОбъектТип			= РезультатПоиска.ПолноеИмяТипа;
	Если РезультатПоиска.Ссылка<>Неопределено Тогда
		СтрокаТО.ОбъектСсылкаУИД= РезультатПоиска.Ссылка.УникальныйИдентификатор();	
	КонецЕсли;	
	СтрокаТО.Ошибки				= Ошибки;	
	СтрокаТО.Действие			= "Пропуск";
	СтрокаТО.СтатусЗаписи		= "";
		
КонецФункции // ()

Процедура ОчиститьДвиженияДокумента(ДокСсылка,Записывать=Ложь) Экспорт
	
	Если ДокСсылка.Пустая() Тогда Возврат КонецЕсли; 
	
	МетаДок	= Метаданные.НайтиПоТипу(ТипЗнч(ДокСсылка));
	Для Каждого Движение Из МетаДок.Движения Цикл
		ОписаниеТипа=ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(Движение.ПолноеИмя());
		Если ОписаниеТипа.Тип="РегистрНакопления" Тогда
			НЗ=РегистрыНакопления[ОписаниеТипа.Вид].СоздатьНаборЗаписей();
		ИначеЕсли ОписаниеТипа.Тип="РегистрСведений" Тогда
			НЗ=РегистрыСведений[ОписаниеТипа.Вид].СоздатьНаборЗаписей();
		Иначе
			НЗ=Неопределено;		
		КонецЕсли; 
		Если НЗ<>Неопределено Тогда
			НЗ.Отбор.Регистратор.Установить(ДокСсылка,Истина);
			НЗ.Записать();
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры // ОчиститьДвиженияДокумента()

#КонецОбласти //ЗагрузкаДокументовСлужебные 


#КонецОбласти //Загрузка_Документы 


#Область Загрузка_Перечисления


Функция ЗагрузитьПер_СтавкаНДС(СтавкаНДС)	
	Результат	= Перечисления.СтавкиНДС.БезНДС;
	
	Если СтавкаНДС="НДС20" Тогда
		Результат	= Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДС="НДС10" Тогда		
		Результат	= Перечисления.СтавкиНДС.НДС10;	
	//+SNL-77 20260111 Михайловский	
	ИначеЕсли СтавкаНДС="НДС22" Тогда		
		Результат	= Перечисления.СтавкиНДС.НДС22;
	//-SNL-77 20260111 Михайловский	
	//+HELP-2538 20250115 Михайловский
	ИначеЕсли СтавкаНДС="НДС5" Тогда
		Результат	= Перечисления.СтавкиНДС.НДС5;
	ИначеЕсли СтавкаНДС="НДС7" Тогда
		Результат	= Перечисления.СтавкиНДС.НДС7;
	//-HELP-2538 20250115 Михайловский	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЗагрузитьПер_СтавкаНДС(СтавкаНДС)

Функция ЗагрузитьПер(ИмяПеречисления,Знач ИмяЗначения, ЗначениеПоУмолчанию = Неопределено)
	Результат   = Перечисления[ИмяПеречисления].ПустаяСсылка();
	Если ЗначениеЗаполнено(ИмяЗначения) Тогда
		ИмяТек		= СоответствиеЗначенийПеречислений.Получить(ИмяПеречисления+"."+ИмяЗначения);
		ИмяЗначения	= ?(ИмяТек=Неопределено,ИмяЗначения,ИмяТек);		
		
		Попытка
			НовЗнач		= Перечисления[ИмяПеречисления][ИмяЗначения];
			Результат	= НовЗнач;
		Исключение
			Если ЗначениеЗаполнено(ЗначениеПоУмолчанию) Тогда
				Результат	= ЗначениеПоУмолчанию;			
			КонецЕсли; 			
		КонецПопытки;		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЗагрузитьПер(ИмяПеречисления,Знач ИмяЗначения, ЗначениеПоУмолчанию = Неопределено)

	
#КонецОбласти


#Область Загрузка_РегистрыСведений


Функция ЗагрузитьРС_КоличествоПосетителей(ОбъектХДТО,Отправитель)
	НЗ	= РегистрыСведений.КоличествоПосетителей.СоздатьНаборЗаписей();
	
	Дата			= ОбъектХДТО.Отбор.Дата;
	Подразделение	= ОбъектХДТО.Отбор.Подразделение; 
	Попытка
		Склад		 	= Подразделение.ОсновнойСклад;
	Исключение
	КонецПопытки;
	
	НЗ.Отбор.Дата.Установить(Дата,Истина);
	НЗ.Отбор.Подразделение.Установить(Подразделение,Истина);
	НЗ.Отбор.Склад.Установить(Склад,Истина);
		
	Для Каждого ЗаписьХДТО Из ОбъектХДТО.Строка Цикл
		Запись	= НЗ.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ЗаписьХДТО);
		Запись.Склад				 	= Склад;
		Запись.Дата						= Дата;
		
		Запись.КоличествоПосетителей	= ЗаписьХДТО.Количество;		
	КонецЦикла; 
	
	ЗаписатьОбъект(НЗ,Отправитель);	
КонецФункции //ЗагрузитьРС_КоличествоПосетителей(ОбъектХДТО,Отправитель=Неопределено)


#КонецОбласти


#Область Загрузка_Справочники

Функция ЗагрузитьСпр_Бренды_Элемент(ОбъектХДТО,Отправитель=Неопределено)	
	Менеджер	= Справочники.ФР_Бренды;	
	Результат	= НайтиСоздатьСправочник(ОбъектХДТО.Ссылка,"ФР_Бренды",Ложь);	
	
	Если Результат.Найден И НЕ фПерезаписыватьРеквизитыСправочников Тогда
		Возврат Результат.Ссылка;		
	Иначе
		СпрОбъект	= Результат.Объект;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СпрОбъект,ОбъектХДТО,,"Ссылка");	
		
	Возврат ЗаписатьОбъект(СпрОбъект,Отправитель);	
КонецФункции //ЗагрузитьСпр_Бренды_Элемент(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_Валюты_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)
	Результат 	= ЗагрузитьСпр_КС("Валюты","Код,Наименование",КС_ХДТО,Отправитель,ВернутьОбъект,Ложь);	
	
	Возврат Результат;
КонецФункции //ЗагрузитьСпр_Валюты_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)

Функция ЗагрузитьСпр_ВидыНоменклатуры_Группа(ОбъектХДТО,Отправитель=Неопределено)
	Возврат ЗагрузитьСпр_СТАНДАРТНО(Справочники.ФР_ВидыНоменклатуры,ОбъектХДТО,Истина,Отправитель);
КонецФункции //ЗагрузитьСпр_ВидыНоменклатуры_Группа(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_ВидыНоменклатуры_Элемент(ОбъектХДТО,Отправитель=Неопределено)
	Возврат ЗагрузитьСпр_СТАНДАРТНО(Справочники.ФР_ВидыНоменклатуры,ОбъектХДТО,Ложь,Отправитель);
КонецФункции //ЗагрузитьСпр_ВидыНоменклатуры_Элемент(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_ВидыПодарочныхСертификатов_КС(ОбъектХДТО,Отправитель=Неопределено)
	Вид			= "ВидыПодарочныхСертификатов";
	ПолныйТип	= "Справочник.ВидыПодарочныхСертификатов_КС";	
	
	Результат	= ПолучитьИзКэша(ОбъектХДТО.Ссылка,ПолныйТип); 
	
	Если Результат<>Неопределено Тогда
		Возврат Результат;		
	Иначе		
		Если ОбъектХДТО.Ссылка="a0792ed1-cc9f-4004-9a55-b7dc6ed64c7d" Тогда
			Результат	= Перечисления.ВидыПодарочныхСертификатов.Собственный;		
		Иначе
			Результат	= Перечисления.ВидыПодарочныхСертификатов.СертификатИзЧека;			
		КонецЕсли; 
	КонецЕсли;		
	
	Возврат Результат;	
КонецФункции //ЗагрузитьСпр_ВидыПодарочныхСертификатов_КС(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_Кассы_Элемент_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)
	Менеджер	= Справочники.Кассы;
	
	Если КС_ХДТО=Неопределено Тогда Возврат Менеджер.ПустаяСсылка() КонецЕсли; 
	
	Ссылка		= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Ссылка));
	СпрОбъект	= Неопределено;
	
	Если (фСоздаватьОбъектыПоСсылкам ИЛИ ВернутьОбъект) 
		И НЕ ОбъектСуществует(Ссылка,"Справочник."+Ссылка.Метаданные().Имя) Тогда
		
		СпрОбъект	= Менеджер.СоздатьЭлемент();		
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	
		СпрОбъект.Наименование			= КС_ХДТО.Наименование;		
		
		Если НЕ ВернутьОбъект Тогда			
			Ссылка		= ЗаписатьОбъект(СпрОбъект,Отправитель);		
		КонецЕсли;
	КонецЕсли;
	
	Если ВернутьОбъект И СпрОбъект=Неопределено Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();		 
	КонецЕсли;
	
	Возврат ?(ВернутьОбъект,СпрОбъект,Ссылка);
КонецФункции //ЗагрузитьСпр_Кассы_Элемент_КС(ОбъектХДТО_КС,Отправитель=Неопределено,ВернутьОбъект=Ложь)

Функция ЗагрузитьСпр_Организации_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)
	Менеджер	= Справочники.Организации;	
	
	Ссылка		= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Ссылка));
	СпрОбъект	= Неопределено;
	
	Если (фСоздаватьОбъектыПоСсылкам ИЛИ ВернутьОбъект) 
		И НЕ ОбъектСуществует(Ссылка,"Справочник."+Ссылка.Метаданные().Имя) Тогда
		
		СпрОбъект	= Менеджер.СоздатьЭлемент();		
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
		
		СпрОбъект.Наименование			= КС_ХДТО.Наименование;
		СпрОбъект.НаименованиеПолное	= КС_ХДТО.НаименованиеПолное;
	
		СпрОбъект.ИНН					= ПолучитьСвойствоХДТО(КС_ХДТО,"ИНН");
		СпрОбъект.КПП					= ПолучитьСвойствоХДТО(КС_ХДТО,"КПП");
	    //+ HELP-1058 20241002 Михайловский
		Попытка
			//- HELP-1058 20241002 Михайловский
			
			Если КС_ХДТО.ЮридическоеФизическоеЛицо="ЮридическоеЛицо" Тогда
				СпрОбъект.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо;
			Иначе
				СпрОбъект.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо;		
			КонецЕсли;	
			//+ HELP-1058 20241002 Михайловский
		Исключение
		КонецПопытки;
		//- HELP-1058 20241002 Михайловский
		Если НЕ ВернутьОбъект Тогда			
			Ссылка		= ЗаписатьОбъект(СпрОбъект,Отправитель);		
		КонецЕсли;
	КонецЕсли;
	
	Если ВернутьОбъект И СпрОбъект=Неопределено Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();		 
	КонецЕсли;
	
	Возврат ?(ВернутьОбъект,СпрОбъект,Ссылка);
КонецФункции //ЗагрузитьСпр_Организации_КС(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_Склады_Элемент_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)
	Менеджер	= Справочники.Склады;
	
	Ссылка		= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Ссылка));
	СпрОбъект	= Неопределено;
	
	Если (фСоздаватьОбъектыПоСсылкам ИЛИ ВернутьОбъект) 
		И НЕ ОбъектСуществует(Ссылка,"Справочник."+Ссылка.Метаданные().Имя) Тогда
		
		СпрОбъект	= Менеджер.СоздатьЭлемент();		
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	
		СпрОбъект.Наименование			= КС_ХДТО.Наименование;		
		
		Если НЕ ВернутьОбъект Тогда			
			Ссылка		= ЗаписатьОбъект(СпрОбъект,Отправитель);		
		КонецЕсли;
	КонецЕсли;
	
	Если ВернутьОбъект И СпрОбъект=Неопределено Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();		 
	КонецЕсли;
	
	Возврат ?(ВернутьОбъект,СпрОбъект,Ссылка);
КонецФункции //ЗагрузитьСпр_Склады_Элемент_КС(ОбъектХДТО_КС,Отправитель=Неопределено)

Функция ЗагрузитьСпр_ПакетыДанных_Элемент(ОбъектХДТО,Отправитель=Неопределено)
	Возврат ЗагрузитьСпр_СТАНДАРТНО(Справочники.ФР_ПакетыДанных,ОбъектХДТО,Истина,Отправитель);
КонецФункции //ЗагрузитьСпр_ПакетыДанных_Элекмент(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_Подразделения_Элемент_КС(КС_ХДТО,Отправитель=Неопределено)
	Менеджер	= Справочники.Подразделения;	
	
	Если КС_ХДТО=Неопределено Тогда
		Возврат Менеджер.ПустаяСсылка();	
	КонецЕсли; 
	
	Ссылка	= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Ссылка));
	Если фСоздаватьОбъектыПоСсылкам И НЕ ОбъектСуществует(Ссылка,"Справочник."+Ссылка.Метаданные().Имя) Тогда
		СпрОбъект	= Менеджер.СоздатьЭлемент();
		
		СпрОбъект.Код			= ПолучитьСвойствоХДТО(КС_ХДТО,"Код");
		СпрОбъект.Наименование	= КС_ХДТО.Наименование;
		
		Ссылка		= ЗаписатьОбъект(СпрОбъект,Отправитель);
	КонецЕсли; 
	
	Возврат Ссылка;		
КонецФункции //ЗагрузитьСпр_Подразделения_Элемент_КС(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_Пользователи_Элемент_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)
	Менеджер	= Справочники.Пользователи;	
	
	Если КС_ХДТО=Неопределено Тогда Возврат Менеджер.ПустаяСсылка() КонецЕсли;	
	
	Ссылка	= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Ссылка));
	Если фСоздаватьОбъектыПоСсылкам И НЕ ОбъектСуществует(Ссылка,"Справочник."+Ссылка.Метаданные().Имя) Тогда
		СпрОбъект	= Менеджер.СоздатьЭлемент();
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
		
		СпрОбъект.Наименование 	= КС_ХДТО.Наименование;		
		СпрОбъект.ФизическоеЛицо= ЗагрузитьСпр_ФизическиеЛица_Элемент_КС(ПолучитьСвойствоХДТО(КС_ХДТО,"ФизическоеЛицо"));		
		
		Ссылка		 = ЗаписатьОбъект(СпрОбъект,Отправитель);
	КонецЕсли; 
	
	Возврат Ссылка;	
КонецФункции //ЗагрузитьСпр_Пользователи_Элемент_КС(КС_ХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_ПодарочныеСертификаты_Элемент(ОбъектХДТО,Отправитель=Неопределено)	
	Результат	= НайтиСоздатьСправочник(ОбъектХДТО.Ссылка,"ПодарочныеСертификаты",Ложь);	
	
	Если Результат.Найден И НЕ фПерезаписыватьРеквизитыСправочников Тогда
		Возврат Результат.Ссылка;		
	Иначе
		СпрОбъект	= Результат.Объект;
	КонецЕсли;
	
	ИменаТЧ	= "СписокТЦПриемки";
	
	ЗаполнитьЗначенияСвойств(СпрОбъект,ОбъектХДТО,,"Владелец,Код,ВидСертификата,ПодразделениеЗатрат,ПодразделениеПолучатель");	
	//Это какой-то мухлеж с повторноиспользуемыми сертификатами..........
	
	Если НЕ ЗначениеЗаполнено(СпрОбъект.Владелец) ИЛИ ПолучитьРеквизитШапки(СпрОбъект.Владелец, "ЭтоГруппа", "Справочник") = Истина Тогда
		СпрОбъект.Владелец		= ПолучитьПервыйЭлементВГруппе(ОбъектХДТО.Владелец);	
	КонецЕсли;	
	СпрОбъект.КодСертификата	= ОбъектХДТО.Код;
	СпрОбъект.Код				= ОбъектХДТО.Наименование;
	
	Если СпрОбъект.ДатаПогашения>'1980.01.01' Тогда
		СпрОбъект.Использован = Истина;		
	КонецЕсли; 
	
	Если ОбъектХДТО.ВидСертификата="СертификатИзЧека" Тогда
		СпрОбъект.ВидСертификата = Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека; 		
	КонецЕсли;	
	
	ЗагрузитьТЧОбъекта(СпрОбъект,ОбъектХДТО,ИменаТЧ);	
		
	Возврат ЗаписатьОбъект(СпрОбъект,Отправитель);	
КонецФункции //ЗагрузитьСпр_ПодарочныеСертификаты_Элемент(ОбъектХДТО,Отправитель=Неопределено)

Функция ПолучитьПервыйЭлементВГруппе(Группа)
	Если ЗначениеЗаполнено(Группа) И Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Группа)) И НЕ Группа.Пустая() Тогда		
		ИмяКэша		= "ПервыеЭлементыГрупп";
		Результат 	= ПолучитьИзКэша(Группа, ИмяКэша);
		Если Результат = Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка
			|ИЗ
			|	Справочник."+Группа.Метаданные().Имя+"
			|ГДЕ
			|	Родитель = &Группа
			|	И НЕ ЭтоГруппа
			|УПОРЯДОЧИТЬ ПО
			|	ПометкаУдаления,
			|	Код
			|";
			Запрос.УстановитьПараметр("Группа", Группа);	
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				Результат = Выборка.Ссылка;					
			Иначе
				Результат = Группа;			
			КонецЕсли;
			
			ВставитьВКэш(Группа, Результат, ИмяКэша);
		КонецЕсли;
	Иначе
		Результат = Неопределено;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьПервыйЭлементВГруппе(Группа)
 

Функция ЗагрузитьСпр_ПодарочныеСертификаты_Элемент_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)
	Менеджер	= Справочники.ПодарочныеСертификаты;
	
	Ссылка		= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Ссылка));
	СпрОбъект	= Неопределено;
	
	Если (фСоздаватьОбъектыПоСсылкам ИЛИ ВернутьОбъект) 
		И НЕ ОбъектСуществует(Ссылка,"Справочник."+Ссылка.Метаданные().Имя) Тогда
		
		СпрОбъект	= Менеджер.СоздатьЭлемент();		
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
		
		СпрОбъект.Владелец		= Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(КС_ХДТО.Владелец));
		
		СпрОбъект.ВидСертификата	= ЗагрузитьСпр_ВидыПодарочныхСертификатов_КС(КС_ХДТО.ВидПодарочногоСертификата);
		СпрОбъект.Код				= КС_ХДТО.СерийныйНомер;
		СпрОбъект.Наименование		= КС_ХДТО.Штрихкод;	
		
		Если НЕ ВернутьОбъект Тогда			
			Ссылка		= ЗаписатьОбъект(СпрОбъект,Отправитель);		
		КонецЕсли;
	КонецЕсли;
	
	Если ВернутьОбъект И СпрОбъект=Неопределено Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();		 
	КонецЕсли;
	
	Возврат ?(ВернутьОбъект,СпрОбъект,Ссылка);	
КонецФункции //ЗагрузитьСпр_ПодарочныеСертификаты_КС(ОбъектХДТО,Отправитель=Неопределено)

Функция ЗагрузитьСпр_ФизическиеЛица_Элемент_КС(КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь)	
	Возврат ЗагрузитьСпр_КС("ФизическиеЛица",Новый Структура("Наименование","ФИО"),КС_ХДТО,Отправитель,ВернутьОбъект,Ложь);	
КонецФункции //ЗагрузитьСпр_Склады_Элемент_КС(ОбъектХДТО_КС,Отправитель=Неопределено)

Функция ЗагрузитьСпр_ФизическиеЛица_Элемент(ОбъектХДТО,Отправитель=Неопределено)	
	Возврат ЗагрузитьСпр_СТАНДАРТНО(Справочники.ФизическиеЛица,ОбъектХДТО,Ложь,Отправитель);
КонецФункции //ЗагрузитьСпр_ФизическиеЛица_Элемент(ОбъектХДТО_КС,Отправитель=Неопределено)

#Область Загрузка_Спарвочники_СлужебныеФункции


Функция ЗагрузитьСпр_КС(Вид,СтрокаРеквизитов,КС_ХДТО,Отправитель=Неопределено,ВернутьОбъект=Ложь,ЭтоГруппа=Ложь)	
	Менеджер	= Справочники[Вид];
	
	Если НЕ ЗначениеЗаполнено_(КС_ХДТО) Тогда Возврат Менеджер.ПустаяСсылка() КонецЕсли; 
	
	Если ПустаяСтрока(КС_ХДТО.Ссылка) Тогда
		Возврат ?(ВернутьОбъект,Неопределено,Менеджер.ПустаяСсылка());	
	КонецЕсли; 
	
	Ссылка		= ПолучитьСсылку(КС_ХДТО.Ссылка,Менеджер);
	СпрОбъект	= Неопределено;
	
	Если ТипЗнч(СтрокаРеквизитов)=Тип("Строка") Тогда
		МР	= Новый Структура(СтрокаРеквизитов);
	Иначе
		МР	= СтрокаРеквизитов;	
	КонецЕсли;	
	
	Если (фСоздаватьОбъектыПоСсылкам ИЛИ ВернутьОбъект) 
		И НЕ ОбъектСуществует(Ссылка,"Справочник."+Вид) Тогда
		
		СпрОбъект	= ?(ЭтоГруппа,Менеджер.СоздатьГруппу(),Менеджер.СоздатьЭлемент());
		СпрОбъект.УстановитьСсылкуНового(Ссылка);		
		
		ЗагрузитьРеквизитыОбъекта(СпрОбъект,КС_ХДТО,МР);
		
		Если ФР_ОбщегоНазначения_ПИ.ЭтоСправочникСГруппами(ЗначениеВСтрокуВнутр(ТипЗнч(Ссылка))) Тогда
			ГруппаХДТО	= ПолучитьСвойствоХДТО(КС_ХДТО,"Группа");
			Если ГруппаХДТО<>Неопределено Тогда
				СпрОбъект.Родитель = ЗагрузитьСпр_КС(Вид,СтрокаРеквизитов,ГруппаХДТО,Отправитель,,Истина);							
			КонецЕсли;			
		КонецЕсли; 
		
		Если НЕ ВернутьОбъект Тогда			
			Ссылка	= ЗаписатьОбъект(СпрОбъект,Отправитель);		
		КонецЕсли;
	КонецЕсли;
	
	Если ВернутьОбъект И СпрОбъект=Неопределено Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();		 
		
		Если фПерезаписыватьРеквизитыСправочников Тогда		
			ЗагрузитьРеквизитыОбъекта(СпрОбъект,КС_ХДТО,МР);
			
			Если ФР_ОбщегоНазначения_ПИ.ЭтоСправочникСГруппами(ЗначениеВСтрокуВнутр(ТипЗнч(Ссылка))) Тогда
				ГруппаХДТО	= ПолучитьСвойствоХДТО(КС_ХДТО,"Группа");
				Если ГруппаХДТО<>Неопределено Тогда
					СпрОбъект.Родитель = ЗагрузитьСпр_КС(Вид,СтрокаРеквизитов,ГруппаХДТО,Отправитель,,Истина);							
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ?(ВернутьОбъект,СпрОбъект,Ссылка);	
КонецФункции //ЗагрузитьСпр_КС(ОбъектХДТО,Отправитель=Неопределено)

Функция НайтиСоздатьСправочник(ТекстСсылки,Вид,ЭтоГруппа=Ложь)
	Менеджер	= Справочники[Вид];
	
	Результат 	= Новый Структура("Найден,Ссылка,Объект,ПолныйТип",Ложь,Менеджер.ПустаяСсылка(),Неопределено,Метаданные.Справочники[Вид].ПолноеИмя());	
	
	Если ТипЗнч(ТекстСсылки)=Тип("Строка") Тогда		
		Результат.Ссылка	= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекстСсылки));		
	ИначеЕсли ТипЗнч(ТекстСсылки)=ТипЗнч(Результат.Ссылка) Тогда
		Результат.Ссылка	= ТекстСсылки;
	КонецЕсли;	
	
	Если ОбъектСуществует(Результат.Ссылка,"Справочник."+Вид) Тогда			
		Результат.Найден	= Истина;
		Если фПерезаписыватьРеквизитыСправочников Тогда
			Результат.Объект = Результат.Ссылка.ПолучитьОбъект();		
		КонецЕсли;		
	Иначе
		Если ЭтоГруппа Тогда
			СпрОбъект	= Менеджер.СоздатьГруппу();
		Иначе
			СпрОбъект	= Менеджер.СоздатьЭлемент();		
		КонецЕсли;
		
		СпрОбъект.УстановитьСсылкуНового(Результат.Ссылка);
		
		Результат.Объект = 	СпрОбъект;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьСправочник(ТекстСсылки,Вид,ЭтоГруппа=Ложь)

Функция ЗагрузитьСпр_СТАНДАРТНО(Менеджер,ОбъектХДТО,ЭтоГруппа,Отправитель,ДопПараметры=Неопределено)
	МетаОбъект	= Менеджер.ПустаяСсылка().Метаданные();
	Имя			= МетаОбъект.Имя;
	Результат	= НайтиСоздатьСправочник(ОбъектХДТО.Ссылка,Имя,ЭтоГруппа);
	
	Если Результат.Найден И НЕ фПерезаписыватьРеквизитыСправочников Тогда
		Возврат Результат.Ссылка;		
	Иначе
		СпрОбъект	= Результат.Объект;		
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(СпрОбъект,ЗаполненныеСвойстваХДТО(ОбъектХДТО),,"Ссылка");
	
	ИмяПредопределенныхДанных	= ПолучитьСвойствоХДТО(ОбъектХДТО,"ИмяПредопределенныхДанных");
	Если ИмяПредопределенныхДанных<>Неопределено Тогда
		Попытка		
			СпрОбъект.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		Исключение					
		КонецПопытки;	
	КонецЕсли; 
	
	ИменаТЧ	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ИменаТЧ","");
	Если НЕ ПустаяСтрока(ИменаТЧ) Тогда		
		ЗагрузитьТЧОбъекта(СпрОбъект,ОбъектХДТО,ИменаТЧ);
	КонецЕсли;	
	
	Возврат ЗаписатьОбъект(СпрОбъект,Отправитель);
КонецФункции //ЗагрузитьСпр_СТАНДАРТНО()


#КонецОбласти


#КонецОбласти


#Область Загрузка_СлужебныеФункции


Процедура УстановитьРеквизитОбъекта(Объект,Имя,Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		Объект[Имя]=Значение;	
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьРеквизитыОбъекта(Объект,ОбъектХДТО,МассивРеквизитов)
	Для Каждого Элемент Из МассивРеквизитов Цикл
		ИмяРеквизитаТек			= Элемент.Ключ;			
		ИмяРеквизитаХДТО		= ?(ЗначениеЗаполнено(Элемент.Значение),Элемент.Значение,ИмяРеквизитаТек);
			
		Объект[ИмяРеквизитаТек]	= ОбъектХДТО[ИмяРеквизитаХДТО];
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьСсылку(ДанныеСсылки,Менеджер)
	Результат = Менеджер.ПустаяСсылка();
	
	Если ТипЗнч(ДанныеСсылки)=Тип("Строка") Тогда
		Результат	= Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеСсылки))
	ИначеЕсли ТипЗнч(ДанныеСсылки)=ТипЗнч(Результат) Тогда
		Результат	= ДанныеСсылки;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()

Функция ЗагрузитьТЧОбъекта(Объект,ОбъектХДТО,ИменаТЧ,ДопПараметы=Неопределено)
	Для Каждого ИмяТЧ Из СтрРазделить(ИменаТЧ,",") Цикл		
		текДопПараметры	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметы,ИмяТЧ);
		СоотвРеквизитов	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(текДопПараметры,"СоответствиеРеквизитов",Новый Структура);
		
		ТЧ_Объекта	= Объект[ИмяТЧ];
		
		МетаТЧ		= Объект.Метаданные().ТабличныеЧасти[ИмяТЧ];
		ЕстьЕдиница	= (МетаТЧ.Реквизиты.Найти("Единица")<>Неопределено); 
		
		ТЧ_Объекта.Очистить();
		ТЧ_ХДТО	= ПолучитьСвойствоХДТО(ОбъектХДТО,ИмяТЧ);
		Если ТЧ_ХДТО<>Неопределено Тогда
			Для Каждого СтрокаТЧ_ХДТО Из ТЧ_ХДТО.Строка Цикл
				СтрокаТЧ	= ТЧ_Объекта.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЧ_ХДТО);
				
				Харка_ХДТО	= ПолучитьСвойствоХДТО(СтрокаТЧ_ХДТО,"ХарактеристикаНоменклатуры");
				Если Харка_ХДТО<>Неопределено И Харка_ХДТО<>Справочники.Номенклатура.ПустаяСсылка() Тогда
					СтрокаТЧ.Номенклатура	= Харка_ХДТО;
				КонецЕсли;
				Если ЕстьЕдиница Тогда
					СтрокаТЧ.Единица	= ЕдиницаШт(СтрокаТЧ.Номенклатура);				
				КонецЕсли; 
				Для Каждого Элемент Из СоотвРеквизитов Цикл
					СтрокаТЧ[Элемент.Ключ]	= СтрокаТЧ_ХДТО[Элемент.Значение];
				КонецЦикла;
			КонецЦикла; 			
		КонецЕсли;
	КонецЦикла;
КонецФункции //ЗагрузитьТЧОбъекта(Объект,ОбъектХДТО,ИменаТЧ)

Функция ЕдиницаШт(Номенклатура)
	Результат	= Справочники.Единицы.ПустаяСсылка();
	Выборка		= Справочники.Единицы.Выбрать(,Номенклатура);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОКЕИ	= Ед_Штука Тогда
			Результат	= Выборка.Ссылка;
			
			Если НЕ Выборка.ПометкаУдаления Тогда Прервать КонецЕсли;			
		КонецЕсли;	
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции // ()
 

#КонецОбласти 


#Область Регламент

Процедура Сформировать(ТаблицаПараметров=Неопределено) Экспорт	
	Если НЕ ФР_ОбщегоНазначения_ПИ.МожноЗапускатьАвтоОбмен() Тогда
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Внешнее задание: Обмен с франч базой. Недопустимая строка соединения текущей ИБ !","Информация");		
		Возврат;			
	Иначе
		
	КонецЕсли;
	
	СтрПараметров="";
	мПараметры=Новый Соответствие;
	Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		мПараметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		СтрПараметров=Символы.ПС+СтрПараметров+СтрокаТП.Имя+" - "+СтрокаТП.Значение
	КонецЦикла;
	
	ЗаписатьВЛог("Регламент","Задача: Внешнее задание: Обмен с франч базой. Запуск ! "+Символы.ПС+СтрПараметров,"Информация");		
	
	Направления	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(мПараметры,"Направление");
	Для Каждого Направление Из СтрРазделить(Направления,",") Цикл
		Если Направление="Прием" ИЛИ Направление="Отправка" Тогда
			Если НЕ ЗаданиеАктивно(Направление) Тогда
				ФР_Регламент.ЗапуститьФЗ_Обмена("ФР_ОбменСФРК",Направление,мПараметры);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаданиеАктивно(Направление)
	Ключ		= "ОбменСТЦ.ЦО."+Направление;
	
	Результат		= Ложь;
	МассивЗаданий	= ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ",Ключ));
	Для Каждого ФЗ Из МассивЗаданий Цикл
		Если ФЗ.Состояние=СостояниеФоновогоЗадания.Активно Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ЗаданиеАктивно(Направление)

Функция ПолучитьПараметры() Экспорт
	МП	= Новый Массив;
	
	МП.Добавить(Новый Структура("Имя,Значение,Комментарий","Направление","Отправка","""Отправка"",""Прием"""));
	МП.Добавить(Новый Структура("Имя,Значение,Комментарий","КоличествоЦиклов",1,"Кол-во циклов (0-бесконечно)"));	
	
	Возврат МП;
КонецФункции //ПолучитьПараметры() Экспорт


#КонецОбласти 

#Область Сверки
	
Функция ВыгрузитьОстатки() Экспорт	
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	КоличествоНачальныйОстаток  КАК КолНачИст,
	|	КоличествоПриход			КАК КолПрихИст,
	|	КоличествоРасход			КАК КолРасхИст,
	|	КоличествоКонечныйОстаток	КАК КолКонИст
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1,&Дата2,,,
	|		Склад.Подразделение = &ПодразделениеПолучатель	
	|		И Склад.ВидСклада=ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
	|	)
	|";			
	
	Запрос.УстановитьПараметр("Дата1",		НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",		КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("ПодразделениеЦО",			ПодразделениеЦО);	
	Запрос.УстановитьПараметр("ПодразделениеПолучатель",	ПодразделениеПолучатель);	
	
	Сч			= 0;
	
	НачВремя	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат	= Запрос.Выполнить();	
	
	ТД	= Результат.Выгрузить();
	
	ТД.Колонки.Добавить("ХарактеристикаНоменклатурыУИД");
	Для Каждого СтрокаТЧ Из ТД Цикл
		СтрокаТЧ.ХарактеристикаНоменклатурыУИД	= СтрокаТЧ.Номенклатура.УникальныйИдентификатор();
	КонецЦикла; 
	
	ПараметрыСверки	= Новый Структура("ПодразделениеПолучатель,ОборотыПоОстаткам,Дата1,Дата2",ПодразделениеПолучатель.УникальныйИдентификатор(),ТД,Дата1,Дата2);
	
	Результат = ЗначениеВСтрокуВнутр(ПараметрыСверки);
	
	ВремяОбработки	= Формат((ТекущаяУниверсальнаяДатаВМиллисекундах()-НачВремя)/1000,"ЧДЦ=3");
	
	Сообщить(СтрШаблон("Выгружено: %1 строк, остаток: %2, время обработки: %3.",ТД.Количество(),ТД.Итог("КолКонИст"),ВремяОбработки));	   
	
	Возврат Результат;	
КонецФункции //ВыгрузитьОстатки()

#КонецОбласти

Функция ЗаполнитьУзлыОбмена()
	КодУзлаОтправителя	= ПланыОбмена.Основной.ЭтотУзел().Код;
	КодУзлаПолучателя	= "CO_FR"; //Выгрузка только в ЦО
	
	УзелОтправитель		= ПланыОбмена.ФР_ОбменСФРК.НайтиПоКоду(КодУзлаОтправителя);
	УзелПолучатель		= ПланыОбмена.ФР_ОбменСФРК.НайтиПоКоду(КодУзлаПолучателя);	
КонецФункции // () 

Функция СоответствиеЗначенийПеречислений()
	С	= Новый Соответствие;
	
	С.Вставить("ВидыОперацийРКО.Инкассация",	 		"ИнкассацияДенежныхСредств");
	С.Вставить("ВидыОперацийРКО.ПрочийРасход", 		"РасходДенежныхСредствПрочее");
	С.Вставить("ВидыОперацийПКО.ПрочийПриход", 		"ПриходДенежныхСредствПрочее");	
	
	С.Вставить("СостоянияСогласования.Согласовано",		"Согласован");
	С.Вставить("СостоянияСогласования.НаСогласовании",	"НаСогласованииЦО");	
	С.Вставить("СостоянияСогласования.НеСогласовано",	"ОтмененЦО");
	
	С.Вставить("СостоянияСогласования.НеСогласовано",	"ОтмененЦО");
	
	С.Вставить("ВидыОперацийПС.ВыдачаДенегИзСейфа",		"ПереводДенегВСейф");	
	
	С.Вставить(Перечисления.ВидыОперацийРКО.ИнкассацияДенежныхСредств,		"ИнкассацияДенежныхСредств");
	С.Вставить(Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее,		"ПриходДенежныхСредствПрочее");
	
	С.Вставить(Перечисления.СостоянияСогласования.НаСогласованииКонтрагент,	"НаСогласовании");
	С.Вставить(Перечисления.СостоянияСогласования.НаСогласованииЦО,		"НаСогласовании");
	С.Вставить(Перечисления.СостоянияСогласования.НаСогласованииКонтрагент,	"НаСогласовании");
	С.Вставить(Перечисления.СостоянияСогласования.НаСогласованииЦО,		"НаСогласовании");
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	С.Вставить("ВидыОперацийПКО.ВозвратОтПодотчетногоЛица",	"ВозвратАвансовыйОтчет");
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Возврат С;
КонецФункции //ЗаполнитьСоответствиеПеречислений()

Функция ИнициализироватьКомпонентуОбмена(ТекУзелПолучатель) Экспорт
	УзелСПараметрами	= ФР_ОбщегоНазначения_ПИ.ЭтотУзел("ФР_ОбменСФРК");
	
	АдресСервера		= УзелСПараметрами.АдресОчереди;
	Пользователь		= УзелСПараметрами.Пользователь;
	Пароль				= УзелСПараметрами.Пароль;		
	
	Результат	= ФР_Регламент.ИнициализироватьКомпонентуОбмена(АдресСервера,"Прием",Пользователь,Пароль,"Обмен с узлом: "+ТекУзелПолучатель);
	
	Если Результат.Результат Тогда
		КомпонентаОбмена=Результат.КомпонентаОбмена;	
	Иначе
		КомпонентаОбмена=Неопределено;
	КонецЕсли; 
	
	Возврат  Результат.Результат;
КонецФункции //ИнициализироватьКомпонентуОбмена(ТекУзелПолучатель)
  
Функция ПодразделениеРНК(РНК_Ссылка) Экспорт
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Реквизиты.ЗначениеРеквизита КАК Справочник.Подразделения) КАК Подразделение	
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Накладные
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.РеквизитыСправочников КАК Реквизиты
	|ПО 
	|	Накладные.ПунктДоставки = Реквизиты.Справочник
	|	И Реквизиты.ИмяРеквизита = ""ПодразделениеФранчайзинга""	
	|ГДЕ
	|	Накладные.Ссылка = &РНК_Ссылка	
	|";
	
	Запрос.УстановитьПараметр("РНК_Ссылка",РНК_Ссылка);
	
	//Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	//Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	Результат = Справочники.Подразделения.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат=Выборка.Подразделение;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПодразделениеРНК(РНК_Ссылка) Экспорт

Функция ПодразделениеКонтрагента_OLD(Контрагент_Ссылка) Экспорт
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(Реквизиты.ЗначениеРеквизита КАК Справочник.Подразделения) КАК Подразделение	
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Накладные
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.РеквизитыСправочников КАК Реквизиты
	|ПО 
	|	Накладные.ПунктДоставки = Реквизиты.Справочник
	|	И Реквизиты.ИмяРеквизита = ""ПодразделениеФранчайзинга""	
	|ГДЕ
	|	Накладные.Контрагент = &Контрагент_Ссылка	
	|	И Накладные.Проведен	
	|	И НЕ ВЫРАЗИТЬ(Реквизиты.ЗначениеРеквизита КАК Справочник.Подразделения).ВерсияДанных ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Контрагент_Ссылка",Контрагент_Ссылка);
	
	Результат = Справочники.Подразделения.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат=Выборка.Подразделение;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПодразделениеКонтрагента(Контрагент_Ссылка) Экспорт

Функция ПодразделениеКонтрагента(Контрагент_Ссылка) Экспорт
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ
	|	Ссылка КАК Подразделение
	|ИЗ
	|	Справочник.Подразделения
	|ГДЕ
	|	КонтрагентФР = &Контрагент_Ссылка
	|УПОРЯДОЧИТЬ ПО 
	|	ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Контрагент_Ссылка",Контрагент_Ссылка);
	
	Результат = Справочники.Подразделения.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат=Выборка.Подразделение;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПодразделениеКонтрагента(Контрагент_Ссылка) Экспорт

Функция ОрганизацияПодразделения(Подразделение) Экспорт	
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Организация
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Подразделение = &Подразделение
	|	И НЕ Организация.ВерсияДанных ЕСТЬ NULL
	|	И НЕ ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Результат = Справочники.Организации.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Организация) Тогда
		Результат=Выборка.Организация;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()
 
Функция ПолучитьМенеджер(ПолноеИмяТипа) Экспорт	
	ПолноеИмяТипаТек	= ПолучитьПолноеИмяТипаТек(ПолноеИмяТипа);
	Менеджер			= ФР_ОбщегоНазначения_КС.ПолучитьМенеджер(ПолноеИмяТипаТек,КэшМенеджеров);
	
	Возврат Менеджер;
КонецФункции //ПолучитьМенеджер(ПолноеИмяТипа)

Функция ПолучитьПолноеИмяТипаТек(ИмяТипаНов) Экспорт
	ИмяТипаТек=СоответствиеТипов_Нов_Стар.Получить(ИмяТипаНов);
	Возврат ?(ИмяТипаТек=Неопределено,ИмяТипаНов,ИмяТипаТек);
КонецФункции //ПолучитьПолноеИмяТипаТек() 

Процедура ЗаполнитьСтрокуРегистрации_РС(СтрокаТО,Вид,Отбор) Экспорт
	НЗ=РегистрыСведений[Вид].СоздатьНаборЗаписей();
	Для Каждого Элемент Из Отбор Цикл
		НЗ.Отбор[Элемент.Ключ].Установить(Элемент.Значение,Истина);	
	КонецЦикла;	
	
	СтрокаТО.ВариантВыгрузки="РегистрСведений."+Вид;
	
	СтрокаОтбора			= ЗначениеВСтрокуВнутр(НЗ.Отбор);
	СтрокаТО.ОтборРС		= Новый ХранилищеЗначения(СтрокаОтбора);
	СтрокаТО.ОтборРС_Хэш 	= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаОтбора);
КонецПроцедуры 

Функция ЗарегистрироватьНоменклатуруПоНакладным(МассивСсылок, ДопПараметры=Неопределено) Экспорт	
	Результат		= Новый Структура("Ошибки,Сообщения",Новый Массив,Новый Массив);	
	
	Запрос			= СоздатьЗапросПоНоменклатуреНакладных(МассивСсылок);
	
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура КАК Ссылка,
	|	Модель
  	|ИЗ
	|	ВТ_Номенклатура	
	|УПОРЯДОЧИТЬ ПО 	
	|	Номенклатура.Наименование	
	|";	
	
	
	ТекРез	= ЗарегистрироватьВыборку(Запрос,"Справочник.ХарактеристикиНоменклатуры","Элемент",ДопПараметры);
	Результат.Сообщения.Добавить(СтрШаблон("Зарегистрировано характеристик: %1",ТекРез.Зарегистрировано));	
	
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	Модель КАК Ссылка
  	|ИЗ
	|	ВТ_Номенклатура	
	|УПОРЯДОЧИТЬ ПО 	
	|	Модель.Наименование	
	|";	
	
	ТекРез	= ЗарегистрироватьВыборку(Запрос,"Справочник.Номенклатура","Элемент",ДопПараметры);
	Результат.Сообщения.Добавить(СтрШаблон("Зарегистрировано моделей: %1",ТекРез.Зарегистрировано));	
	
	Возврат Результат;
КонецФункции

Функция ЗарегистрироватьДекларацииПоНакладным(МассивСсылок, ДопПараметры=Неопределено) Экспорт	
	Результат		= Новый Структура("Ошибки,Сообщения",Новый Массив,Новый Массив);
	
	Если МассивСсылок.Количество()=0 Тогда 
		Результат.Ошибки.Добавить("На входе пустой массив ссылок на документы.");
		Возврат Результат;
	КонецЕсли;
	
	Запрос			= СоздатьЗапросПоНоменклатуреНакладных(МассивСсылок);
	
	Запрос.Текст	= "	
	|ВЫБРАТЬ 	
	|	История.Объект			КАК Объект,
	|	История.Реквизит		КАК Реквизит,
	|	История.Значение		КАК Значение,
	|	История.Документ		КАК Документ,
	|	ПоследниеПериоды.Период	КАК Период	
	|ИЗ
	|	РегистрСведений.История	КАК История
	|ПРАВОЕ СОЕДИНЕНИЕ	
	|(
	|ВЫБРАТЬ
	|	Объект 				КАК Номенклатура,
	|	Реквизит			КАК Реквизит,
	|	МАКСИМУМ(Период)	КАК Период
	|ИЗ
	|	РегистрСведений.История
	|ГДЕ 	
	|	Объект ССЫЛКА Справочник.Номенклатура
	|	И Реквизит = ""Декларация""
	|	И НЕ ВЫРАЗИТЬ(Объект КАК Справочник.Номенклатура).ВерсияДанных ЕСТЬ NULL
	|	И Объект В (ВЫБРАТЬ РАЗЛИЧНЫЕ Модель ИЗ ВТ_Номенклатура)
	|СГРУППИРОВАТЬ ПО
	|	Объект,
	|	Реквизит
	|) КАК ПоследниеПериоды
	|ПО
	|	История.Период = ПоследниеПериоды.Период
	|	И История.Объект ССЫЛКА Справочник.Номенклатура
	|	И История.Объект	= ПоследниеПериоды.Номенклатура
	|	И История.Реквизит	= ПоследниеПериоды.Реквизит	
	|УПОРЯДОЧИТЬ ПО Объект
	|";
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();	
	
	Выборка		= Запрос.Выполнить().Выбрать();
	
	Сч			= Выборка.Количество();	
	
	Декларации	= Новый  Соответствие;
	
	Пока Выборка.Следующий() Цикл		
		НЗ	= РегистрыСведений.История.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Период.Установить(Выборка.Период,Истина);	
		НЗ.Отбор.Объект.Установить(Выборка.Объект,Истина);
		НЗ.Отбор.Реквизит.Установить(Выборка.Реквизит,Истина);
		НЗ.Отбор.Документ.Установить(Выборка.Документ,Истина);
		
		СтрокаТО	= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка		= Выборка.Объект;		
		СтрокаТО.ВариантВыгрузки	= "РегистрСведений.История";
		СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
		СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);	
		
		СтрокаТО	= ТО.Добавить();		
		СтрокаТО.ОбъектСсылка		= Выборка.Значение;
		
		Декларации.Вставить(Выборка.Значение);
	КонецЦикла; 
			
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО, ДопПараметры);	
	
	Результат.Сообщения.Добавить(СтрШаблон("Выгружено: %1 записей истории.",	Выборка.Количество()));
	Результат.Сообщения.Добавить(СтрШаблон("Выгружено: %1 декларации.",			Декларации.Количество()));
	
	Возврат Результат;
КонецФункции

Функция ЗарегистрироватьШКПоНакладным(МассивСсылок, ДопПараметры=Неопределено) Экспорт	
	Результат		= Новый Структура("Ошибки,Сообщения",Новый Массив,Новый Массив);
	
	Если МассивСсылок.Количество()=0 Тогда 
		Результат.Ошибки.Добавить("На входе пустой массив ссылок на документы.");
		Возврат Результат;
	КонецЕсли;
	
	Запрос			= СоздатьЗапросПоНоменклатуреНакладных(МассивСсылок);
	
	Запрос.Текст	= "	
	|ВЫБРАТЬ 	
	|	ШтрихКоды.Ссылка КАК ОбъектСсылка
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ПРАВОЕ СОЕДИНЕНИЕ	
	|(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ ВТ_Номенклатура
	|) КАК СписокНоменклатуры
	|ПО
	|	ШтрихКоды.Владелец = СписокНоменклатуры.Номенклатура
	|ГДЕ
	|	ШтрихКоды.ТипШК	= ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И НЕ ШтрихКоды.Наименование ПОДОБНО  ""%99999%""	
	|";
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();	
	
	Выборка		= Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		СтрокаТО	= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка		= Выборка.ОбъектСсылка;		
		СтрокаТО.ВариантВыгрузки	= "Элемент";
	КонецЦикла; 
			
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО, ДопПараметры);	
	
	Результат.Сообщения.Добавить(СтрШаблон("Выгружено: %1 штрих кодов.",	Выборка.Количество()));	
	
	Возврат Результат;
КонецФункции

Функция СоздатьЗапросПоНоменклатуреНакладных(МассивСсылок)
	Запрос							= Новый ("Запрос");
	Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	
	ТекстыЗапросов	= Новый Массив;
	ШаблонЗапроса	= "
	|ВЫБРАТЬ 
	|	Номенклатура,
	|	Номенклатура.Родитель КАК Модель	
	|ИЗ 
	|	%1.Товары
	|ГДЕ 			
	|	Ссылка В (&%2)
	|";
	
	Для Каждого ЭлементТипа Из ФР_ОбщегоНазначения_КС.РассортироватьПоТипам(МассивСсылок) Цикл
		Тип				= ЭлементТипа.Ключ;
		ИмяПараметра	= СтрЗаменить(Тип,".","_");
		
		Запрос.УстановитьПараметр(ИмяПараметра,ЭлементТипа.Значение);	
		
		ТекстыЗапросов.Добавить(СтрШаблон(ШаблонЗапроса,Тип,ИмяПараметра));
	КонецЦикла; 
	
	Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Модель,
	|	Номенклатура	
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ	
	|(
	|	"+СтрСоединить(ТекстыЗапросов,"ОБЪЕДИНИТЬ"+Символы.ПС)+"
	|) КАК Сводный
	|
	|";

	Запрос.Выполнить();	

	Возврат Запрос;
КонецФункции //СоздатьЗапросПоНоменклатуреНакладных()

Функция СравнитьЗначенияПеречисления(Зн1,Зн2) Экспорт
	Результат = 0;
	
	Тип1 = ТипЗнч(Зн1);
	Если ТипЗнч(Зн1)=ТипЗнч(Зн2) Тогда
		МетаПер = Метаданные.НайтиПоТипу(Тип1);
		Если МетаПер<>Неопределено И Метаданные.Перечисления.Содержит(МетаПер) Тогда
			Менеджер = Перечисления[МетаПер.Имя];
			
			Индекс1 = ?(ЗначениеЗаполнено(Зн1),Менеджер.Индекс(Зн1),-1);	
			Индекс2 = ?(ЗначениеЗаполнено(Зн2),Менеджер.Индекс(Зн2),-1);	
			
			Если Индекс1<Индекс2 Тогда
				Результат = -1;			
			ИначеЕсли Индекс1=Индекс2 Тогда
				Результат = 0;
			Иначе
				Результат = 1;		
			КонецЕсли;					
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //СравнитьЗначенияПеречисления(Зн1,Зн2)

Фабрика						= СоздатьМоюФабрикуХДТО();
Сериализатор				= Новый СериализаторXDTO(Фабрика);

Ед_Штука					= Справочники.ОКЕИ.НайтиПоКоду("796");
Если Ед_Штука.Пустая() Тогда
	Сообщить_("Не найдена единица ""шт"" !!!!",СтатусСообщения.Важное);
КонецЕсли; 

ИБ_SSP	= Справочники.ИБ.НайтиПоКоду("SSP");

ЗаполнитьСоответствия();

ДанныеШтуки					= Новый Структура("Ссылка,УИД,Код,Наименование",Ед_Штука,""+Ед_Штука.УникальныйИдентификатор(),Ед_Штука.Код,Ед_Штука.Наименование);

ТекПодразделение			= ПланыОбмена.Основной.ЭтотУзел().Подразделение;
ПодразделениеЦО				= ТекПодразделение;

ПространствоИмен_СТ			= "http://www.w3.org/2001/XMLSchema";
ПространствоИмен_ЕД			= "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.6";
ПространствоИмен_ЕЕ			= "http://www.pf-soft.ru/ee-data";
ПространствоИмен_ТК			= "http://v8.1c.ru/8.1/data/enterprise/current-config";
ПространствоИмен_ЕМ			= "http://www.1c.ru/SSL/Exchange/Message";

ВалютаРубХДТО				= ВыгрузитьСпр_Валюты_КС(Справочники.Валюты.НайтиПоКоду("810"));

ПростыеРеквизиты	= Новый Соответствие;

ТекПакет			= Неопределено;
КомпонентаОбмена    = Неопределено;

ВыгружаемыеХарактеристки	= Новый Массив;

ВалютаНац			= Константы.НациональнаяВалюта.Получить();

Кэши				= Новый Соответствие;
КэшМенеджеров		= Новый Соответствие;
РеквизитыШапок		= Новый Соответствие;

УзелПолучатель		= ПланыОбмена.ФР_ОбменСФРК.НайтиПоКоду("MSB");
мУзелПолучатель		= ПланыОбмена.ФР_ОбменСФРК.НайтиПоКоду("MSB");

ПустаяСсылка_Спр_Контрагенты	= Справочники.Контрагенты.ПустаяСсылка();
ПустаяСсылка_Спр_Организации	= Справочники.Организации.ПустаяСсылка();

КонтрагентЭквайринг	= Справочники.Контрагенты.НайтиПоКоду("SSP-0564");

ЗаполнитьУзлыОбмена();

НазначениеТипаХМЛ	= НазначениеТипаXML.Явное;

ОбработчикиЗагрузки	= ПолучитьОбработчикиЗагрузки();

СВ_ПодразделениеРНК 	= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00295");
СВ_СкладПолРНК			= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00296");
СВ_ОрганизацияКонтр 	= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00297");
