
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Если рПроверки.ОшибкиНоменклатуры.Количество()>0 Тогда
		ФормаОбработки = ПолучитьФорму("Обработка.ПроверкаКарточекДляНК.Форма.Форма", Новый Структура,, 1);
		
		ФормаОбработки.Открыть();
		ФормаОбработки.ВывестиРезультатыПроверки(рПроверки.ОшибкиНоменклатуры);
	КонецЕсли;
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла; 
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		//УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", Перечисления.СтатусыДокументовМаркировки.КОбработке, ""));
		УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке));
		
		рОбработки = МаркировкаВС.ОтправитьНаОбработку_ЗаказКМ(ДокСсылка);		
		
		Если рОбработки.Успешно Тогда
			ОповеститьОбИзменении(ДокСсылка);
			Оповестить("ИзмененСтатус", , ДокСсылка);	
		Иначе
			Сообщить(СтрСоединить(рОбработки.Ошибки, Символы.ПС), СтатусСообщения.Важное);
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры

 
&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиНоменклатуры,ОшибкиДокументов,ДокументыКОбработке", Неопределено, Новый Массив, Новый Массив);
	
	ОбработкаПроверки = Обработки.ПроверкаКарточекДляНК.Создать();
	
	Для Каждого ДокСсылка Из мСсылки Цикл	
		//Чирков 2025.02.28 +++ По просьбе Алексея Петрова отключен контроль статуса карточек при заказе КМ
		//тОшибок = ОбработкаПроверки.ПроверитьДанныеТоваровДляМаркировки(ДокСсылка, , Истина);	
		тОшибок = ОбработкаПроверки.ПроверитьДанныеТоваровДляМаркировки(ДокСсылка, , Ложь);	
		//Чирков 2025.02.28 ---
		
		//+++Чирков 05.06.2025 по просьбе Петрова отключена проверка номенклатуры  
  		тОшибок.Очистить();
  		//---Чирков 05.06.2025
		Если Результат.ОшибкиНоменклатуры = Неопределено Тогда
			Результат.ОшибкиНоменклатуры = тОшибок;
		Иначе
			Для Каждого СтрокаИст Из тОшибок Цикл
				СтрокаПол = Результат.ОшибкиНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПол, СтрокаИст);			
			КонецЦикла; 
		КонецЕсли;
				
		Если тОшибок.Количество() = 0 Тогда
			рПроверки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка);
			Если рПроверки.Успешно Тогда
				Результат.ДокументыКОбработке.Добавить(ДокСсылка);
			Иначе
				МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
			КонецЕсли;			
		КонецЕсли; 
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)


 
