
#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Ихсанов Д. А. Начало 16.06.2026 Изменение 0000000019 от 21.05.2026 13:00:05: e1cib/data/Документ.Изменение?ref=89690050568f680711f154fbd6fa2dc8
// Получить поля регистра сведений.
// 
// Параметры:
//  ИмяРегистраСведений - Строка - Имя регистра сведений
// 
// Возвращаемое значение:
//  Массив Из Строка - Получить поля регистра сведений
Функция ПолучитьПоляРегистраСведений(ИмяРегистраСведений) Экспорт
	
	// Инициализация
	МассивПолей = Новый Массив;
	
	// Получим метаданные регистра сведений
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистраСведений];
	
	// Обработаем получение всех измерений регистра
	Для каждого Измерение из МетаданныеРегистра.Измерения Цикл
		МассивПолей.Добавить(Измерение.Имя);
	КонецЦикла;
	
	// Обработаем получение всех ресурсов регистра
	Для каждого Ресурс из МетаданныеРегистра.Ресурсы Цикл
		МассивПолей.Добавить(Ресурс.Имя);
	КонецЦикла;
	
	// Обработаем получение всех реквизитов регистра
	Для каждого Реквизит из МетаданныеРегистра.Реквизиты Цикл
		МассивПолей.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат МассивПолей;
	
КонецФункции // ПолучитьПоляРегистра()
// Ихсанов Д. А. Конец 16.06.2026

#КонецЕсли       



Функция ПолучитьИмяИсходящейОчередиДокФлоуПоИмениОбъекта (ИмяОбъекта) Экспорт
	
	СтруктураВозврата = МаркировкаКС.СтруктураРезультата(Истина);
	
	ЭтоЖиваяБаза = ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза();
	Постфикс = "";
	Если Не ЭтоЖиваяБаза Тогда  
		Постфикс = "Тест";
	КонецЕсли;
	
	Если ИмяОбъекта = "ЗаявкаНаОплату" Тогда 
		ИмяПредопределенныхДанныхКлючаХранилища = "ДанныеDocFlowRabbitЗНОИсходящийПоток";
	Иначе
		ИмяПредопределенныхДанныхКлючаХранилища = "ДанныеDocFlowRabbit" + ИмяОбъекта+"ИсходящийПоток";
	КонецЕсли;	                                                                                      
	ИмяПредопределенныхДанныхКлючаХранилища =  ИмяПредопределенныхДанныхКлючаХранилища +  Постфикс;
	
	Попытка	
		КлючХранилища = Справочники.КлючиБезопасногоХранилищаДанных[ИмяПредопределенныхДанныхКлючаХранилища];
	Исключение 
		СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Не найден ключ безопасного хранилища данных  %1", ИмяПредопределенныхДанныхКлючаХранилища)); 
		КлючХранилища = Неопределено;
	КонецПопытки;         
	
	Если КлючХранилища = Неопределено тогда     
		СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Отсутствует ключ безопасного хранения исходящей очереди %1", ИмяОбъекта));  
	Иначе
		ДанныеКлюча = РаботаСБезопаснымХранилищемСервер.ПрочитатьДанныеАвторизацииПоКлючу(КлючХранилища); 
		Если ТипЗнч(ДанныеКлюча) = Тип("Структура") и ДанныеКлюча.Свойство("Ресурс") и ЗначениеЗаполнено(ДанныеКлюча.Ресурс) Тогда   
			СтруктураВозврата.Данные = ДанныеКлюча.Ресурс;
		Иначе 
			СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Не заполнено имя исходящей очереди  %1", ИмяОбъекта)); 	
		КонецЕсли; 	
	КонецЕсли;     
	
	Если СтруктураВозврата.Ошибки.Количество () > 0 Тогда     
		СтруктураВозврата.Успешно = Ложь;   
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции      


Функция ПолучитьМассивИменВходящихОчередейДокФлоу () Экспорт 
	
	СтруктураВозврата = МаркировкаКС.СтруктураРезультата(Истина);

	ЭтоЖиваяБаза = ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза();
	Постфикс = "";
	Если Не ЭтоЖиваяБаза Тогда  
		Постфикс = "Тест";
	КонецЕсли;
	
	МассивОчередей = новый Массив;   
	ДополнитьМассивИменОчередейДокФлоуПоКлючу(МассивОчередей, "ДанныеDocFlowRabbitЗНОВходящийПоток" + Постфикс, СтруктураВозврата.Ошибки);
	ДополнитьМассивИменОчередейДокФлоуПоКлючу(МассивОчередей, "ДанныеDocFlowRabbitКонтрагентыВходящийПоток" + Постфикс, СтруктураВозврата.Ошибки);
	ДополнитьМассивИменОчередейДокФлоуПоКлючу(МассивОчередей, "ДанныеDocFlowRabbitДоговорыВходящийПоток" + Постфикс, СтруктураВозврата.Ошибки);
	ДополнитьМассивИменОчередейДокФлоуПоКлючу(МассивОчередей, "ДанныеDocFlowRabbitБанковскиеСчетаВходящийПоток" + Постфикс, СтруктураВозврата.Ошибки);
	
	Если СтруктураВозврата.Ошибки.Количество () > 0 Тогда     
		СтруктураВозврата.Успешно = Ложь;   
	КонецЕсли;               
	
    СтруктураВозврата.Данные = МассивОчередей;
	
	Возврат СтруктураВозврата;
			
КонецФункции           

  
 //Кухарь А.Ю. 08.07.2026 Начало 
//Изменение 0000000223
Функция ПолучитьКонтрагентаНеИзменяемыйОстаток() Экспорт

	Возврат ОбщегоНазначенияС.ПрочитатьРСРеквизитСправочникаСервер("Неизменяемый остаток", Неопределено
		, Неопределено);

КонецФункции      

Функция ДляНакладнойТребуютсяПроводкиПоОстаткамПланов (Знач Ссылка, Знач Контрагент) Экспорт
	
	Результат = Ложь;  
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() Тогда	
		Если Контрагент = ПолучитьКонтрагентаНеИзменяемыйОстаток() Тогда
			Запрос = Новый Запрос;        
			Запрос.УстановитьПараметр("Накладная",Ссылка);
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	РС.Накладная КАК Накладная
			|ИЗ
			|	РегистрСведений.РаспределениеПлановПродажПоНакладным КАК РС
			|ГДЕ
			|	РС.Накладная = &Накладная";
			Выборка = Запрос.Выполнить();
			Если Не Выборка.Пустой() Тогда    
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;    
	КонецЕсли;	    
	
	Возврат Результат;
	
КонецФункции

//Кухарь А.Ю. 08.07.2026 Конец 



#КонецОбласти   

// Кухарь А.Ю.  18.06.2026 начало
// Изменение 0000000204
#Область СлужебныеПроцедурыИФункции         

Процедура ДополнитьМассивИменОчередейДокФлоуПоКлючу(МассивОчередей, ИмяКлюча, МассивОшибок)    
	
	КлючХранилища = Справочники.КлючиБезопасногоХранилищаДанных[ИмяКлюча];	
	Если КлючХранилища = Неопределено тогда     
		МассивОшибок.Добавить(СтрШаблон("Отсутствует ключ безопасного хранения  очереди %1", ИмяКлюча));  
	Иначе
		ДанныеКлюча = РаботаСБезопаснымХранилищемСервер.ПрочитатьДанныеАвторизацииПоКлючу(КлючХранилища); 
		Если ТипЗнч(ДанныеКлюча) = Тип("Структура") и ДанныеКлюча.Свойство("Ресурс") и ЗначениеЗаполнено(ДанныеКлюча.Ресурс) Тогда   
			МассивОчередей.Добавить(ДанныеКлюча.Ресурс);
		Иначе 
			МассивОшибок.Добавить(СтрШаблон("Не заполнено адрес очереди  %1", ИмяКлюча)); 	
		КонецЕсли; 	
	КонецЕсли;    
		
Конецпроцедуры    

#КонецОбласти  
// Кухарь А.Ю.  18.06.2026 конец  

Функция ЭтотУзелКод(ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат СокрЛП(ПолучитьРеквизитШапки(ПланыОбмена[ИмяПланаОбмена].ЭтотУзел(), "Код", "ПланОбмена"));
КонецФункции //ЭтотУзелКод(ИмяПланаОбмена = "") Экспорт

Функция ИмяПланаОбменаПоУмолчанию()
	Возврат "ФР_ОбменСФРК";
КонецФункции //ИмяПланаОбменаПоУмолчанию()

Функция ЭтоУзел_Склад() Экспорт
	Возврат (ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад);
КонецФункции //ЭтоУзел_Склад() Экспорт

Функция ЭтоУзел_ЦО() Экспорт
	Возврат (ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение);
КонецФункции //ЭтоУзел_ЦО() Экспорт

Функция ЭтоУзел_ODN_или_OD7() Экспорт
	Возврат СтрНайти("ODN,OD7",ПараметрыСеанса.ЭтотУзел.Код)<>0;
КонецФункции //ЭтоУзел_ODN_или_OD7()

Функция ЭтоНезависимыйРС(ИмяТаблицы) Экспорт
	Результат = Ложь;
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	Если МетаОбъект<>Неопределено И Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда
		Результат = (МетаОбъект.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый); 			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЭтоНезависимыйРС(ИмяТаблицы)

//Кухарь А.Ю.  31.03.2026 начало
// 
Функция ЭтоНеКопияАЖиваяБаза () Экспорт
	СтрокаТекущегоСоединения = СокрЛП(ВРег(СтрокаСоединенияИнформационнойБазы()));     
	СтрокаСоединения	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));     
	
	// Кухарь А.Ю.  31.03.2026 начало
	// Заплатка. Отключить после того как придумаем что делать.	
	СтрокаСоединения2 ="SRVR=""SRV01-SK:1741"";REF=""OD7"";"; 
	СтрокаСоединения3 ="SRVR=""SRV02-SK:1741"";REF=""OD7"";";    
	возврат СтрокаСоединения = СтрокаТекущегоСоединения 
	или СтрокаСоединения2 = СтрокаТекущегоСоединения 
	или СтрокаСоединения3 = СтрокаТекущегоСоединения; 
	// Кухарь А.Ю.  31.03.2026 конец
	
	Возврат СтрокаТекущегоСоединения = СтрокаСоединения;
	
		
КонецФункции


//Тимофеев Ю.А 06.02.2024    

Функция ЭтоУзел_СкладФилиала() Экспорт
	
	//определяем что это склад в филиале 
	//по условию тип = магазин и есть у подразделения Выделенный склад
	
	//текущий узел
	ТекущийУзел = ПараметрыСеанса.ЭтотУзел;
	
	ЭтоСкладФилиала=Ложь;
	
	Если ТекущийУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
		//если тип склада = магазина
		ПодразделениеУзла = ТекущийУзел.Подразделение;
		
		Если ЗначениеЗаполнено(ПодразделениеУзла) Тогда
			//наличие выделенного склада
			Возврат ПодразделениеУзла.ЕстьВыделенныйСклад;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЭтоСкладФилиала;
	
КонецФункции //ЭтоУзел_СкладФилиала()

//Тимофеев Ю.А 06.02.2024


Функция РасширениеИспользуется(ИмяРасширения) Экспорт
	Если ЭтоУзел_ЦО() Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;

	// Изм-0000000181: Для узла отличного от SNL Нужно возвращать ложь 
	// Разработчик: Кухарь А.Ю. 10.06.2026  
	// Возврат Истина; 
	Возврат Результат; 
	
КонецФункции


Функция МожноЗапускатьАвтоОбмен() Экспорт   
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	Возврат ЭтоНеКопияАЖиваяБаза();
	//Кухарь А.Ю.  31.03.2026 конец
	
	
	СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
	Возврат (ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом);
КонецФункции //МожноЗапускатьАвтоОбмен()

// Кухарь А.Ю. 07.06.2021 начало

// Кухарь А.Ю. 07.06.2021 начало
Функция ПолучитьДопПараметрыНакладной (Док) экспорт
	// Кухарь А.Ю. 20.10.2025 начало 
	//Пока непонятно откуда вызывается, добавлю вызов исключения, чтобы по стеку потом понять откуда вызов.
	//HELP-7521
	если Док = Неопределено тогда
		ВызватьИсключение "Не выбран документ для получения доп. параметров";
	КонецЕсли;
	// Кухарь А.Ю. 20.10.2025 конец
	
	ДопПараметры=новый Структура("Имя,ЗаполнятьПереклейку,ОтгрузкаКомплектов","",Истина,ложь);
	ДопПараметры.Вставить("ОтгрузкаFBS",Ложь); 
	ДопПараметры.Вставить("ВыводитьДополнительныеСведения",Ложь); 
	ДопПараметры.Вставить("МассивДО",новый Массив); 
	ДопПараметры.Вставить("Получатель",Справочники.Контрагенты.ПустаяСсылка()); 
	ДопПараметры.Вставить("НеКонтролироватьКоличествоЕдиниц",ложь); 
	ДопПараметры.Вставить("НаборТовараПоЕдинойСхеме",ложь); 
	ВидНакладной=док.метаданные().имя; 
	ДопПараметры.Вставить("РазбиватьСпецификацииПоПродукции",ложь); 	
	ДопПараметры.Вставить("ОтгрузкаДСП",ложь);
	ДопПараметры.Вставить("ТребуетсяМаркировка",ложь);	 
	ДопПараметры.Вставить("НаборыЧЗбезОклейкиКомплектующих",ложь);	 
	ДопПараметры.Вставить("НанесениеКодовНеОбязательно",ложь);	
	
	// Ихсанов Д. А. Начало 23.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
	ДопПараметры.Вставить("Озон_МаркировкаПоВсемЗаказам", Ложь);
	// Ихсанов Д. А. Конец 23.12.2025
	
	// Кухарь А.Ю.  16.04.2025 начало
	ДопПараметры.Вставить("ПроверятьСодержимоеТарыЧЗ",ложь);
	// Кухарь А.Ю.  16.04.2025 конец                           

	// Кухарь А.Ю.  24.10.2025 начало
	// HELP-7562
	ДопПараметры.Вставить("ПроверятьВложениеЭкспозитораЧЗ",ложь); 
	// Кухарь А.Ю.  24.10.2025 конец

	
	
	РазрешеныСпайкиБезОклейкиКомплектующихЧЗ = ложь;	
	
	Запрос=новый запрос;		
	если ВидНакладной="ЗаданиеНабора" тогда 
		запрос.Текст=     "ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаданиеНабора.Получатель ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ЗаданиеНабора.Получатель КАК Справочник.Контрагенты).Код
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодКонтрагента,
		|	ВЫБОР
		|		КОГДА ЗаданиеНабора.Получатель ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ЗаданиеНабора.Получатель КАК Справочник.Контрагенты).НаборТовараПоЕдинойСхеме
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НаборТовараПоЕдинойСхеме,
		|	ЗаданиеНабора.Склад.Код КАК КодСклада,
		|	ВЫБОР
		|		КОГДА ЗаданиеНабора.Накладная ССЫЛКА Документ.РасходнаяНакладная
		|			ТОГДА ВЫРАЗИТЬ(ЗаданиеНабора.Накладная КАК Документ.РасходнаяНакладная).ОтгрузкаКомплектов
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтгрузкаКомплектов,
		|	ЗаданиеНабора.Получатель КАК Получатель,
		|	ВЫБОР
		|		КОГДА ЗаданиеНабора.Накладная ССЫЛКА Документ.РасходнаяНакладная
		|			ТОГДА НЕ ВЫРАЗИТЬ(ЗаданиеНабора.Накладная КАК Документ.РасходнаяНакладная).ПунктДоставки.ПереклейкаНеНужна
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗаполнятьПереклейку,
		|	ИнетМагазины.Ссылка КАК ИнетМагазин,
		|	ЗаданиеНабора.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		|	ВЫБОР
		|		КОГДА ЗаданиеНабора.Накладная ССЫЛКА Документ.РасходнаяНакладная
		|			ТОГДА ВЫРАЗИТЬ(ЗаданиеНабора.Накладная КАК Документ.РасходнаяНакладная).Подразделение.Код
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодПодразделения,
		|	ЕСТЬNULL(ЗаданиеНабора.Склад.ЭтоСкладFBS, ЛОЖЬ) КАК ЭтоСкладFBS,
		|	ВЫБОР
		|		КОГДА ЗаданиеНабора.Накладная ССЫЛКА Документ.РасходнаяНакладная
		|			ТОГДА ВЫРАЗИТЬ(ЗаданиеНабора.Накладная КАК Документ.РасходнаяНакладная).Контрагент.РазрешеныСпайкиБезОклейкиКомплектующихЧЗ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РазрешеныСпайкиБезОклейкиКомплектующихЧЗ,    
		// Кухарь А.Ю.  24.10.2025 начало
		// HELP-7562
		|	ЗаданиеНабора.ДокументОснование КАК Накладная
		// Кухарь А.Ю.  24.10.2025 конец
		
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнетМагазины КАК ИнетМагазины
		|		ПО ЗаданиеНабора.Склад = ИнетМагазины.Склад
		|			И ЗаданиеНабора.Получатель = ИнетМагазины.Контрагент
		|			И (НЕ ИнетМагазины.ПометкаУдаления)
		|ГДЕ
		|	ЗаданиеНабора.Ссылка = &Док";
	ИначеЕсли ВидНакладной="РасходнаяНакладная" тогда 
		запрос.Текст=     "ВЫБРАТЬ
		|	РасходнаяНакладная.Контрагент.Код КАК КодКонтрагента,
		|	РасходнаяНакладная.Контрагент.НаборТовараПоЕдинойСхеме КАК НаборТовараПоЕдинойСхеме,
		|	РасходнаяНакладная.Склад.Код КАК КодСклада,
		|	РасходнаяНакладная.ОтгрузкаКомплектов КАК ОтгрузкаКомплектов,
		|	РасходнаяНакладная.Контрагент КАК Получатель,
		|	НЕ РасходнаяНакладная.ПунктДоставки.ПереклейкаНеНужна КАК ЗаполнятьПереклейку,
		|	ИнетМагазины.Ссылка КАК ИнетМагазин,
		|	РасходнаяНакладная.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		|	РасходнаяНакладная.Подразделение.Код КАК КодПодразделения,
		|	ЕСТЬNULL(РасходнаяНакладная.Склад.ЭтоСкладFBS, ЛОЖЬ) КАК ЭтоСкладFBS,
		|	РасходнаяНакладная.Контрагент.РазрешеныСпайкиБезОклейкиКомплектующихЧЗ КАК РазрешеныСпайкиБезОклейкиКомплектующихЧЗ,
		// Кухарь А.Ю.  24.10.2025 начало
		// HELP-7562
		|	РасходнаяНакладная.Ссылка КАК Накладная	
		// Кухарь А.Ю.  24.10.2025 конец
		
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнетМагазины КАК ИнетМагазины
		|		ПО РасходнаяНакладная.Контрагент = ИнетМагазины.Контрагент
		|			И РасходнаяНакладная.Склад = ИнетМагазины.Склад
		|			И (НЕ ИнетМагазины.ПометкаУдаления)
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Док";
		//++Данилова Е.В. 10.02.2026 SNL-138 
	ИначеЕсли ВидНакладной="ПриходнаяНакладная" тогда
		ДопПараметры.Получатель = ПолучитьРеквизитШапки(Док,"Контрагент","Документ"); 
		возврат ДопПараметры;
		//--Данилова Е.В. 10.02.2026 
	иначе
		возврат ДопПараметры;
	КонецЕсли;
	
	запрос.УстановитьПараметр("Док",Док);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл                

		ДопПараметры.ПроверятьСодержимоеТарыЧЗ=ПрочитатьРСРеквизитСправочника("ПроверятьСодержимоеТарыЧЗ",результат.Получатель,ложь);  
		// Кухарь А.Ю.  24.10.2025 начало 
		//если ДопПараметры.ПроверятьСодержимоеТарыЧЗ тогда
		// HELP-7562
		ИщемЭкспозитор=ПрочитатьРСРеквизитСправочника("ПроверятьВложениеЭкспозитораЧЗ",результат.Получатель,ложь);   	
		если ИщемЭкспозитор тогда   
			Экспозитор = ПрочитатьЗначениеРеквизитаПНКПРМРНК_ПИ("Экспозитор",результат.Накладная,Неопределено);
			если ЗначениеЗаполнено(Экспозитор) тогда 
				ДопПараметры.ПроверятьВложениеЭкспозитораЧЗ = Истина; 	
			КонецЕсли;		
		КонецЕсли;	
		если ДопПараметры.ПроверятьСодержимоеТарыЧЗ или ДопПараметры.ПроверятьВложениеЭкспозитораЧЗ тогда
		// Кухарь А.Ю.  24.10.2025 конец
			
			ДопПараметры.НеКонтролироватьКоличествоЕдиниц = Истина;
		КонецЕсли;

		ДопПараметры.Имя=результат.КодКонтрагента; 
		если результат.КодПодразделения="SSP-0062" тогда
			ДопПараметры.ОтгрузкаДСП=Истина;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ДопПараметры,результат);	
		если результат.КодКонтрагента="SSR-9059" или результат.КодКонтрагента="SST-1208" тогда 
			ДопПараметры.ВыводитьДополнительныеСведения=Истина; 
			ДопПараметры.МассивДО=ПолучитьМассивДопОбработок(Док,Справочники.ВидыДопОбработки.УпаковкаВКосметичку); 
			
			если результат.КодСклада="STC-86" или результат.ИнетМагазин <>null или результат.ЭтоСкладFBS =Истина тогда			
				ДопПараметры.ЗаполнятьПереклейку=ложь;
				ДопПараметры.Имя="WB_FBS";
				ДопПараметры.ОтгрузкаFBS = Истина; 
				ДопПараметры.НеКонтролироватьКоличествоЕдиниц=Истина;
				
				// Ихсанов Д. А. Начало 23.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
				ДопПараметры.Вставить("Озон_МаркировкаПоВсемЗаказам",
					ПрочитатьРСРеквизитСправочника("Озон_МаркировкаПоВсемЗаказам", результат.Получатель, Ложь));
				// Ихсанов Д. А. Конец 23.12.2025
			иначе
				ДопПараметры.Имя="WB_FBO";					
			КонецЕсли;
		ИначеЕсли результат.КодКонтрагента="SSR-9604"  тогда		
			ДопПараметры.ВыводитьДополнительныеСведения=Истина; 
			ДопПараметры.Имя="AlIEXPRESS_FBS";
			ДопПараметры.ОтгрузкаFBS = Истина; 				
			ДопПараметры.ЗаполнятьПереклейку=ложь; 
			ДопПараметры.НеКонтролироватьКоличествоЕдиниц=Истина;	
		ИначеЕсли результат.КодКонтрагента="SSR-9908"  тогда		
			ДопПараметры.ВыводитьДополнительныеСведения=Истина; 
			ДопПараметры.Имя="SBRF_FBS";
			// Ихсанов Д. А. Начало 07.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7354
			//ДопПараметры.ОтгрузкаFBS = Истина;
			ДопПараметры.ОтгрузкаFBS = Ложь;
			// Ихсанов Д. А. Конец  07.10.2025
			ДопПараметры.ЗаполнятьПереклейку=ложь; 
			ДопПараметры.НеКонтролироватьКоличествоЕдиниц=Истина;	 
		ИначеЕсли результат.КодКонтрагента="SSP-4991"  тогда
			ДопПараметры.ВыводитьДополнительныеСведения=Истина; 
			ДопПараметры.МассивДО=ПолучитьМассивДопОбработок(Док,Справочники.ВидыДопОбработки.УпаковкаВКосметичку); 
			
			если результат.КодСклада="STC-81"  или результат.ИнетМагазин <> null или результат.ЭтоСкладFBS тогда							
				ДопПараметры.Имя="OZON_FBS";
				ДопПараметры.ОтгрузкаFBS = Истина; 	
				ДопПараметры.НеКонтролироватьКоличествоЕдиниц=Истина; 
				
				если ВидНакладной="РасходнаяНакладная" тогда					
					если ПолучитьЗаказКлиентаFBSПоНакладной(Док)=Неопределено тогда
						ДопПараметры.ЗаполнятьПереклейку=Истина;
					иначе
						ДопПараметры.ЗаполнятьПереклейку=ложь;
					КонецЕсли;
				КонецЕсли;
				ДопПараметры.ЗаполнятьПереклейку=ложь; 
				ДопПараметры.НеКонтролироватьКоличествоЕдиниц=Истина;
				
				// Ихсанов Д. А. Начало 23.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
				ДопПараметры.Вставить("Озон_МаркировкаПоВсемЗаказам",
					ПрочитатьРСРеквизитСправочника("Озон_МаркировкаПоВсемЗаказам", результат.Получатель, Ложь));
				// Ихсанов Д. А. Конец 23.12.2025
			иначе
				ДопПараметры.Имя="OZON_FBO";
				если не ДопПараметры.ОтгрузкаКомплектов тогда
					ДопПараметры.ЗаполнятьПереклейку=Истина;
				КонецЕсли;				 
			КонецЕсли;
		// Ихсанов Д. А. Начало 04.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2065
		//ИначеЕсли   результат.КодКонтрагента="SST-1967"  и  результат.ИнетМагазин <> null  тогда
		ИначеЕсли Результат.КодКонтрагента = "SST-1967" И (Результат.ИнетМагазин <> NULL Или результат.ЭтоСкладFBS) Тогда
		// Ихсанов Д. А. Конец  04.06.2025
			ДопПараметры.ВыводитьДополнительныеСведения=Истина; 
			ДопПараметры.Имя="YANDEX_FBS";
			ДопПараметры.ОтгрузкаFBS = Истина; 				
			ДопПараметры.ЗаполнятьПереклейку=ложь; 
			ДопПараметры.НеКонтролироватьКоличествоЕдиниц=Истина;	
			
			// Ихсанов Д. А. Начало 23.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
			ДопПараметры.Вставить("Озон_МаркировкаПоВсемЗаказам",
				ПрочитатьРСРеквизитСправочника("Озон_МаркировкаПоВсемЗаказам", результат.Получатель, Ложь));
			// Ихсанов Д. А. Конец 23.12.2025
		// Ихсанов Д. А. Начало 29.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1102
		ИначеЕсли Результат.КодКонтрагента = "SST-0046" И (Результат.ИнетМагазин <> NULL Или результат.ЭтоСкладFBS) Тогда
			ДопПараметры.ВыводитьДополнительныеСведения=Истина;
			ДопПараметры.Имя = "MAGNIT_FBS";
			ДопПараметры.ОтгрузкаFBS = Истина;
			ДопПараметры.ЗаполнятьПереклейку = Ложь;
			ДопПараметры.НеКонтролироватьКоличествоЕдиниц = Истина;
			
			// Ихсанов Д. А. Начало 23.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
			ДопПараметры.Вставить("Озон_МаркировкаПоВсемЗаказам",
				ПрочитатьРСРеквизитСправочника("Озон_МаркировкаПоВсемЗаказам", результат.Получатель, Ложь));
			// Ихсанов Д. А. Конец 23.12.2025
		// Ихсанов Д. А. Конец  29.05.2025
		иначе
		КонецЕсли;  
		
		//Кухарь А.Ю.  14.04.2025 начало
		// HELP-4141
		РазрешеныСпайкиБезОклейкиКомплектующихЧЗ = результат.РазрешеныСпайкиБезОклейкиКомплектующихЧЗ;
		//Кухарь А.Ю.  14.04.2025 конец
		
	КонецЦикла;
	
	если (ДопПараметры.имя="WB_FBS"
		// Ихсанов Д. А. Начало 09.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2315
		Или ДопПараметры.Имя = "YANDEX_FBS" Или ДопПараметры.Имя = "MAGNIT_FBS"
		// Ихсанов Д. А. Конец  09.07.2025
		или ДопПараметры.имя="OZON_FBS") и ДопПараметры.ОтгрузкаКомплектов и ДопПараметры.ТребуетсяМаркировка тогда	 	 		
		ДопПараметры.НаборыЧЗбезОклейкиКомплектующих=Истина;
		ДопПараметры.НанесениеКодовНеОбязательно=Истина; 
	КонецЕсли;
	
	
	// Кухарь А.Ю.  10.04.2025 начало
	//если (ДопПараметры.имя="WB_FBO"  или ДопПараметры.имя="WB_FBS" или ДопПараметры.Имя="OZON_FBS") и ДопПараметры.ОтгрузкаКомплектов 	тогда	
	если (ДопПараметры.имя="WB_FBO"  или ДопПараметры.имя="WB_FBS" или ДопПараметры.Имя="OZON_FBS" или ДопПараметры.Имя="OZON_FBO" 	 
		//Кухарь А.Ю.  14.04.2025 начало
		// Ихсанов Д. А. Начало 09.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2315
		Или ДопПараметры.Имя = "YANDEX_FBS" Или ДопПараметры.Имя = "MAGNIT_FBS"
		// Ихсанов Д. А. Конец  09.07.2025
		// HELP-4141
		или РазрешеныСпайкиБезОклейкиКомплектующихЧЗ = Истина 		
		//Кухарь А.Ю.  14.04.2025 конец
		
		) и ДопПараметры.ОтгрузкаКомплектов 	тогда	
		// Кухарь А.Ю.  10.04.2025 конец		
		ДопПараметры.НанесениеКодовНеОбязательно=Истина;
		ДопПараметры.ЗаполнятьПереклейку=ложь;
	КонецЕсли;		 
	// Кухарь А.Ю.  13.02.2025 конец
	
	возврат ДопПараметры;
КонецФункции
// Кухарь А.Ю. 14.05.2021 конец


// Кухарь А.Ю. 24.08.2021 начало
Функция ПолучитьМассивДопОбработок (Документ,ФильтрПоДО=Неопределено) экспорт
	если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходнаяНакладная") тогда
		Ссылка=Документ;	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаданиеНабора") тогда
		Ссылка=Документ.Накладная;
	Иначе
		Ссылка=Документ.ДокОснование;
	КонецЕсли;
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ различные
	|	РасходнаяНакладнаяДопОбработки.ВидДопОбработки КАК ВидДопОбработки
	|ИЗ
	|	Документ.РасходнаяНакладная.ДопОбработки КАК РасходнаяНакладнаяДопОбработки
	|ГДЕ
	|	РасходнаяНакладнаяДопОбработки.Ссылка = &Ссылка";
	// Кухарь А.Ю. 24.08.2021 начало
	//
	если ФильтрПоДО<>Неопределено тогда
		Запрос.Текст=СтрЗаменить(запрос.Текст,
		"РасходнаяНакладнаяДопОбработки.Ссылка = &Ссылка",
		"РасходнаяНакладнаяДопОбработки.Ссылка = &Ссылка и РасходнаяНакладнаяДопОбработки.ВидДопОбработки В (&ФильтрПоДО)");
		Запрос.УстановитьПараметр("ФильтрПоДО",ФильтрПоДО);
	КонецЕсли;
	// Кухарь А.Ю. 24.08.2021 конец
	
	запрос.УстановитьПараметр("Ссылка",Ссылка);
	Возврат запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидДопОбработки");
КонецФункции
// Кухарь А.Ю. 24.08.2021 конец



// Кухарь А.Ю.  13.05.2025 начало  
//Функция ПолучитьЗначениеРСРеквизитыСправочников(Ссылка, ИмяРеквизита = "") Экспорт 
//Результат = Неопределено;
Функция ПолучитьЗначениеРСРеквизитыСправочников(Ссылка, ИмяРеквизита = "",ПустоеЗначение = Неопределено) Экспорт  
	Результат = ПустоеЗначение;	
	// Кухарь А.Ю.  13.05.2025 конец	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	|	И РеквизитыСправочников.Справочник = &Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЗначениеРеквизита;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// Кухарь А.Ю. 19.05.2021 конец

// Кухарь А.Ю. 09.06.2021 начало
Функция ЗНБУжеЗагружен (ЗНБ) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЗаданиеНабора.ЗагруженИзТСД КАК ЗагруженИзТСД
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка",ЗНБ);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		возврат результат.ЗагруженИзТСД;
	КонецЦикла;
	
	возврат Истина;
	
КонецФункции
// Кухарь А.Ю. 09.06.2021 конец


// Кухарь А.Ю. 11.10.2021 начало
//
Функция ПолучитьЗаказКлиентаFBSПоНакладной (Накладная) экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|ГДЕ
	|	ЗаказКлиентаFBS.Проведен
	|	И ЗаказКлиентаFBS.ДокОснование = &Накладная";
	запрос.УстановитьПараметр("Накладная",Накладная);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		Возврат результат.ссылка;
	КонецЦикла;
	
	возврат Неопределено;
КонецФункции
// Кухарь А.Ю. 11.10.2021 конец

// Кухарь А.Ю. 22.10.2021 начало
//
Функция НайтиНоменклатуруВМатрицеПоШКилиАртикулу(ШК,Артикул,Контрагент,Договор,ПунктДоставки)Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	//---------------------------------------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Матрица.Ссылка КАК Ссылка1
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК Матрица
	|ГДЕ
	|	Матрица.Ссылка.Контрагент = &Контрагент
	|	И Матрица.Ссылка.Дата <= &Дата1
	|	И Матрица.Ссылка.ДатаОкончания >= &Дата2
	|	И Матрица.Ссылка.Договор = &Договор
	|	И Матрица.Ссылка.Проведен = ИСТИНА
	|	И Матрица.ПунктДоставки = &ПДИМ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("ПДИМ",ПунктДоставки);  // фбс озон
	
	ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
	
	
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
		|	И МатрицаТовары.Ссылка В ИЕРАРХИИ(&спМатриц)";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт","%"+Строка(Артикул)+"%");
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		Запрос.УстановитьПараметр("спМатриц",ТЗЕстьМатрицаПоДоговору);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()

// Кухарь А.Ю. 22.10.2021 конец



// Кухарь А.Ю. 11.11.2021 начало
Функция ПолучитьБрендПоЭлементуНоменклатуры (Номенклатура) экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	Номенклатура.Родитель.Родитель.Родитель КАК Бренд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		возврат результат.Бренд;
	КонецЦикла;
	
КонецФункции


Функция ПолучитьСекторХраненияПоБренду (Бренд) экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.Справочник = &Бренд
	|	И РеквизитыСправочников.ИмяРеквизита = ""СекторНоменклатуры""";
	запрос.УстановитьПараметр("Бренд",Бренд);
	
	Сектор=Неопределено;
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		Сектор=результат.ЗначениеРеквизита;
	КонецЦикла;
	
	возврат Сектор;
КонецФункции
// Кухарь А.Ю. 11.11.2021 конец


// Кухарь А.Ю. 22.10.2021 конец

// Кухарь А.Ю. 21.03.2022 начало
//
Функция ПолучитьСписокСостоянийВОбработке () экспорт
	СписокСостоянийВОбработке=новый СписокЗначений;
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ОжиданиеДопОбработки);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ДопОбработка);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ОжиданиеСканирования);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.Сканирование);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ОжиданиеКорректировки);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПереукладки);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.Переукладка);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
	
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ОжиданиеТермоусадки);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.Термоусадка);
	СписокСостоянийВОбработке.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	возврат СписокСостоянийВОбработке
КонецФункции
// Кухарь А.Ю. 21.03.2022 конец


// Кухарь А.Ю.  07.06.2022 начало
//
Функция ПолучитьОдиночныйЛистНабораПоНакладной (Документ) экспорт
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ЛистНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.ДокОснование = &Документ
	|	И ЛистНабора.Дата >= &Дата";
	запрос.УстановитьПараметр("Документ",Документ);
	запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	результат=запрос.Выполнить().Выбрать();
	если результат.Количество()<>1 тогда
		возврат Неопределено;
	КонецЕсли;
	
	пока результат.Следующий() цикл
		Возврат результат.ссылка;
	КонецЦикла;
	
КонецФункции
// Кухарь А.Ю.  07.06.2022 конец

// Кухарь А.Ю. 18.11.2024 начало
//
Функция ПолучитьДанныеКонтрагента (Контрагент) экспорт
	возврат ПолучитьРеквизитыШапки(Контрагент,"РаботаСМаркированнымТоваромПодтверждена,ДатаНачалаРаботыСМаркировкой,ИспользоватьНоменклатурнуюМатрицу,ВыполнятьПоискДатыНачалаМаркировкиВМатрице","Справочник");
КонецФункции

// Кухарь А.Ю. 18.11.2024 конец



// Кухарь А.Ю.  06.08.2022 начало
//
Функция ПолучитьИмяДокумента (Документ) экспорт
	возврат Документ.метаданные().имя;
КонецФункции

Функция ПереклейкаНеНужна (Документ) экспорт
	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначениеРеквизита КАК ФиктивнаяПереклейка
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ
	|ГДЕ
	|	Документ = &Документ
	|	И ИмяРеквизита = ""ФиктивнаяПереклейка""
	|	И ЗначениеРеквизита = ИСТИНА
	|"; 
	
	Запрос.УстановитьПараметр("Документ",Документ);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ФиктивнаяПереклейка) Тогда
		ПереклейкаНеНужна=Истина;					
	КонецЕсли;
	Возврат ПереклейкаНеНужна;	
	
	
КонецФункции


// Кухарь А.Ю.  06.08.2022 конец



// Кухарь А.Ю.  08.09.2022 начало
//
Функция ПолучитьДанныеПочтовогоСервера ()  Экспорт
	ПочтовыйПрофиль=новый Структура("АдресСервераSMTP,ВремяОжидания");
	
	//ПочтовыйПрофиль.АдресСервераPOP3="webmail.collant.ru";
	
	//Кухарь А.Ю.  22.02.2023 начало  
	//1С Обращалось по внешнему адресу, и не приходили письма почтовым группам рассылки.
	//Валетов+ 11,09,2025 Вернул как было не уходили письма внешним получателям
	ПочтовыйПрофиль.АдресСервераSMTP="webmail.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP="192.168.7.220"; 
	//Кухарь А.Ю.  22.02.2023 конец
	
	//ПочтовыйПрофиль.ПортPOP3=110;
	ПочтовыйПрофиль.ВремяОжидания=60;
	
	Возврат ПочтовыйПрофиль;
	
КонецФункции
// Кухарь А.Ю.  08.09.2022 конец



// Кухарь А.Ю.  03.10.2022 начало
//
Функция ПрочитатьЗначениеРеквизитаПНКПРМРНК_ПИ(ИмяРеквизита,ДокОбъектСсылка,ЗначениеНеЗаполненного=Неопределено)  Экспорт 
	
	ПолучаемоеЗначение=ЗначениеНеЗаполненного;	
	
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	запрос.УстановитьПараметр("Документ",ДокОбъектСсылка);
	запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПолучаемоеЗначение=результат.ЗначениеРеквизита;
	КонецЦикла;
	
	Возврат ПолучаемоеЗначение;
	
КонецФункции

// Кухарь А.Ю.  03.10.2022 конец

// Шворобей ВЮ 17.01.2023 ++
Функция СуществуетПолномочие(ПолномочиеВход) Экспорт
	
	Для каждого Имя ИЗ Метаданные.ПланыВидовХарактеристик.ПолномочияПользователей.ПолучитьИменаПредопределенных() Цикл
		Если Имя = СокрЛП(ПолномочиеВход) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	СообщитьИзМодуля("Полномочия с таким именем не существует!");
	Возврат Ложь;
	
КонецФункции
// Шворобей ВЮ 17.01.2023 ++

//+++ Чирков 11.03.2024
Функция ПолучитьЗначениеКонстанты(Имя) Экспорт
	Результат	=  Неопределено;
	Если Метаданные.Константы.Найти(Имя)<>Неопределено Тогда
		Результат	=  Константы[Имя].Получить();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗначениеКонстанты(Имя)

Функция АвтообменРазрешен() Экспорт 
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	Возврат ЭтоНеКопияАЖиваяБаза();
	//Кухарь А.Ю.  31.03.2026 конец
	
	
	СтрокаСоединения = ПолучитьЗначениеКонстанты("СтрокаСоединенияИБ_АвтоматическийОбмен");
	Возврат СокрЛП(ВРег(СтрокаСоединения)) = СокрЛП(ВРег(СтрокаСоединенияИнформационнойБазы()));
КонецФункции                   
//Кухарь А.Ю.  31.03.2026 конец


Функция ВалютаНац() Экспорт
	Возврат Константы.НациональнаяВалюта.Получить();
КонецФункции // ВалютаНац() 
//--- Чирков 11.03.2024



//Кухарь А.Ю.   18.03.2024 начало
//
Функция ПолучитьНеобходимостьКонтроляНаличияВХКМ (Накладная) экспорт
	Результат=Ложь;
	ВидДокумента=ПолучитьИмяДокумента(Накладная);
	Если ВидДокумента="Перемещение" тогда
		Запрос=новый запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	Перемещение.Склад.КодФизическогоУзла КАК ФизУзелОтправитель,
		|	Перемещение.СкладПолучатель.КодФизическогоУзла КАК ФизУзелПолучатель
		|ИЗ
		|	Документ.Перемещение КАК Перемещение
		|ГДЕ
		|	Перемещение.Ссылка = &Накладная";
		запрос.УстановитьПараметр("Накладная",Накладная);
		Выборка=Запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл
			КодТекУзла=ПараметрыСеанса.ЭтотУзел.Код;
			если Выборка.ФизУзелОтправитель<>Выборка.ФизУзелПолучатель тогда
				Если КодТекУзла=Выборка.ФизУзелПолучатель тогда
					Результат = Истина
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ВидДокумента="ПриходнаяНакладная" тогда
		Результат = Истина
	КонецЕсли;
	
	возврат Результат;
КонецФункции
//Кухарь А.Ю.   18.03.2024 конец

Функция ПолучитьРеквизитШапкиПИ(Ссылка,ИмяРеквизита,ТипОбъекта=Неопределено) Экспорт
	ПредставлениеРеквизита=СтрЗаменить(ИмяРеквизита,".","_");	
	
	СписокРеквизитов=Новый Соответствие;
	СписокРеквизитов.Вставить(ИмяРеквизита,ПредставлениеРеквизита);
	
	Реквизиты=ПолучитьРеквизитыШапки(Ссылка,СписокРеквизитов,ТипОбъекта);
	Возврат Реквизиты[ПредставлениеРеквизита];
КонецФункции

Функция УзелПодразделения(Подразделение) Экспорт
	
	
	
	Результат = ПланыОбмена.Основной.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	ПланОбмена.Основной	
	|ГДЕ
	|	Подразделение=&Подразделение
	|УПОРЯДОЧИТЬ ПО 
	|	ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда		
		Результат = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции


// Кухарь А.Ю.  12.08.2024 начало
//
Функция ПолучитьПодразделениеТекущегоУзла () экспорт
	возврат ПараметрыСеанса.ЭтотУзел.Подразделение;
КонецФункции
// Кухарь А.Ю.  12.08.2024 конец


// Кухарь А.Ю.  14.08.2024 начало
//
Функция ПроверитьНаличиеСкидокУКонтрагента (Знач Контрагент)  экспорт
	
	//
	Ведущий=ПолучитьРеквизитШапки(Контрагент,"Ведущий","Справочник");
	если ЗначениеЗаполнено(Ведущий) тогда
		Контрагент=Ведущий;
	КонецЕсли;
	
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ первые 1
	|	СкидкиКонтрагентов.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|	СкидкиКонтрагентов.Контрагент = &Контрагент";
	запрос.УстановитьПараметр("Контрагент",Контрагент);
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		Возврат Истина
	КонецЦикла;
	возврат ложь;
КонецФункции
// Кухарь А.Ю.  14.08.2024 конец


// Кухарь А.Ю.  12.12.2024 начало
// Если оператор при печати плана набора указал, что листы переукладки планируется создавать
// Либо если ЛП кто-то успел сделать, то будем считать, что в ЛН ничего агрегировать не будем
Функция ПланируетсяРаботаСАгрегациейЧЗвЛП(Знач Накладная) экспорт
	ЕстьЛП=ложь;
	ПланируетсяРаботаСЛПизРегистра =ложь;
	
	ПланируетсяРаботаСЛПизРегистра = ПрочитатьРеквизитыРНКПНКПРМ(Накладная,"ПланируетсяРаботаСЛП");
	если  ПланируетсяРаботаСЛПизРегистра <> Истина тогда //А вдруг какую-то ерунду руками в регистре заполнят, не булеву
		ПланируетсяРаботаСЛПизРегистра=ложь;
		ЕстьЛП = ПроверитьНаличиеЛистовПереукладкиСАгрегацией(Накладная);
	КонецЕсли;
	
	возврат ЕстьЛП или ПланируетсяРаботаСЛПизРегистра;
	
КонецФункции

// Кухарь А.Ю.  12.12.2024 начало
//
Функция ПроверитьНаличиеЛистовПереукладкиСАгрегацией (Знач Накладная) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистПереукладки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И НЕ ЛистПереукладки.НеУчитыватьПриОпределенииКоличестваМест
	|	И ЛистПереукладки.ДокОснование = &Накладная
	|	И (ЛистПереукладки.КодАгрегации <> &ПустойКодАгрегации Или ЛистПереукладки.ШтрихкодыУпаковок.ШтрихкодБлочка <> &ПустойКодАгрегации)";
	запрос.УстановитьПараметр("ПустойКодАгрегации",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());	
	запрос.УстановитьПараметр("Накладная",Накладная);
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		Возврат Истина;
	КонецЦикла;
	
	возврат ложь;
	
КонецФункции


// Кухарь А.Ю.  12.12.2024 конец

// Кухарь А.Ю.  15.12.2024 начало
//

// Кухарь А.Ю.  25.01.2025 начало
//https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1251
//  Функция ЕстьЛНСКодамиАгрегации (Накладная) экспорт
Функция ЕстьЛНСКодамиАгрегации (Накладная,ПроверятьКоробки,ПроверятьБлочки) экспорт
	если ПроверятьКоробки тогда
		// Кухарь А.Ю.  25.01.2025 конец
		
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ первые 1
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &Накладная
		|	И (ЛистНабора.КодАгрегации<>&ПустойКод или ЛистНабора.ШтрихкодыУпаковок.ШтрихкодБлочка<>&ПустойКод)";
		запрос.УстановитьПараметр("Накладная",Накладная);
		запрос.УстановитьПараметр("ПустойКод",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		
		Выборка=запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл
			Возврат Истина;
		КонецЦикла;
		// Кухарь А.Ю.  25.01.2025 начало
		// https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1251
	КонецЕсли; 
	
	если ПроверятьБлочки тогда
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &Накладная
		|	И ЛистНабора.ШтрихкодыУпаковок.ШтрихкодБлочка <> &ПустойКод";
		запрос.УстановитьПараметр("Накладная",Накладная);
		запрос.УстановитьПараметр("ПустойКод",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		
		Выборка=запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл
			Возврат Истина;
		КонецЦикла;
		
	КонецЕсли;
	// Кухарь А.Ю.  25.01.2025 конец
	
	Возврат Ложь;
КонецФункции
// Кухарь А.Ю.  14.08.2024 конец

// Кухарь А.Ю.  10.12.2024 начало
//
Функция СформироватьКартинкуШтрихкодаEan13Native(Знач ШтрихКод,ВысотаРисунка,ШиринаРисунка) экспорт
	РезультатШтрихкод=СформироватьКартинкуШК_EAN13(ШтрихКод,ВысотаРисунка,ШиринаРисунка);
	Если НЕ РезультатШтрихкод.Успешно Тогда
		Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
	КонецЕсли;
	возврат РезультатШтрихкод.Картинка;
КонецФункции
// Кухарь А.Ю.  15.12.2024 конец


// Кухарь А.Ю. 05.01.2025 начало
//
Функция ЕстьЛН (Накладная) экспорт
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.ДокОснование = &Накладная";
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	возврат Ложь;
КонецФункции

Функция ЕстьЛНСМаркировкой (Накладная) экспорт
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|ГДЕ
	|	ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &Накладная";
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	возврат Ложь;
КонецФункции

// Кухарь А.Ю. 05.01.2025 конец
//++Ратманов //Пустая задача
Функция Константа_КаталогВнешнихОтчетов() Экспорт
	Возврат Константы.КаталогВнешнихОтчетов.Получить();
КонецФункции	
Функция Константа_ДатаЗапретаРедактирования() Экспорт
	Возврат Константы.ДатаЗапретаРедактирования.Получить();
КонецФункции	
//--Ратманов

// Кухарь А.Ю.  29.03.2025 начало
Функция ВНакладнойТолькоСпайки (Накладная) Экспорт 
	//Валетов + 01,04,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3822
	Если ТипЗнч(Накладная) = Тип("ДокументСсылка.Перемещение") ИЛИ НЕ ЕстьРеквизитДокумента("ОтгрузкаКомплектов",Накладная.Метаданные()) Тогда 
		Возврат ложь;
		//Валетов - Было просто Если, изменил на ИначеЕсли 
	ИначеЕсли ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов","Документ") = ложь тогда
		Возврат ложь;
	КонецЕсли;
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходнаяНакладнаяТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Накладная
	// Кухарь А.Ю.  24.04.2025 начало
	//|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидКомплекта = &Товар		   
	|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидКомплекта <> &Комплект			   
	// Кухарь А.Ю.  24.04.2025 конец
	|	И РасходнаяНакладнаяТовары.Количество > 0";
	запрос.УстановитьПараметр("Накладная",Накладная);
	// Кухарь А.Ю.  24.04.2025 начало
	//запрос.УстановитьПараметр("Товар",Перечисления.ВидыКомплектов.Товар);   
	запрос.УстановитьПараметр("Комплект",Перечисления.ВидыКомплектов.Комплект);   
	// Кухарь А.Ю.  24.04.2025 конец
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		Возврат ложь;
	КонецЦикла;
	возврат Истина;
КонецФункции



// Кухарь А.Ю.  29.03.2025 начало
Функция ВНакладнойНетСпаек (Накладная) Экспорт 
	
	Если ТипЗнч(Накладная) = Тип("ДокументСсылка.Перемещение") ИЛИ НЕ ЕстьРеквизитДокумента("ОтгрузкаКомплектов",Накладная.Метаданные()) Тогда 
		Возврат Истина;
		
	ИначеЕсли ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов","Документ") = ложь тогда
		Возврат Истина;
	КонецЕсли;
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходнаяНакладнаяТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Накладная
	|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	|	И РасходнаяНакладнаяТовары.Количество > 0";
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("Комплект",Перечисления.ВидыКомплектов.Комплект);   
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		Возврат ложь;
	КонецЦикла;
	возврат Истина;
КонецФункции



Функция КаталогВнешнихОтчетов() Экспорт
	КаталогДИ = СокрЛП(Константы.КаталогВнешнихОтчетов.Получить());
	
	РазделительПути = ПолучитьРазделительПути();
	Если НЕ СтрЗаканчиваетсяНа(КаталогДИ, РазделительПути) Тогда
		КаталогДИ = КаталогДИ + РазделительПути;
	КонецЕсли; 
	
	Возврат КаталогДИ;	
КонецФункции //КаталогВнешнихОтчетов()
// Кухарь А.Ю.  29.03.2025 конец                                       

// Кухарь А.Ю.  24.04.2025 начало
//
Функция ПолучитьРеквизитыШапки_ПИ(Знач Объект,СписокРеквизитов,ТипОбъекта) экспорт
	возврат	ПолучитьРеквизитыШапки(Объект,СписокРеквизитов,ТипОбъекта);
КонецФункции
Функция СтруктураИБ() 
	ИмяСервера = "";     
	ИмяИБНаСервере = "";    
	ПутьКИБ = "";
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	ПозицияПоиска = Найти(Врег(СтрокаСоединения), "FILE=");
	Если ПозицияПоиска = 1 Тогда // файловая ИБ
		ПутьКИБ = Сред(СтрокаСоединения, 6, СтрДлина(СтрокаСоединения) - 6);
		ПризнакФайловогоРежима = Истина;
	Иначе
		ПризнакФайловогоРежима = Ложь;
		ПозицияПоиска = Найти(Врег(СтрокаСоединения), "SRVR=");
		Если НЕ (ПозицияПоиска = 1) Тогда
			Возврат Неопределено;
		КонецЕсли;
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединения, ";");
		НачальнаяПозицияКопирования = 6 + 1;
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2;
		ИмяСервера = Сред(СтрокаСоединения, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		СтрокаСоединения = Сред(СтрокаСоединения, ПозицияТочкиСЗапятой + 1);
		// позиция имени сервера
		ПозицияПоиска = Найти(Врег(СтрокаСоединения), "REF=");
		Если НЕ (ПозицияПоиска = 1) Тогда
			Возврат Неопределено;
		КонецЕсли;
		НачальнаяПозицияКопирования = 6;
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединения, ";");
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2;
		ИмяИБНаСервере = Сред(СтрокаСоединения, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		ПутьКИБ = """" + ИмяСервера + "\" + ИмяИБНаСервере + """";
	КонецЕсли;
	Возврат Новый Структура("Файловая,ИмяСервера,ИмяБазы,ПутьБазы",ПризнакФайловогоРежима,ИмяСервера,ИмяИБНаСервере,ПутьКИБ);
КонецФункции
//Ратманов
Функция ЭтоКопия()
	РабочиеСервера = Новый Массив;
	РабочиеСервера.Добавить("srvbase-sk:1741");
	РабочиеСервера.Добавить("srv-data");
	РабочиеСервера.Добавить("srv1c-ekf");
	
	РабочиеБазы = Новый Массив;
	РабочиеБазы.Добавить("OD7");  
	РабочиеБазы.Добавить("snl");  
	РабочиеБазы.Добавить("ekf");  
	
	Данные = СтруктураИБ();  
	
	Если Данные.Файловая Тогда
		Возврат Истина;
	КонецЕсли;
	Если РабочиеСервера.Найти(Данные.ИмяСервера) = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Если РабочиеБазы.Найти(Данные.ИмяБазы) = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;   
	Возврат Ложь;
КонецФункции	
// Кухарь А.Ю.  24.04.2025 конец


// Кухарь А.Ю.  13.05.2025 начало
// Перенёс из ЛП
Функция ЭтоДетскийМир(Контрагент) экспорт
	ДопРеквизит = ПолучитьСправочникРеквизитыПоЗначению("ВидАгрегацииЧЗ","ДетскийМир");	 
	Если ЗначениеЗаполнено(ДопРеквизит) Тогда	 
		Возврат Контрагент  = ДопРеквизит; 	 
	КонецЕсли; 
	Возврат ложь; 
КонецФункции // ПризнакДетскийМир()

// Кухарь А.Ю.  13.05.2025 конец

//Валетов + 17,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5947
//Перенес Определение ДЗР Из документов в _ПИ 
Функция ПолучитьДатуЗапретаРедактирования_ПИ(ВидДокумента,Знач Пользователь=Неопределено) Экспорт
	
	Пользователь=?(Пользователь=Неопределено,ПараметрыСеанса.Пользователь,Пользователь);	
	
	ПериодРедактирования					=ПолучитьПолномочиеПользователя("ПериодРедактированияДокументов",Пользователь);	
	ПерсональнаяДатаЗапретаРедактирования	=ПолучитьПолномочиеПользователя("ПерсональнаяДатаЗапретаРедактирования",Пользователь);	
	
	ПериодРедактирования = ПолучитьДЗРПоПользователю(Пользователь,ВидДокумента,ПериодРедактирования);	 	
	
	КонстантаЗапрета=Константы.ДатаЗапретаРедактирования.Получить();
	
	ДатаЗапрета=Макс(?(ПериодРедактирования=0,КонстантаЗапрета,ТекущаяДата()-ПериодРедактирования*24*60*60),КонстантаЗапрета);
	
	Если НЕ ЗначениеНеЗаполнено(ПерсональнаяДатаЗапретаРедактирования) Тогда
		ДатаЗапрета=Мин(ПерсональнаяДатаЗапретаРедактирования,ДатаЗапрета);	
	КонецЕсли;
		
	Если ВидДокумента = "КонтрактСПроизводителем" ИЛИ ВидДокумента = "УстановкаСкидокПоКонтрагентам" Тогда //ИЛИ ИмяМетаданныхДокумента = "Заказ" Тогда	
		ДатаЗапрета = ДатаЗапрета - 365*24*60*60;
	КонецЕсли;

	Если Найти("Матрица,ПланПродажПоКлиентам",ВидДокумента)<>0 Тогда
		ДатаЗапрета='00010101';	
	КонецЕсли; 
	
	
	Возврат КонецДня(ДатаЗапрета);
КонецФункции    

Функция ПолучитьДЗРПоПользователю(Пользователь,ВидДокумента,ПериодРедактирования)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ПериодРедактирования
	|ИЗ
	|	Справочник.Пользователи.ДатыЗапрета
	|ГДЕ
	|	Ссылка = &Пользователь
	|	И ВидДокумента = &ВидДокумента
	|";
	
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Запрос.УстановитьПараметр("ВидДокумента",ВидДокумента);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПериодРедактирования;	
	Иначе
		Возврат ПериодРедактирования;
	КонецЕсли;
КонецФункции 
//Валетов -

// Ихсанов Д. А. Начало 24.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2315
Функция РаботаСоСмешаннымиРНКВключена() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	СтруктураНастройки.Вставить("ТипОбъекта",	"Документ");
	СтруктураНастройки.Вставить("ИмяОбъекта",	"ЛистНабора.ФормаДокумента");
	СтруктураНастройки.Вставить("ИмяНастройки", "РаботаСоСмешаннымиРНКВключена");
	СтруктураНастройки.Вставить("ЗначениеНастройки",);
	
	Если РегистрыСведений.НастройкиОбъектов.ПолучитьНастройку(СтруктураНастройки) Тогда
		РаботаСоСмешаннымиРНКВключена = СтруктураНастройки.ЗначениеНастройки.Получить();
		Если ТипЗнч(РаботаСоСмешаннымиРНКВключена) <> Тип("Булево") Тогда
			Возврат Ложь
		КонецЕсли;
		
		Возврат РаботаСоСмешаннымиРНКВключена
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции // РаботаСоСмешаннымиРНКВключена()
// Ихсанов Д. А. Конец  24.07.2025                               


// Кухарь А.Ю. 25.07.2025 начало
Функция ПечататьКоробныеЭтикеткиНовойКомпонентой (Знач Накладная) экспорт  
	//По старому печатаем только для 1го случая  - Это РНК где есть агрегациии коробок и на контрагента не установлен признак НоваяПечатьКоробов
	Результат = Ложь;       
	
	//Кухарь 31.07.2025 начало
	если Маркировка_ПИ.ТипТекущегоУзла() <> Перечисления.ТипУзлаИБ.Склад тогда
		возврат Результат;
	КонецЕсли;
	//Кухарь 31.07.2025 конец
	
	если ТипЗнч(Накладная) = Тип("ДокументСсылка.ЗаданиеНабора") тогда  //С ТСД ЛН вначале записывается с док основанием = Задание набора. Надо переопределять
		Накладная = ПолучитьРеквизитШапки(Накладная,"ДокументОснование","Документ"); 
	КонецЕсли;     
	
	если ТипЗнч(Накладная) <> Тип("ДокументСсылка.РасходнаяНакладная") тогда  //Это РНК
		Результат = Истина;  
	КонецЕсли;     
	
	если не Результат тогда 
		Контрагент = ПолучитьРеквизитШапки(Накладная,"Контрагент","Документ");	
		Если ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Контрагент,"НоваяПечатьКоробов",Ложь) тогда // признак НоваяПечатьКоробов
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	если не Результат тогда
		ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);  	       	
		если не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок тогда  //есть агрегациии коробок
			Результат = Истина;
		КонецЕсли;  
	КонецЕсли;
	
	возврат Результат;
	

КонецФункции
// Кухарь А.Ю. 25.07.2025 конец


// Кухарь А.Ю. 27.10.2025 начало
// HELP-7589
Функция ПрочитатьРСРеквизитСправочника_ПИ(ИмяРеквизита,СправочникСсылка,ПустоеЗначение=Неопределено) Экспорт 
	возврат ПрочитатьРСРеквизитСправочника(ИмяРеквизита,СправочникСсылка,ПустоеЗначение);
КонецФункции
// Кухарь А.Ю. 27.10.2025 конец                                                 

//Кухарь А.Ю.  22.12.2025 начало
// SNL-73
Функция ПолучитьПрефиксПоДатеИУзлу (Знач ДатаПрефикса, Знач Узел) экспорт 
	
	КодУзла = ПолучитьРеквизитШапки(Узел,"Код","ПланОбмена");
	ПоследнийСимволКодаУзла = Прав(КодУзла,1);   
	СтрокаСимволов="ABCDEFGHIJKLMNOPQRSTUVWXYZ";    
	СтрокаЧисел="0123456789";   
	если СтрНайти(СтрокаЧисел,ПоследнийСимволКодаУзла) > 0 тогда
		СимволЭтоЧисло = Истина;
	Иначе
		СимволЭтоЧисло = ложь;
	КонецЕсли;           
	
	если СимволЭтоЧисло тогда     
		СтрокаПоиска = СтрокаЧисел;
		КоличествоВозможныхСимволов = 10;
	иначе
		СтрокаПоиска = СтрокаСимволов;
		КоличествоВозможныхСимволов = 26;
	КонецЕсли;          
	
	ТекМесто = СтрНайти(СтрокаПоиска,ПоследнийСимволКодаУзла); 		
	
	СтартовыйГод = 2025;
	ТекущийГод = Год(ДатаПрефикса); 
	если ТекущийГод = СтартовыйГод тогда  //После 2025 можно удалять
		если КодУзла = "SNL" тогда 
			Возврат "SSP";
		иначе
			возврат КодУзла; 
		КонецЕсли;
	КонецЕсли;
	ДельтаЛет = ТекущийГод - СтартовыйГод; 
	СимволОтНачалаСроки = ТекМесто + ДельтаЛет;
	КоличествоПроходов = Цел((СимволОтНачалаСроки-1)/КоличествоВозможныхСимволов);  
	СимволОтНачалаСроки = СимволОтНачалаСроки - КоличествоПроходов*КоличествоВозможныхСимволов;
	ПоследняяНоваяБуква = Сред(СтрокаПоиска,СимволОтНачалаСроки,1);    
	
	
	возврат Лев(КодУзла,СтрДлина(КодУзла)-1)+ПоследняяНоваяБуква;     
	
КонецФункции  

//Кухарь А.Ю.  22.12.2025 конец

//Ратманов  04.02.2026 Начало
Функция ИспользоватьЗамерыТранзакций() Экспорт
	Возврат Константы.ЗамерыТранзакций.Получить();
КонецФункции	

// Кухарь А.Ю.  24.03.2026 начало
Функция ДокументСуществует (Наименование) экспорт
	если Метаданные.документы.Найти(Наименование) = Неопределено тогда
		возврат ложь;
	иначе
		возврат Истина;
	КонецЕсли;
КонецФункции
// Кухарь А.Ю.  24.03.2026 конец

// Кухарь А.Ю.  26.06.2026 начало
// Пустая задача
Функция СправочникСуществует (Наименование) экспорт
	если Метаданные.Справочники.Найти(Наименование) = Неопределено тогда
		возврат ложь;
	иначе
		возврат Истина;
	КонецЕсли;
КонецФункции
 
// Кухарь А.Ю.  26.06.2026 конец

// Кухарь А.Ю.  06.04.2026 начало
// Пустая задача

Функция РазрядностьПлатформы_ПИ() Экспорт
	СисИнфо	= Новый СистемнаяИнформация;
	Если СтрНайти(СисИнфо.ТипПлатформы, 64) <> 0 Тогда
		Результат	= 64;
	Иначе
		Результат	= 32;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПодключитьКомпонентуRabbitMQ_ПИ(Направление = "Прием") Экспорт
	СтруктураВозврата = Новый Структура("Успех,Ошибки,Данные", Истина, Новый Массив, Неопределено);

	
	Разрядность = РазрядностьПлатформы_ПИ();
	ОбъектКомпоненты	= Неопределено;
	ИмяДляПодключения	= "AddIn" + Направление;
	Если ПодключитьВнешнююКомпоненту(ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("КомпонентаОбмена"
		+ Разрядность)), ИмяДляПодключения, ТипВнешнейКомпоненты.Native,
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		Попытка
			ИмяОбъекта			= "AddIn." + ИмяДляПодключения + ".AMQPToNative";
			ОбъектКомпоненты	= Новый (ИмяОбъекта);
		Исключение
			СтруктураВозврата.Ошибки.Добавить("Ошибка создания объекта из компоненты. " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		СтруктураВозврата.Ошибки.Добавить("Не удалось подключить компоненту обмена.");
	КонецЕсли;
	
	СтруктураВозврата.Данные =  ОбъектКомпоненты;
	
	Если СтруктураВозврата.Ошибки.Количество() > 0 Тогда
		СтруктураВозврата.Успех = Ложь;
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьДЗР_ДДСпоАвансам() Экспорт
	Возврат КонецДня(Константы.ДатаЗапретаРедактированияДДСпоАвансовымДоговорам.Получить());
КонецФункции //ПолучитьДЗР_ДДСпоАвансам()

//+ASU-824 20260316 Михайловский
Функция КонтрольДатыЗапрета_ПИ(ВидДокумента, ДокументДата, Отказ=Ложь, ВывестиСообщение=Истина) Экспорт
	Если Отказ Тогда Возврат Ложь КонецЕсли; //И так уже нельзя
	Если ПараметрыСеанса.ОтключитьКонтрольДЗР Тогда Возврат Истина КонецЕсли; 
	
	//ВидДокумента=Документ.Метаданные().Имя;
	Если ВидДокумента="УстановкаСкидок" или ВидДокумента="Контейнер" Тогда 
		Возврат Истина; //по просьбе Крохина не проверяем
	ИначеЕсли ВидДокумента="ПрайсЛист" Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Если ДокументДата <= ПолучитьДатуЗапретаРедактирования_ПИ(ВидДокумента) Тогда
		Отказ=Истина;
		#Если Клиент Тогда
			Если ВывестиСообщение Тогда
				Сообщить("Дата документа меньше даты запрета редактирования ! Документ не записан !",СтатусСообщения.Важное);			
			КонецЕсли;			
		#КонецЕсли
		Возврат Ложь;		
	КонецЕсли;
	Возврат Истина; //Можно записывать
КонецФункции //-ASU-824 20260316 Михайловский
// Кухарь А.Ю.  24.03.2026 конец                        

//Кухарь А.Ю 01.06.2026 начало
//Наряд 0000000521
Функция ПолучитьОсновнуюИБ () Экспорт
	возврат Справочники.ИБ.НайтиПоКоду("SSP");
КонецФункции     
//Кухарь А.Ю 01.06.2026 конец 

// Кухарь А.Ю.  13.07.2026 начало
Функция ПолучитьИнтегральнуюИБ () Экспорт
	возврат Справочники.ИБ.НайтиПоКоду("SMN");
КонецФункции     
// Кухарь А.Ю.  13.07.2026 конец


//Тимофеев Ю.А. Изменение 0000000098 ВГХ Номенклатуры
Функция ВГХНоменклатуры (ВыбТовар) Экспорт
	
	НужныйРодитель = ВыбТовар.Родитель;
	
	Если Ложь Тогда
		НужныйРодитель=Справочники.Номенклатура.СоздатьГруппу();
	КонецЕсли;
	
	//Если это не товар
	Если НужныйРодитель.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.Товар Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//получим данные из регистра
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВГХ.ВидВГХ КАК ВидВГХ,
		|	ВГХ.ЗначениеВГХ КАК ЗначениеВГХ,
		|	ВГХ.Регистратор.ШтукВКоробке КАК ШтукВКоробке,
		|	ВГХ.Регистратор.ШтукВКоробочке КАК ШтукВКоробочке
		|ИЗ
		|	РегистрСведений.ВГХ КАК ВГХ
		|ГДЕ
		|	ВГХ.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ВыбТовар);
	
	РезультатЗапроса = Запрос.Выполнить();              
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	
	
	ТЗВГХ = РезультатЗапроса.Выгрузить(); 
	
	ШтукВКоробке   = ТЗВГХ[0].ШтукВКоробке;
	ШтукВКоробочке = ТЗВГХ[0].ШтукВКоробочке;
	
	//если есть данные по коробке нужно заполнить
	Если ШтукВКоробке > 0 Тогда
		
		НовСтр = ТЗВГХ.Добавить(); 	
		НовСтр.ВидВГХ       = "ВысотаКоробки";
		НовСтр.ЗначениеВГХ  = 0;   
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ШиринаКоробки";
		НовСтр.ЗначениеВГХ  = 0;   
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ДлинаКоробки";
		НовСтр.ЗначениеВГХ  = 0;   
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ВесБруттоКоробки";
		НовСтр.ЗначениеВГХ  = 0;

		
	КонецЕсли;
		
	//если есть данные по блочку нужно заполнить    
	Если ШтукВКоробочке > 0 Тогда     	
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ВысотаБлочка";
		НовСтр.ЗначениеВГХ  = 0;
		
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ШиринаБлочка";
		НовСтр.ЗначениеВГХ  = 0;    
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ДлинаБлочка";
		НовСтр.ЗначениеВГХ  = 0; 
		
		НовСтр = ТЗВГХ.Добавить(); 
		НовСтр.ВидВГХ       = "ВесБруттоБлочка";
		НовСтр.ЗначениеВГХ  = 0;

		
	КонецЕсли;


	
	НовСтр = ТЗВГХ.Добавить(); 
	НовСтр.ВидВГХ       = "ШиринаШтуки";
	НовСтр.ЗначениеВГХ  = 0;
	
	НовСтр = ТЗВГХ.Добавить(); 
	НовСтр.ВидВГХ       = "ВысотаШтуки";
	НовСтр.ЗначениеВГХ  = 0;   
		
	НовСтр = ТЗВГХ.Добавить(); 
	НовСтр.ВидВГХ       = "ДлинаШтуки";
	НовСтр.ЗначениеВГХ  = 0;   
	
	
	
	
		
	НовСтр = ТЗВГХ.Добавить(); 
	НовСтр.ВидВГХ       = "ВесБруттоШтуки";
	НовСтр.ЗначениеВГХ  = 0;                
	
	
	
	ТЗВГХ.Свернуть("ВидВГХ","ЗначениеВГХ");
	
	Для Каждого СтрВГХ из ТЗВГХ Цикл
		Если СтрВГХ.ЗначениеВГХ  = 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Ложь;
   
КонецФункции      

//Тимофеев Ю.А. Изменение 0000000098 ВГХ Номенклатуры 

//Тимофеев Ю.А. Изменение 0000000099 ВГХ Номенклатуры
Процедура ИзменитьВГХтовара(Номенклатура,ЭтоПросмотр=Ложь) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВГХ.Ссылка КАК Ссылка,
	|	ВГХ.НачалоРабот КАК НачалоРабот
	|ИЗ
	|	Документ.ВГХ КАК ВГХ
	|ГДЕ
	|	ВГХ.Номенклатура = &Номенклатура
	|	И НЕ ВГХ.ПометкаУдаления
	|	И ВГХ.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВГХ.Дата УБЫВ";
	
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//значит никто не заполняет
	Если РезультатЗапроса.Пустой() Тогда				
		
		ДокВГХ                  = Документы.ВГХ.СоздатьДокумент();
		ДокВГХ.Дата             = ТекущаяДата();
		ДокВГХ.Автор            = ПараметрыСеанса.Пользователь;
		ДокВГХ.Номенклатура     = Номенклатура;    
		ДокВГХ.ШтукВКоробке     = Номенклатура.Родитель.ШтукВКоробке;
		ДокВГХ.ШтукВКоробочке   = Номенклатура.Родитель.ШтукВКоробочке;     
		ДокВГХ.НачалоРабот      = ТекущаяДата();
		ДокВГХ.Записать();
		
		ФормаВГХ                = ДокВГХ.ПолучитьФорму("ФормаЗаписи");
		ФормаВГХ.Номенклатура   = Номенклатура; 
		ФормаВГХ.ШтукВКоробке   = Номенклатура.Родитель.ШтукВКоробке;
		ФормаВГХ.ШтукВКоробочке = Номенклатура.Родитель.ШтукВКоробочке;
		ФормаВГХ.ДокументОбъект = ДокВГХ; 
		ФормаВГХ.ЭтоПросмотр    = ЭтоПросмотр ;
		ФормаВГХ.ОткрытьМодально();    
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Если Выборка.Следующий() Тогда
			
			ДокументКопия               = Выборка.Ссылка.Скопировать();
			
			ДокументКопия.Дата           = ТекущаяДата();	 
			ДокументКопия.НачалоРабот    = ТекущаяДата();
			ДокументКопия.ОкончаниеРабот = Дата(1,1,1);
			ДокументКопия.Автор          = ПараметрыСеанса.Пользователь;
			
			ФормаВГХ                      = ДокументКопия.ПолучитьФорму("ФормаЗаписи");
			ФормаВГХ.ДокументОбъект       = ДокументКопия;  
			ФормаВГХ.ЭтоПросмотр          = ЭтоПросмотр ;
			ФормаВГХ.ОткрытьМодально();  
			
		КОнецЕсли;      					
		
	КОнецЕсли;

КонецПроцедуры
//Тимофеев Ю.А. Изменение 0000000099 ВГХ Номенклатуры
	


