
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВидОперацииИСМП = МаркировкаКС.ПолучитьЗначениеПараметра(Параметры, "ВидОперацииИСМП");
	Если ВидОперацииИСМП <> Неопределено Тогда
		СтандартнаяОбработка	= Ложь;		
		ДанныеВыбора			= Новый СписокЗначений;
		
		Строки = ТаблицаСоответствияВидовОпераций().НайтиСтроки(Новый Структура("ВидОперацииИСМП", ВидОперацииИСМП));
		Для Каждого Строка Из Строки Цикл		
			ДанныеВыбора.Добавить(Строка.ТипДокументаИСМП);
		КонецЦикла;		
	КонецЕсли;	
КонецПроцедуры


Функция ТаблицаСоответствияВидовОпераций()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидОперацииИСМП");
	ТЗ.Колонки.Добавить("ТипДокументаИСМП");	
	
	П1 = Перечисления.ВидыОперацийИСМП;
	П2 = Перечисления.ТипыДокументовИСМП;
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.КассовыйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.ТоварныйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.УПД, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Прочее, 									П2.Прочее, 				ТЗ);	
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_РозничнаяПродажа, 							П2.КассовыйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_РозничнаяПродажа, 							П2.ТоварныйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_РозничнаяПродажа, 							П2.Прочее, 				ТЗ);
	
	//ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС, 		П2., 	ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_БезвозмезднаяПередача, 					П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_БезвозмезднаяПередача, 					П2.Прочее, 				ТЗ);	
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ВозвратФизическомуЛицу, 					П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ИспользованиеДляСобственныхНужд, 			П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Конфискация, 								П2.Прочее, 				ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Конфискация, 								П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Конфискация, 								П2.УПД, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.КассовыйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.Прочее, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.УПД, 				ТЗ);
	
	//ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоГосударственномуКонтракту, 		П2., 	ТЗ);
	
	//ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной, 	П2., 	ТЗ);	
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Уничтожение, 								П2.АктУничтожения, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Уничтожение, 								П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Утилизация, 								П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Утрата, 									П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС, 				П2.ТаможеннаяДекларация,ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС, 				П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.КассовыйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.ТоварныйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.Прочее,				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_РозничнаяРеализация, 				П2.КассовыйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_РозничнаяРеализация, 				П2.ТоварныйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_РозничнаяРеализация, 				П2.Прочее,				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи, 		П2.КассовыйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи, 		П2.ТоварныйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи, 		П2.Прочее,				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ПустаяСсылка(), 											П2.Прочее, 				ТЗ);
	
	Возврат ТЗ;
КонецФункции //ТаблицаСоответствияВидовОпераций()
 
Функция ДобавитьСтрокуСоответствия(ВидОперацииИСМП, ТипДокументаИСМП, ТЗ)
	СтрокаТЗ = ТЗ.Добавить();	
	
	СтрокаТЗ.ВидОперацииИСМП	= ВидОперацииИСМП;
	СтрокаТЗ.ТипДокументаИСМП	= ТипДокументаИСМП;
КонецФункции //ДобавитьСтрокуСоответствия(ВидОперацииИСМП, ТипДокументаИСМП, ТЗ)
  
