Функция ПолучитьОбработкуПоКоду(КодОбработки) Экспорт
	Результат			= МаркировкаКС.СтруктураРезультата(Ложь);
	
	ЭлементОбработки	= Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОбработки);
	
	Если ЭлементОбработки.Пустая() Тогда                       
		ТекстОшибки = СтрШаблон("Не найден элемент справочника 'Внешние обработки' с кодом: '%1' !", КодОбработки);
		Результат.Ошибки.Добавить(ТекстОшибки);		
		Возврат Результат
	КонецЕсли;
	
	ЗаписатьДатуИспользованияВнешнегоОтчёта(ЭлементОбработки);	
	
	ИмяОбработки 		= ЭлементОбработки.ИмяФайла;
	ИмяФайлаОбработки   = "";
	
	Внешняя = Ложь;
	Если СтрНачинаетсяС(ИмяОбработки, "ВН_") Тогда
		ИмяОбработки	= Сред(ИмяОбработки,4);	
		Внешняя			= Истина;
	Иначе			
		ИмяФайлаОбработки = ПолучитьИмяФалаОбработки(ЭлементОбработки);
		
		Файл	= Новый Файл(ИмяФайлаОбработки);
		Если Файл.Существует() Тогда
			Внешняя = Истина;
		КонецЕсли;			
	КонецЕсли; 
	
	Обработка = Неопределено;
	
	Если Внешняя Тогда		
		Обработка = ВнешниеОбработки.Создать(ИмяФайлаОбработки);
	Иначе
		Если Метаданные.Обработки.Найти(ИмяОбработки)<>Неопределено Тогда
			Обработка = Обработки[ИмяОбработки].Создать();	
		КонецЕсли;
	КонецЕсли;	                  
	
	Если Обработка = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Обработка: '%1' не обнаружена !", ИмяОбработки);
		Результат.Ошибки.Добавить(ТекстОшибки);
	Иначе        
		Результат.Данные = Обработка;	
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //ПолучитьОбработкуПоКоду(КодОбработки) Экспорт

Функция ПолучитьИмяФалаОбработки(ЭлементОбработки)
	Если ЭлементОбработки.ВидОбработки = "Печать" Тогда
		ДопКаталог = "PrnForms\";			
	ИначеЕсли ЭлементОбработки.ВидОбработки = "Заполнить" Тогда
		ДопКаталог = "FillForms\";						
	ИначеЕсли ЭлементОбработки.ВидОбработки = "Подбор" Тогда
		ДопКаталог = "SelForms\";									
	Иначе
		ДопКаталог = "";		
	КонецЕсли;
	
	Расширение = ?(ЭлементОбработки.ВидОбработки = "Отчет", ".erf", ".epf");
	
	ИмяФайлаОбработки	= СокрЛП(?(ЭлементОбработки.ПолныйПуть, ЭлементОбработки.ИмяФайла, Константы.КаталогВнешнихОтчетов.Получить() + ДопКаталог + ЭлементОбработки.ИмяФайла));
	Если Прав(ИмяФайлаОбработки,4) <> Расширение Тогда
		ИмяФайлаОбработки = ИмяФайлаОбработки + Расширение;		
	КонецЕсли;	
	
	Возврат ИмяФайлаОбработки;
КонецФункции //ПолучитьИмяФалаОбработки(ЭлементОбработки)
