
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СписокШК=Короба.ВыгрузитьКолонку("ШККоробки");
	
	Запрос=новый запрос;  	
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки как ШККоробки 
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(
	|			&Дата,
	|			ШККоробки В (&Шк)
	|				И ЗонаХранения = &ЗХ) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);
	Запрос.УстановитьПараметр("Дата",Дата);
	запрос.УстановитьПараметр("ЗХ",ЗонаХранения);	
	ЕстьНаОстаткахТекЗХ=запрос.Выполнить().выгрузить().ВыгрузитьКолонку("ШККоробки");
	
	
	
	Запрос=новый запрос; 
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
	|	ОстаткиЗХОстатки.ЗонаХранения как ЗонаХранения
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(
	|			&Дата,
	|			ШККоробки В (&Шк)
	|				И (НЕ ШККоробки В (&ШкЕстьНаОстатках))) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);
	Запрос.УстановитьПараметр("ШкЕстьНаОстатках",ЕстьНаОстаткахТекЗХ);	
	Запрос.УстановитьПараметр("Дата",Дата);
	ЕстьНаОстаткахГдеТоЕще=запрос.Выполнить().Выгрузить();
	
	
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		ЕстьВтекущемЗх=ЕстьНаОстаткахТекЗХ.Найти(ТекСтрокаКороба.ШККоробки);
		если ЕстьВтекущемЗх<>Неопределено тогда
			Движение = Движения.ОстаткиЗХ.Добавить();
			ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗонаХранения = ЗонаХранения;
			Движение.КоличествоКоробок = 1;
		иначе
			ЕстьВДругихЗХ=ЕстьНаОстаткахГдеТоЕще.Найти(ТекСтрокаКороба.ШККоробки);
			если ЕстьВДругихЗХ<>Неопределено тогда
				Движение = Движения.ОстаткиЗХ.Добавить();
				ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ЗонаХранения = ЕстьВДругихЗХ.ЗонаХранения;
				Движение.КоличествоКоробок = 1;
	        КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		Движение = Движения.ОстаткиЗХ.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗонаХранения = ЗонаХраненияПолучатель;
		Движение.КоличествоКоробок = 1;	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если не ЗначениеЗаполнено(ЗонаХранения) тогда
		#Если клиент тогда
			Сообщить("Заполните зону хранения");
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	
	если не ЗначениеЗаполнено(ЗонаХраненияПолучатель) тогда
		#Если клиент тогда
			Сообщить("Заполните зону хранения получатель");
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры
