Функция УстановитьШК()
	ШтрихКод="";
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ПОДСТРОКА(ВидыВыполняемыхРабот.ШтрихКод, 4, 9) КАК НомерШК
	             |ИЗ
	             |	Справочник.ВидыВыполняемыхРабот КАК ВидыВыполняемыхРабот
	             |ГДЕ
	             |	ПОДСТРОКА(ВидыВыполняемыхРабот.ШтрихКод, 1, 3) = ""444""
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерШК УБЫВ";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерШК =  Число(Выборка.НомерШК);
		НомерШК=НомерШК+1;
	Иначе
		НомерШК = "000000000";
	КонецЕсли; 
	
	ШтрихКод = "444" + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
	ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(Число(ШтрихКод),13);
	Возврат ШтрихКод;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	если ШтрихКод="" тогда
		 УстановитьШК();
	КонецЕсли;
КонецПроцедуры
