Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//крохин начало 06.09.2012
	//валюта- обязательный реквизит
		//крохин начало 03.10.2012
	//реквизит только для элементов
	//Если НЕ ОбменДанными.Загрузка Тогда
    Если НЕ ОбменДанными.Загрузка И НЕ ЭтоГруппа Тогда	
	//крохин конец 03.10.2012
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,Новый Структура("Валюта"),Отказ,"Не заполнены реквизиты элемента !");  	
	КонецЕсли;
	//крохин конец 06.09.2012
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры