Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;	
	
	СуммаДокумента=Товары.Итог("Всего");	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Движение=Движения.ТоварыВПути.Добавить();	
		
		Движение.Период			=Дата;
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.Заказ			=СтрокаТЧ.Заказ;
		Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
		
		Движение.Количество		=СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент;
		Движение.Сумма			=СтрокаТЧ.Всего;
		Движение.СуммаПоставщика=СтрокаТЧ.СуммаПоставщика;		
	КонецЦикла;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)	
КонецПроцедуры
