
Функция РассчитатьКомплектующие(ДокОбъект) Экспорт
	
	Если ДокОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивНеКомплекты = Новый Массив;
	МассивНеКомплекты.Добавить(Перечисления.ВидыКомплектов.Товар);
	МассивНеКомплекты.Добавить(Перечисления.ВидыКомплектов.ГотовыйКомплект);
	МассивНеКомплекты.Добавить(Перечисления.ВидыКомплектов.ПустаяСсылка());
	
	МассивКомплекты = Новый Массив;
	МассивКомплекты.Добавить(Перечисления.ВидыКомплектов.Комплект);
	
	тзТовары = ДокОбъект.Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	Запрос.УстановитьПараметр("МассивНеКомплекты", МассивНеКомплекты);
	Запрос.УстановитьПараметр("МассивКомплекты", МассивКомплекты);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО(10, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	&тзТовары КАК тзТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Товары.Номенклатура КАК Номенклатура,
	|	вр_Товары.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(вр_Товары.Количество, 0) КАК Количество
	|ИЗ
	|	вр_Товары КАК вр_Товары
	|ГДЕ
	|	вр_Товары.Номенклатура.ВидКомплекта В(&МассивНеКомплекты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Комплектующие.Ссылка,
	|	Комплектующие.Номенклатура,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) * ЕСТЬNULL(вр_Товары.Количество, 0)
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
	|		ПО Комплектующие.Ссылка = вр_Товары.Номенклатура
	|ГДЕ
	|	Комплектующие.Ссылка.ВидКомплекта В(&МассивКомплекты)
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
	
	УстановитьПривилегированныйРежим(Истина);
	тзВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзВыборка;

КонецФункции

Функция ПодобратьНоменклатуруКП_ПоНоменклатуреЗАП(Комплектующее, тзКомплектующие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Комплектующее", Комплектующее);
	Запрос.УстановитьПараметр("тзТовары", тзКомплектующие);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзТовары.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
	|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО(10, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	&тзТовары КАК тзТовары
	|ГДЕ
	|	тзТовары.Комплектующее = &Комплектующее
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Комплектующие.Ссылка, вр_Товары.Номенклатура) КАК Номенклатура
	|ИЗ
	|	вр_Товары КАК вр_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|		ПО вр_Товары.Номенклатура = Комплектующие.Ссылка
	|			И вр_Товары.Комплектующее = Комплектующие.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	тзВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если тзВыборка.Количество() > 0 Тогда
		Для Каждого Стр ИЗ тзВыборка Цикл
			Возврат Стр.Номенклатура;
		КонецЦикла;
	Иначе
		Возврат Комплектующее;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьДелительДляКомплекта(Номенклатура, Комплектующее) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Комплектующее", Комплектующее);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Комплектующие.Количество, 1) КАК Делитель
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка = &Номенклатура
	|	И Комплектующие.Номенклатура = &Комплектующее
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);

	Делитель = 1;
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			Делитель = ?(Выборка.Делитель = 0, 1, Выборка.Делитель);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Делитель;
	
КонецФункции
