
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивПолей") Тогда
	
		ЗаполнитьПоляДляВыбора(Параметры.МассивПолей); 	
	
	КонецЕсли;
	
	Если Параметры.Свойство("ВыбранныеЗначения") Тогда
	
		ВыбранныеЗначения.ЗагрузитьЗначения(Параметры.ВыбранныеЗначения);  	
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьТипВыбранныхЗначений(); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьПоляДляВыбора(ПараметрПоля)

	Для каждого ЭлементМассива Из ПараметрПоля Цикл
		
		СтрокаПоиска = ПоляПоиска.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаПоиска,ЭлементМассива); 
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПоляДляВыбора()


&НаКлиенте
Процедура ПоляПоискаВыборПриИзменении(Элемент)
	ТекущиеДанные 	= Элементы.ПоляПоиска.ТекущиеДанные; 
	Флаг 			= ТекущиеДанные.Выбор;
	
	СнятьРанееВыделенные();
	
	ВыбранныеЗначения.Очистить();
	
	ТекущиеДанные.Выбор = Флаг; 
	
	ОбновитьТипВыбранныхЗначений(); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОбновитьТипВыбранныхЗначений()

	СтрокиВыбранные = ПоляПоиска.НайтиСтроки(Новый Структура("Выбор",истина));
	
	Если СтрокиВыбранные.Количество() = 0  Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	МассивТипов = Новый Массив; 
	Для каждого СтрокаВыбранная  Из  СтрокиВыбранные Цикл
		
		ТипыОписания = СтрокаВыбранная.Тип.Типы();  
		Для каждого ТипИзОписания Из ТипыОписания  Цикл  			
			МассивТипов.Добавить(ТипИзОписания);
		КонецЦикла;
		
	КонецЦикла; 
	
	//СписокТипов.ЗагрузитьЗначения(МассивТипов); 
	
	ВыбранныеЗначения.ТипЗначения = Новый ОписаниеТипов(МассивТипов); 
КонецПроцедуры // ()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура СнятьРанееВыделенные()

	СтрокиВыбранные = ПоляПоиска.НайтиСтроки(Новый Структура("Выбор",истина));
	Для каждого СтрокаВыбранная  Из  СтрокиВыбранные Цикл
		СтрокаВыбранная.Выбор = Ложь; 		
	КонецЦикла; 
КонецПроцедуры // СнятьРанееВыделенные()

&НаКлиенте
Процедура ОК(Команда)
	ПараметрыЗакрытия = Новый Структура("Ключ,Значение"); 
	СтрокиВыбранные = ПоляПоиска.НайтиСтроки(Новый Структура("Выбор",истина));
	Если СтрокиВыбранные.Количество() > 0 
		И ВыбранныеЗначения.Количество() > 0 Тогда
	
		 ПараметрыЗакрытия.Ключ = СтрокиВыбранные[0].Поле; 
	     ПараметрыЗакрытия.Значение = ВыбранныеЗначения.ВыгрузитьЗначения(); 
		 
	КонецЕсли;
	
	Закрыть(ПараметрыЗакрытия); 
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКоды(Команда)
	
	Для Каждого КодВведенный Из ВвестиКоды() Цикл
		
		ВыбранныеЗначения.Добавить(КодВведенный); 		
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ВвестиКоды()
	мКоды = Новый Массив;
	СтрокаКодов = "";
	Если ВвестиСтроку(СтрокаКодов, "Введите коды маркировки", , Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СтрокаКодов, Символы.ПС) Цикл
			Строка = СтрЗаменить(Строка,"(01)","");		
			Строка = СтрЗаменить(Строка,"(21)","");		
			Строка = СтрЗаменить(Строка," ","");		
			мКоды.Добавить(Строка);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат мКоды;
КонецФункции





