Процедура ПередЗаписью(Отказ)
	Если Наименование="" Тогда
		Отказ=Истина;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		#ЕСЛИ КЛИЕНТ ТОГДА 
			УстановитьКодСправочника(ЭтотОбъект);
		#КОНЕЦЕСЛИ
	КонецЕсли;
	// Кухарь А.Ю. 20.01.2021 начало
	//  Исправление косяка
	если не ЭтоГруппа тогда
		// Кухарь А.Ю. 20.01.2021 конец
		Если ШтрихКод="" тогда
			ШтрихКод=УстановитьШКЗХ();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	// Кухарь А.Ю. 20.01.2021 начало
	//  Исправление косяка
	если не ЭтоГруппа тогда
		// Кухарь А.Ю. 20.01.2021 конец
		
		ШтрихКод="";
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ШтрихКод="";
КонецПроцедуры

Функция УстановитьШКЗХ()
	ШтрихКод="";
	
	Запрос		=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(ШтрихКод, 4, 9) КАК НомерШК
	|ИЗ
	|	Справочник.ЗоныХранения
	|ГДЕ
	|	ПОДСТРОКА(ШтрихКод, 1, 3) = ""333""	
	|УПОРЯДОЧИТЬ ПО
	|	НомерШК УБЫВ";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерШК = Число(Выборка.НомерШК);
		НомерШК	= НомерШК+1;
	Иначе
		НомерШК = "000000000";
	КонецЕсли; 
	
	ШтрихКод = "333"	+ Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
	ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(Число(ШтрихКод),13);
	
	Возврат ШтрихКод;
	
КонецФункции
