//Кухарь 02.06.17 начало   
//будем записывать УСО в закрытом периоде
перем НеКонтролироватьЗапись;
//Кухарь 02.06.17 конец


Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Если ТолькоДляБухгалтерии Тогда Возврат КонецЕсли;
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ВалютаУпр		= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсУпр			= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	ВалютаРасчетов	= ПолучитьВалютуРасчетов(Договор);	
	
	СуммаВАЛ		= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаРасчетов,Дата);
	СуммаУпр		= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаУпр,КурсУпр);
	
	Движение 					= Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
	
	Движение.Период				= Дата;
	Движение.Контрагент			= КонтрагентЦБ;
	Движение.Договор 			= Договор;			
	
	Движение.СуммаВал			= СуммаВАЛ;
	Движение.СуммаУпр			= СуммаУпр;
	
	Движение.СуммаДокумента		= СуммаДокумента;
	Движение.ВалютаДокумента	= Валюта;	
	Для Каждого СтрокаТЧ Из Услуги Цикл
		Движение 					= Движения.Затраты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;	
		
		Движение.Период				= Дата;
		
		Движение.Подразделение		= СтрокаТЧ.Подразделение;
		//++Данилова Е.В. 24.04.2026 HELP-9467
		Если Дата >= Дата(2026,04,01) Тогда
			Движение.КаналСбыта 		= СтрокаТЧ.КаналСбыта; 
		КонецЕсли;
		//--Данилова Е.В. 24.04.2026 
		Движение.СтатьяЗатрат		= СтрокаТЧ.СтатьяДДС;			
		
		Движение.СуммаУпр			= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,ВалютаУпр,КурсУпр);		
		
		Движение.Контрагент			= КонтрагентЦБ;
		Движение.Договор			= Договор;
		
		Движение.СуммаДокумента		= СтрокаТЧ.Всего;
		Движение.ВалютаДокумента	= Валюта;	
		Движение.Комментарий        = Комментарий;
		Движение.КапитальныеЗатраты = СтрокаТЧ.КапитальныеЗатраты;
		Движение.Проект             = СтрокаТЧ.Проект;
		Движение.ПериодРасходов     = СтрокаТЧ.ПериодРасходов;
		Движение.СубЗатрата         = СтрокаТЧ.СубЗатрата;
		Движение.Автомобиль         = Автомобиль;		
		Движение.КонтрагентЛогистика = СтрокаТЧ.КонтрагентЛогистика;
		Движение.ДатаЗаписи			= ТекущаяДата();	
	КонецЦикла;	
	
	Если  Дата >= '20130401' тогда
		ПериодРасходовТранспорт = Неопределено;
		Если ЗначениеЗаполнено(ПериодРасходов) Тогда
			ПериодРасходовТранспорт = ПериодРасходов ;
		Иначе	
			Для Каждого СтрокаТЧ Из Услуги Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов) Тогда
					ПериодРасходовТранспорт = СтрокаТЧ.ПериодРасходов ;	
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПериодРасходовТранспорт = Неопределено Тогда
				ПериодРасходовТранспорт = '00010101';
			КонецЕсли;
		КонецЕсли;

		СОбъем=ДокументыТранспортнойкомпании.Итог("Объем");	
		ССумма=СуммаДокумента;
		если СОбъем=0 тогда
			СОбъем=1;
		КонецЕсли;
		
		//для коррекции копеек после распределения
		ВсегоРаспределено = 0;
		Движение = Неопределено;
		для каждого СтрУслуги из Услуги цикл
			Коэффициент=СтрУслуги.Всего/СуммаДокумента;
			для каждого Накл из ДокументыТранспортнойкомпании цикл
				если накл.Документ=Неопределено тогда Продолжить;
				КонецЕсли;
				Движение = Движения.РаспределениеУСОпоНакладным.Добавить();
				
				Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
				
				Движение.Период				=Дата;
				
				Движение.Накладная=накл.Документ.Ссылка;
					Движение.РаспределеннаяСумма=Окр(накл.Объем*ССумма/СОбъем,2);
					Движение.ОбъемНаладной=Накл.Объем;	
				
				//Размазываем отдельно по услугам
				Движение.РаспределеннаяСумма=Движение.РаспределеннаяСумма*Коэффициент;
				Движение.ВидУслуги=СтрУслуги.ВидУслуги;
				//для коррекции копеек после распределения
				ВсегоРаспределено = ВсегоРаспределено + Движение.РаспределеннаяСумма;
				если накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда 
					движение.СуммаНакладной=Накл.Документ.СуммаДокумента;
					попытка
						если ЗначениеЗаполнено(Накл.Документ.ТипДоставки) тогда
							ТипДоставки=Накл.Документ.ТипДоставки;
						иначе
							ТипДоставки=Накл.Документ.ПунктДоставки.ТипДоставки;
						КонецЕсли;
					Исключение
						ТипДоставки=Накл.Документ.ПунктДоставки.ТипДоставки;
					КонецПопытки;
						если ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания И НЕ Накл.Документ.ПунктДоставки.ДоставкаЗаНашСчет тогда
							движение.ПунктДоставки=Накл.Документ.ПунктДоставки.ПунктПерегруза;	
						Иначе
							движение.ПунктДоставки=Накл.Документ.ПунктДоставки;	
						КонецЕсли;
				иначе
					движение.СуммаНакладной=0;
					движение.ПунктДоставки=Накл.Документ.ПунктДоставкиПолучатель;
				КонецЕсли;
				
				
				движение.КоличествоНакладной=Накл.Документ.КоличествоДокумента;
				движение.КоличествоКоробок=Накл.Документ.КоличествоКоробок;
				движение.ДатаОтгрузки=Накл.Документ.ДатаОтгрузки;
				Если ЗначениеЗаполнено(Накл.ПериодРасходов) Тогда
					Движение.ПериодРасходов = Накл.ПериодРасходов;
				Иначе
					Движение.ПериодРасходов = ПериодРасходовТранспорт;
				КонецЕсли;
				
				если накл.Документ.метаданные().имя<>"Перемещение" и накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
					движение.Контрагент=накл.Документ.Контрагент;
					движение.Подразделение=накл.Документ.Подразделение;
				ИначеЕсли накл.Документ.метаданные().имя="ЗаявкаВТранспортныйОтдел" тогда	
					если накл.Документ.отправитель.Метаданные().Имя="Контрагенты" тогда
						движение.Контрагент=накл.Документ.отправитель;
						движение.Подразделение=накл.Документ.Получатель.Подразделение;
					ИначеЕсли накл.Документ.получатель.Метаданные().Имя="Контрагенты" тогда
						движение.Контрагент=накл.Документ.получатель;
						движение.Подразделение=накл.Документ.Отправитель.Подразделение;
					иначе
						движение.Подразделение=накл.Документ.Получатель.Подразделение;				
					КонецЕсли;
					если накл.Документ.Подразделение<>справочники.Подразделения.ПустаяСсылка() тогда
						движение.Подразделение=накл.Документ.Подразделение;
					КонецЕсли;
					
				иначе
					движение.Подразделение=накл.Документ.складполучатель.Подразделение;	
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если ВсегоРаспределено <> СуммаДокумента И Движение <> Неопределено И Дата >= '20130701' Тогда
		Движение.РаспределеннаяСумма = Движение.РаспределеннаяСумма + (СуммаДокумента-ВсегоРаспределено);	
	КонецЕсли;
	Если ОбменДанными.Загрузка Тогда
		Движения.Записать();             
	КонецЕсли;
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)		
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	//Кухарь 02.06.17 начало   
	//будем записывать УСО в закрытом периоде         
	если НеКонтролироватьЗапись<>истина тогда
		//Кухарь 02.06.17 конец
		
		
		Если НЕ ОбменДанными.Загрузка Тогда		
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			
			// Кухарь А.Ю.  02.08.2023 начало
			// Стали часто выбирать какой-то неправильный договор
			ВладелецДоговора=ПолучитьРеквизитШапки(Договор,"Владелец","Справочник");
			ВедущийКонтрагента=ПолучитьРеквизитШапки(Контрагент,"Ведущий","Справочник");
			Если ВладелецДоговора<>Контрагент и ВладелецДоговора<>ВедущийКонтрагента тогда
				СообщитьИзМодуля("Выбран договор, владелец которого отличается от контрагента в УСО");
				Отказ = Истина;	
			КонецЕсли;
			// Кухарь А.Ю.  02.08.2023 конец
			
			
			Если Отказ Тогда Возврат КонецЕсли; 		
		КонецЕсли;	
		//кухарь 15.01.15 начало
		//контрагент ЦБ должен быть интегральным
		если КонтрагентЦБ.Владелец<>Справочники.ИБ.НайтиПоКоду("SMN") тогда
			отказ=Истина;
		КонецЕсли;
		//кухарь 15.01.15 конец
		
		
		Если Отказ Тогда Возврат КонецЕсли;
		
		Если ЕстьИзменения Тогда
			СуммаДокумента=Услуги.Итог("Всего");
			//Кухарь 03.10.18 начало
			//По просьбе мамченкова объём будем брать из паллет
			для каждого СтрТЧ из ДокументыТранспортнойкомпании цикл
				Накл=СтрТЧ.Документ;
				попытка
					ОбъемПаллет=Накл.ОбъемПаллет;
				Исключение
					ОбъемПаллет=0;
				КонецПопытки;
				
				Если  Дата >= '20180301' и ОбъемПаллет>0 тогда				
					СтрТЧ.Объем=ОбъемПаллет;			
				ИначеЕсли Накл.ОбъемКоробов=0 тогда			
					СтрТЧ.Объем=Накл.ОбъемДокумента;
					
				иначе				
					СтрТЧ.Объем=Накл.ОбъемКоробов;
				Конецесли;					
				СтрТЧ.КоличествоМест=Накл.КоличествоКоробок;
			КонецЦикла;
			//Кухарь 03.10.18 конец
			
		КонецЕсли; 
		
		//Кухарь 02.06.17 начало   
		//будем записывать УСО в закрытом периоде
		
		//Кухарь 10.10.19 Начало
		//Контроль дублей УСО
		НужноПроверятьДубли=ложь;
		Для каждого СтрТЧ из Услуги цикл
			если ЗначениеЗаполнено(СтрТЧ.ВидУслуги) тогда
				Если СтрТЧ.ВидУслуги.ПроверятьДублиУСО тогда
					НужноПроверятьДубли=Истина;
				КонецЕсли;
			КонецЕсли;
			если НужноПроверятьДубли тогда
				Запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ
				|	УслугиСтороннихОрганизаций.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.УслугиСтороннихОрганизаций КАК УслугиСтороннихОрганизаций
				|ГДЕ
				|	УслугиСтороннихОрганизаций.Проведен
				|	И УслугиСтороннихОрганизаций.СуммаДокумента = &СуммаДокумента
				|	И УслугиСтороннихОрганизаций.Комментарий ПОДОБНО &Комментарий
				|	И УслугиСтороннихОрганизаций.Автомобиль = &Автомобиль
				|	И УслугиСтороннихОрганизаций.Ссылка <> &Ссылка
				|	И УслугиСтороннихОрганизаций.Дата >= &Дата";
				запрос.УстановитьПараметр("СуммаДокумента",СуммаДокумента);
				запрос.УстановитьПараметр("Комментарий",Комментарий);
				запрос.УстановитьПараметр("Автомобиль",Автомобиль);
				запрос.УстановитьПараметр("Ссылка",Ссылка);
				запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить()-3*30*3600);
				
				результат=запрос.Выполнить().Выбрать();
				пока результат.Следующий() цикл
					СообщитьИзМодуля("УСО с такой суммой, комментарием и автомобилем уже есть "+результат.ссылка);
					Отказ=Истина;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		//Кухарь 10.10.19 конец			
		
	КонецЕсли;
	//Кухарь 02.06.17 конец
	
	
	//Катаев+ 25/06/13 Убрал комментарии. Проблема в первый раз была из-за того что на самом документе стояла авторегистрация.
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ДокОснование		= Основание;
		
		ИБ 					= Основание.ИБ;
		Организация 		= Основание.Организация;
		Подразделение		= Основание.Склад.Подразделение;
		
		Контрагент 			= Основание.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= Основание.Договор;		
		
		Сумма 				= Основание.СуммаДокумента;
		Валюта 				= Основание.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоНаименованию("Приход от покупателей");
		
		Комментарий 		= "На основании: "+Основание;		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если не ОбменДанными.Загрузка тогда
		если СозданСчет тогда
			#Если клиент тогда
				Сообщить("На это УСО уже оформлен счет за доставку. Нужно сначала пометить его на удаление");
			#КонецЕсли
			отказ=Истина;
		КонецЕсли;
	КонецЕсли;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
КонецПроцедуры


//Кухарь 02.06.17 начало   
//будем записывать УСО в закрытом периоде
//Кухарь 02.06.17 конец

Процедура ПерезаписатьДокументБезКонтроля() Экспорт
	НеКонтролироватьЗапись=Истина;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись=Ложь;	
КонецПроцедуры 

//Кухарь 02.06.17 конец
