Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	    Если ТаблицаПараметров <> Неопределено Тогда
			Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
				Если СтрокаТП.Имя = "ДатаОтгрузки" Тогда
					ДатаОтгрузки = СтрокаТП.Значение;
					Прервать;
					КонецЕсли;
			КонецЦикла;
	Иначе
		ДатаОтгрузки=Неопределено;
		КонецЕсли;
		Если ДатаОтгрузки=Неопределено Тогда
			ДатаОтгрузки=ПолучитьСледующуюДатуОтгрузкиОбработка();		
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаОтгрузку.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку
		               |ГДЕ
		               |	ЗаявкаНаОтгрузку.Проведен
		               |	И ЗаявкаНаОтгрузку.ДатаОтгрузки = &ДатаОтгрузки";
		Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.ссылка.ПолучитьОбъект();
		ЗаписатьВЛог("Регистрация ЗОГ для выгрузки",Выборка.ссылка,"Информация");
		СписокПолучателей=ПолучитьСписокПолучателейИзмененийОбъектаОбработка(ДокОбъект);
		Для Каждого Узел Из СписокПолучателей Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел.Значение,ДокОбъект.Ссылка);
		КонецЦикла;

		КонецЦикла;
	КонецПроцедуры
	
	
	Функция ПолучитьСледующуюДатуОтгрузкиОбработка()  

	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Дата	
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	//крохин начало 24.04.2018
	//отгрузка в выходные
	//|	КалендарьДни.Часы <> 0
	//крохин начало 01.11.2018
	//не надо
	//|	(КалендарьДни.Часы <> 0 ИЛИ КалендарьДни.ОтгрузкаВВыходной)
	|	КалендарьДни.Часы <> 0
	//крохин конец 01.11.2018
	//крохин конец 24.04.2018
	|	И КалендарьДни.Дата > &Дата0
	|	И НЕ Ссылка.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО Дата";
	
	Запрос.УстановитьПараметр("Дата0",КонецДня(ТекущаяДата()));
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	Иначе	
		ЗаписатьВЛог("Регламент","Не заполнен календарь на !","Ошибка");
		
		Возврат КонецДня(ТекущаяДата())+1;		 		
	КонецЕсли; 
КонецФункции 


Функция ПолучитьСписокПолучателейИзмененийОбъектаОбработка(Объект,ДопИнфо = Неопределено)
		ЭтотУзел			=ПланыОбмена.Основной.ЭтотУзел();		
	УправляющийУзел		=ЭтотУзел.УправляющийУзел;
	ТипУзла				=ПараметрыСеанса.ТипУзла;
	
	ОбменДанными		=Объект.ОбменДанными;
	Отправитель			=ОбменДанными.Отправитель;
	Загрузка			=ОбменДанными.Загрузка;
	
	СписокПолучателей	=Новый СписокЗначений;
	ТипОбъекта			=ТипОбъекта(Объект);
	ВидОбъекта			=Объект.Метаданные().Имя;

	//Из Волгограда ничего не грузим
			Если ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад Тогда
				Возврат СписокПолучателей;	
			Конецесли;
			//крохин конец
			Склад		=Объект.Склад;			
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
			Иначе
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ДобавитьУзелВПолучателейОбработка(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
					ДобавитьУзелВПолучателейОбработка(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
					ДобавитьУзелВПолучателейОбработка(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				КонецЕсли;			
			КонецЕсли;
Возврат СписокПолучателей;	
	КонецФункции

	Функция ДобавитьУзелВПолучателейОбработка(СписокПолучателей,УзелПолучатель,УзелОтправитель,Загрузка)
	Если Загрузка И УзелПолучатель=УзелОтправитель Тогда //туда-сюда гонять не будем		
	ИначеЕсли НЕ УзелПолучатель.Пустая() Тогда
		СписокПолучателей.Добавить(УзелПолучатель);
	КонецЕсли;
КонецФункции 