
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЛистовПереукладки, 		"Ссылка", Объект.Ссылка);
 	МаркировкаКС.УстановитьПараметрДинамическогоСписка(ПланФакт, 		"Ссылка", Объект.Ссылка);

	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЛистыПереукладкиНаСервере()  
	если не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность тогда
		Записать();
	КонецЕсли;                 
	
	возврат документы.ЗаданиеНаАгрегацию.ЗаполнитьЛистыПереукладкиПоЗНА(объект.Ссылка)
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЛистыПереукладки(Команда)
	Результат = ЗаполнитьЛистыПереукладкиНаСервере();
	если не Результат.Успех тогда
		Сообщить(СтрСоединить(Результат.Ошибки,символы.ПС));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЛистовПереукладкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущаяСтрока = Элементы.СписокЛистовПереукладки.ТекущиеДанные;   
ОткрытьЗначение(ТекущаяСтрока.ссылка);

КонецПроцедуры

&НаСервере
Функция СформироватьQRНаСервере()
	Строка= ЗначениеВСтрокуВнутр(Объект.Ссылка);     
	Строка = стрзаменить(Строка,"¶","");
	Строка = стрзаменить(Строка,символы.ПС,"");
	ОбработкаФормированияКартинки = Обработки.СформироватьКартинкуКодаШКQR.Создать();
		Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
		ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
	//СтруктураДанных = новый Структура("Document,BoxCount,TSD,User",Строка,2,"S001",Справочники.ФизическиеЛица.НайтиПоКоду("SNL-01034"));
	//Сообщить(Строка);       
	//СтрокаСериализованная = ПолучитьДвоичныеДанныеИзСтроки(ОбменДаннымиЧЗ.СериализоватьВJSON(СтруктураДанных));    
	//СтрокаСериализованная = ОбменДаннымиЧЗ.СериализоватьВJSON(СтруктураДанных);
	//Сообщить(СтрокаСериализованная);         
	//ЗаписатьВЛог("Отладка",СтрокаСериализованная,"Система");
	
	//Данные = ОбменДаннымиЧЗ.ПрочитатьИзJSON(СтрокаСериализованная);  
	ТД=новый ТабличныйДокумент;
	тд.ИмяПараметровПечати = "ПечатьЗНА";
	СтруктураДанныхКомпонентыПечати=ОбработкаФормированияКартинки.ПолучитьКомпонентуФормированияDataMatrixКода();	
	//СформироватьQRНаСервере(); 
	Макет = Документы.ЗаданиеНаАгрегацию.ПолучитьМакет("Макет");
	ОблЭтикетка=Макет.ПолучитьОбласть("Строка");
	Рисунок=ОблЭтикетка.Рисунки.QRКод; 		
	ДопПараметры = новый Структура;	
	КартинкаКода=ОбработкаФормированияКартинки.СформироватьКартинкуШК_DataMatrix(СтруктураДанныхКомпонентыПечати,Строка,ДопПараметры);  
	Рисунок.Картинка=КартинкаКода;        
	тд.Вывести(ОблЭтикетка);
	возврат ТД;
		
КонецФункции

&НаКлиенте
Процедура СформироватьQR(Команда) 
 ТД = СформироватьQRНаСервере();	  
 ТД.показать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьЛистВРаботуНаСервере(Лист)
	Документы.ЛистПереукладки.ВернутьЛистОтЗНАВРаботу(Лист);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьЛистВРаботу(Команда) 
	ТекущаяСтрока = Элементы.СписокЛистовПереукладки.ТекущиеДанные;    
	если ТекущаяСтрока<>Неопределено тогда
		ВернутьЛистВРаботуНаСервере(ТекущаяСтрока.Ссылка);
		элементы.СписокЛистовПереукладки.Обновить();         
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьНумерациюКоробов(Команда)
	ПерезаполнитьНумерациюКоробовНаСервере(Объект.ДокОснование);
	элементы.СписокЛистовПереукладки.Обновить();
	Сообщить("Готово");
КонецПроцедуры       

&НаСервереБезКонтекста
Процедура ПерезаполнитьНумерациюКоробовНаСервере(Накладная)
	Документы.ЛистПереукладки.ПереномероватьВсеКоробкиНакладной(Накладная);	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаСервере()           
	
 ДокОбъект = РеквизитФормыВЗначение("Объект");   
 ДокОбъект.ОбработкаЗаполнения(объект.ДокОснование,"",Истина);
 ДокОбъект.записать();
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	ПерезаполнитьНаСервере();
	Закрыть();
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000063 - 2026.06.22
&НаКлиенте
Процедура ВернутьКодыЧЗВРезерв(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ДокОснование) Тогда
		
		Сообщить("Не указан док.основание!");
		
		Возврат;
		
	КонецЕсли;
	
	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Объект.ДокОснование);
	
	Если Не ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		
		Сообщить("Очистка разрешена только для FBS!");
		
		Возврат;
		
	КонецЕсли;
		
	ТекстОповещения = ВернутьКодыЧЗВРезервНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОповещения) Тогда
		
		Сообщить(ТекстОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000063 - 2026.06.22
&НаСервере
Функция ВернутьКодыЧЗВРезервНаСервере()
	
	ТекстОповещения = "";
	МассивТекстов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Лист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК Лист
	|ГДЕ
	|	Лист.ДокОснование = &Накладная
	|	И Лист.Проведен";
	
	Запрос.УстановитьПараметр("Накладная", Объект.ДокОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЛистОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ЛистОбъект.ШтрихкодыУпаковок.Очистить();
		ЛистОбъект.Товары.Очистить();
		
		ЛистОбъект.ЛСК = ПредопределенноеЗначение("Документ.ЛистСборкиКомплектовЧЗ.ПустаяСсылка");
		ЛистОбъект.Завершен = Ложь;
		ЛистОбъект.Проведен = Ложь;
		ЛистОбъект.ПометкаУдаления = Истина;
		
		ЛистОбъект.Записать();
		
		МассивТекстов.Добавить("Очищен "+ЛистОбъект);
		
	КонецЦикла;
	
	Если ПолучитьРеквизитШапки(Объект.ДокОснование, "ОтгрузкаКомплектов", "Документ") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Лист.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ КАК Лист
		|ГДЕ
		|	Лист.ДокОснование.ДокОснование = &Накладная
		|	И Лист.Проведен";
		
		Запрос.УстановитьПараметр("Накладная", Объект.ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЛистОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЛистОбъект.ШтрихкодыУпаковок.Очистить();
			ЛистОбъект.Товары.Очистить();
			
			ЛистОбъект.ЛистНабора = Неопределено; // Кельманов А.В. - Оптимизация работы - 2026.07.08
			
			ЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивТекстов.Добавить("Очищен " + ЛистОбъект);
			
		КонецЦикла;

		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗСБ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗСБ
		|ГДЕ
		|	ЗСБ.ДокОснование = &Накладная
		|	И ЗСБ.Проведен";
		
		Запрос.УстановитьПараметр("Накладная", Объект.ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивТекстов.Добавить("Очищен " + ДокОбъект);
			
		КонецЦикла;

		Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(Объект.ДокОснование);
		
	КонецЕсли;
	
	Если МассивТекстов.Количество() > 0 Тогда                 
		
		ТекстОповещения = СтрСоединить(МассивТекстов, Символы.ПС);
		
	КонецЕсли;
	
	Возврат ТекстОповещения;
	
КонецФункции
