Функция РассчитатьЗаказ(Заказ,ПНК) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Брэнд				КАК Брэнд,
	|	СУММА(ДопРасходы)	КАК ДопРасходы
	|ИЗ
	|	Документ.Машина.РаспределениеРасходов КАК МашинаРаспределениеРасходов
	|ГДЕ
	|	Ссылка = &Машина
	|	И Заказ = &Заказ	 
	|СГРУППИРОВАТЬ ПО
	|	Брэнд";
	
	Запрос.УстановитьПараметр("Машина",	Заказ.Машина);
	Запрос.УстановитьПараметр("Заказ",	Заказ);
	
	ДопРасходы=Запрос.Выполнить().Выгрузить();
	
	ДопРасходы.Колонки.Добавить("СуммаНакладной",		ПолучитьОписаниеТиповЧисла(19,2));	
	ДопРасходы.Колонки.Добавить("ДопРасходыСписано",	ПолучитьОписаниеТиповЧисла(19,2));	
	ДопРасходы.Колонки.Добавить("МаксСумма",			ПолучитьОписаниеТиповЧисла(19,2));
	ДопРасходы.Колонки.Добавить("МаксСтрокаТЧ");
		
	Запрос=Новый Запрос;
	Запрос.Текст="	
	|ВЫБРАТЬ 
	|	ТипТовара,Брэнд,Модель,Номенклатура,
	|	СУММА(КоличествоПоЗаказу)	КАК КоличествоПоЗаказу,
	|	СУММА(ВсегоПоЗаказу)		КАК ВсегоПоЗаказу,
	|	СУММА(КоличествоПоПНК)		КАК КоличествоПоПНК,
	|	СУММА(ВсегоПоПНК)			КАК ВсегоПоПНК
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	Номенклатура.Родитель.Родитель.Родитель КАК ТипТовара,
	|	Номенклатура.Родитель.Родитель 			КАК Брэнд,
	|	Номенклатура.Родитель 					КАК Модель,
	|	Номенклатура		 					КАК Номенклатура,
	|	Количество			 					КАК КоличествоПоЗаказу,
	|	Всего									КАК ВсегоПоЗаказу,
	|	0			 							КАК КоличествоПоПНК,
	|	0										КАК ВсегоПоПНК	
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары 		КАК ТЧЗаказа
	|ГДЕ
	|	ТЧЗаказа.Ссылка = &Заказ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура.Родитель.Родитель.Родитель КАК ТипТовара,
	|	Номенклатура.Родитель.Родитель 			КАК Брэнд,
	|	Номенклатура.Родитель 					КАК Модель,
	|	Номенклатура		 					КАК Номенклатура,
	|	0					 					КАК КоличествоПоЗаказу,
	|	0										КАК ВсегоПоЗаказу,
	|	Количество					 			КАК КоличествоПоПНК,
	|	0										КАК ВсегоПоПНК
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ТЧЗаказа
	|ГДЕ
	|	Ссылка = &ПНК
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО 
	|	ТипТовара,Брэнд,Модель,Номенклатура";
	
	Запрос.УстановитьПараметр("Заказ",	Заказ);
	Запрос.УстановитьПараметр("ПНК",	ПНК);
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	ВалютаЗаказа	=Заказ.Валюта;
	КурсЗаказа		=Заказ.Курс;
	
	ВалютаПНК		=ПНК.Валюта;
	КурсПНК			=ПНК.Курс;	
	
	ТН=Запрос.Выполнить().Выгрузить();		
	
	ТН.Колонки.Добавить("ВсегоПоЗаказуСДР",				ПолучитьОписаниеТиповЧисла(19,2));	
	ТН.Колонки.Добавить("Цена",							ПолучитьОписаниеТиповЧисла(19,2));	
	ТН.Колонки.Добавить("ДопРасходы",					ПолучитьОписаниеТиповЧисла(19,2));	
	ТН.Колонки.Добавить("Недостача",					ПолучитьОписаниеТиповЧисла(19,2));		
	ТН.Колонки.Добавить("Ошибки");
	
	Для Каждого СтрокаДР Из ДопРасходы Цикл
		СтрокиНакладной=ТН.НайтиСтроки(Новый Структура("Брэнд",СтрокаДР.Брэнд));	
		
		СуммаЗаказа=0;
		Для Каждого СтрокаНакладной Из СтрокиНакладной Цикл
			СуммаЗаказа=СуммаЗаказа+СтрокаНакладной.ВсегоПоЗаказу;	
		КонецЦикла; 
		
		Для Каждого СтрокаНакладной Из СтрокиНакладной Цикл			
			Если СтрокаНакладной.ВсегоПоЗаказу>СтрокаДР.МаксСумма Тогда
				СтрокаДР.МаксСумма	=СтрокаНакладной.ВсегоПоЗаказу;		
				СтрокаДР.МаксСтрокаТЧ=СтрокаНакладной;
			КонецЕсли; 
			
			Если СуммаЗаказа=0 Тогда 				
				ДопРасходыПоСтроке			=0;
			Иначе
				ДопРасходыПоСтроке			=Окр(СтрокаНакладной.ВсегоПоЗаказу*СтрокаДР.ДопРасходы/СуммаЗаказа,2,1);
			КонецЕсли;			
			
			СтрокаНакладной.ДопРасходы  =СтрокаНакладной.ДопРасходы	+ДопРасходыПоСтроке;			
			СтрокаДР.ДопРасходыСписано	=СтрокаДР.ДопРасходыСписано+ДопРасходыПоСтроке;
		КонецЦикла; 
	
		Дельта=СтрокаДР.ДопРасходы-СтрокаДР.ДопРасходыСписано;
		Если Дельта<>0 Тогда
			Если СтрокаДР.МаксСтрокаТЧ<>Неопределено Тогда				
				СтрокаДР.МаксСтрокаТЧ.ДопРасходы	= СтрокаДР.МаксСтрокаТЧ.ДопРасходы	+Дельта;				
				СтрокаДР.ДопРасходыСписано			= СтрокаДР.ДопРасходыСписано 		+Дельта
			Иначе
				Сообщить("Не удалось распределить доп расходы !");			
			КонецЕсли; 			
		КонецЕсли;
	КонецЦикла;	
	
	ТН.Колонки.Добавить("ДельтаКоличество");
	ТН.Колонки.Добавить("ДельтаСтоимость");
	
	Для Каждого СтрокаТЧ Из ТН Цикл	
		СтрокаТЧ.ДельтаКоличество	=СтрокаТЧ.КоличествоПоПНК	-СтрокаТЧ.КоличествоПоЗаказу;	
		Если СтрокаТЧ.ВсегоПоЗаказу<>0 И СтрокаТЧ.КоличествоПоЗаказу<>0 Тогда
			СтрокаТЧ.ДельтаСтоимость=СтрокаТЧ.ДельтаКоличество*СтрокаТЧ.ВсегоПоЗаказу/СтрокаТЧ.КоличествоПоЗаказу;		
		КонецЕсли;		
		
		СтрокаТЧ.ВсегоПоЗаказуСДР	=СтрокаТЧ.ВсегоПоЗаказу		+СтрокаТЧ.ДопРасходы;
		СтрокаТЧ.ВсегоПоПНК			=глПересчет(СтрокаТЧ.ВсегоПоЗаказуСДР,ВалютаЗаказа,КурсЗаказа,ВалютаПНК,КурсПНК);
		Если СтрокаТЧ.ДельтаКоличество<>0 И СтрокаТЧ.КоличествоПоЗаказу<>0 Тогда
			СтрокаТЧ.Недостача=СтрокаТЧ.ДельтаКоличество*СтрокаТЧ.ВсегоПоПНК/СтрокаТЧ.КоличествоПоЗаказу;		
		КонецЕсли; 
	КонецЦикла; 
	
	СтрокаСвертки="КоличествоПоЗаказу,КоличествоПоПНК,ВсегоПоЗаказу,ВсегоПоПНК,ДопРасходы,ВсегоПоЗаказуСДР,ДельтаКоличество,ДельтаСтоимость,Недостача";
	
	ТМ=ТН.Скопировать();	
	ТМ.Свернуть("ТипТовара,Брэнд,Модель",	СтрокаСвертки);	
	ТМ.Колонки.Добавить("ЦенаПрихода",ПолучитьОписаниеТиповЧисла(19,2));
	Для Каждого СтрокаТМ Из ТМ Цикл
		Если СтрокаТМ.КоличествоПоЗаказу<>0 Тогда
			СтрокаТМ.ЦенаПрихода=Окр(СтрокаТМ.ВсегоПоПНК/СтрокаТМ.КоличествоПоЗаказу,2,1);		
			СтрокаТМ.ВсегоПоПНК	=СтрокаТМ.ЦенаПрихода*СтрокаТМ.КоличествоПоЗаказу;
		КонецЕсли;		
	КонецЦикла; 
	
	ТБ=ТМ.Скопировать();                 
	ТБ.Свернуть("ТипТовара,Брэнд",			СтрокаСвертки);
	
	ТТ=ТБ.Скопировать();
	ТТ.Свернуть("ТипТовара",				СтрокаСвертки);
	
	ТИ=ТТ.Скопировать();
	ТИ.Добавить();
	ТИ.Свернуть(,СтрокаСвертки);
	
	Возврат Новый Структура("ТН,ТМ,ТБ,ТТ,ТИ,Заказ,ПНК",ТН,ТМ,ТБ,ТТ,ТИ,Заказ,ПНК);	
КонецФункции

Функция РассчитатьПроцентДопРасходов(СтрокаТ)
	Если СтрокаТ.ДопРасходы=0 Тогда
		Возврат	"н/у";
	Иначе
		Возврат Формат(100*СтрокаТ.ДопРасходы/СтрокаТ.ВсегоПоЗаказу,"ЧДЦ=2"); 	
	КонецЕсли;
КонецФункции // РассчитатьПроцентДопРасходов()

Функция ВывестиРезультатРасчета(Расчет) Экспорт
	
	ПНК 	= Расчет.ПНК;
	Заказ	= Расчет.Заказ;
	ТМ		= Расчет.ТМ;
	ТН		= Расчет.ТН;
	ТБ		= Расчет.ТБ;
	ТТ		= Расчет.ТТ;
	ТИ		= Расчет.ТИ;
	
	ТД=Новый ТабличныйДокумент;
	
	Макет=ПолучитьМакет("РасчетПриходныхЦен");	
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок");	
	ОблЗаголовок.Параметры.Заполнить(Заказ);	
	ОблЗаголовок.Параметры.ДокОбъект	= ПНК.Ссылка;
	
	ОблЗаголовок.Параметры.СуммаЗаказа 	= Заказ.СуммаДокумента;
	ОблЗаголовок.Параметры.ВалютаЗаказа	= Заказ.Валюта;
	ОблЗаголовок.Параметры.КурсЗаказа	= Формат(Заказ.Курс,"ЧДЦ=4");
	
	ОблЗаголовок.Параметры.ВалютаМашины = Заказ.Машина.Валюта;
	ОблЗаголовок.Параметры.КурсМашины	= Формат(Заказ.Машина.Курс,"ЧДЦ=4");
	
	ТД.Вывести(ОблЗаголовок);	
	
	ОблШапка=Макет.ПолучитьОбласть("Шапка");
	ОблШапка.Параметры.ВалютаЗаказа		= Заказ.Валюта;
	ОблШапка.Параметры.ВалютаНакладной	= ПНК.Валюта;
	
	ТД.Вывести(ОблШапка);
	ТД.НачатьАвтогруппировкуСтрок();
	
	Для Каждого СтрокаТТ Из ТТ Цикл
		ОблТТ=Макет.ПолучитьОбласть("ТипТовара");	
		ОблТТ.Параметры.Заполнить(СтрокаТТ);
		ОблТТ.Параметры.ДопРасходыПроц	=РассчитатьПроцентДопРасходов(СтрокаТТ);		
		
		ТД.Вывести(ОблТТ,1);
		
		СтрокиТБ=ТБ.НайтиСтроки(Новый Структура("ТипТовара",СтрокаТТ.ТипТовара));
		Для Каждого СтрокаТБ Из СтрокиТБ Цикл
			ОблТБ=Макет.ПолучитьОбласть("Брэнд");		
			ОблТБ.Параметры.Заполнить(СтрокаТБ);			
			ОблТБ.Параметры.ДопРасходыПроц=РассчитатьПроцентДопРасходов(СтрокаТБ);
			
			ТД.Вывести(ОблТБ,2);
			
			СтрокиТМ=ТМ.НайтиСтроки(Новый Структура("Брэнд",СтрокаТБ.Брэнд));
			Для Каждого СтрокаТМ Из СтрокиТМ Цикл
				ОблТМ=Макет.ПолучитьОбласть("Модель");		
				ОблТМ.Параметры.Заполнить(СтрокаТМ);
				ОблТМ.Параметры.ДопРасходыПроц=РассчитатьПроцентДопРасходов(СтрокаТМ);
				
				Если СтрокаТМ.КоличествоПоЗаказу<>0 Тогда
					ОблТМ.Параметры.ЦенаПрихода=Окр(СтрокаТМ.ВсегоПоПНК/СтрокаТМ.КоличествоПоЗаказу,2,1);				
				КонецЕсли; 
				
				ТД.Вывести(ОблТМ,3);
				
				СтрокиТН=ТН.НайтиСтроки(Новый Структура("Модель",СтрокаТМ.Модель));
				Для Каждого СтрокаТН Из СтрокиТН Цикл
					ОблТН=Макет.ПолучитьОбласть("Номенклатура");		
					ОблТН.Параметры.Заполнить(СтрокаТН);
					ОблТН.Параметры.ДопРасходыПроц=РассчитатьПроцентДопРасходов(СтрокаТН);
					
					ТД.Вывести(ОблТН,4);
				КонецЦикла; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 	
	ТД.ЗакончитьАвтогруппировкуСтрок();
	
	
	ОблИтого=Макет.ПолучитьОбласть("Итого");
	ОблИтого.Параметры.Заполнить(ТИ[0]);
	ТД.Вывести(ОблИтого);
	
	Возврат ТД;
КонецФункции