#Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция возвращает структуру с данными драйвера оборудования
// (со значениями реквизитов элемента справочника).
//
Функция ПолучитьДанныеДрайвера(Ссылка) Экспорт	
	
	ДанныеДрайвера = Новый Структура();

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.ДрайверыОборудования
	|ГДЕ
	|	Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат	= Запрос.Выполнить();	
	Выборка 	= Результат.Выбрать();
	                                                           
	Если Выборка.Следующий() Тогда
		Для Каждого Колонка Из Результат.Колонки Цикл
			ИмяКолонки=Колонка.Имя;
			
			ДанныеДрайвера.Вставить(ИмяКолонки, Выборка[ИмяКолонки]);					
		КонецЦикла;		
	КонецЕсли;
	
	ДанныеДрайвера.Вставить("ВСоставеКонфигурации"      , Ложь);
	
	Возврат ДанныеДрайвера;	
КонецФункции


// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Менеджер = "Справочник.ДрайверыОборудования";
	//МенеджерОборудованияВызовСервераПереопределяемый.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом


// Возвращает список доступных типов оборудования.
// 
// Возвращаемое значение:
//   Массив - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ПолучитьДоступныеТипыОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ТипОборудования 
	|ИЗ 
	|	Справочник.ДрайверыОборудования
	|ГДЕ
	|	НЕ ПометкаУдаления
	|";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОборудования.Добавить(Выборка.ТипОборудования);	
	КонецЦикла; 
	
	Возврат СписокОборудования;
	
КонецФункции

// Получить описание драйвера из XML пакета.
//
Функция ПолучитьОписаниеДрайвераИзXML(ОписаниеXML) Экспорт
	
	ПараметрыДрайвера = Новый Структура();
	
	Если Не ПустаяСтрока(ОписаниеXML) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ОписаниеXML);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если ЧтениеXML.Имя = "DriverDescription" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПараметрыДрайвера.Вставить("Наименование",							ЧтениеXML.ЗначениеАтрибута("Name"));
			ПараметрыДрайвера.Вставить("Описание",								ЧтениеXML.ЗначениеАтрибута("Description"));
			ПараметрыДрайвера.Вставить("ТипОборудования",   					ЧтениеXML.ЗначениеАтрибута("EquipmentType"));
			ПараметрыДрайвера.Вставить("НомерВерсии",							ЧтениеXML.ЗначениеАтрибута("DriverVersion"));
			ПараметрыДрайвера.Вставить("НомерВерсииИнтеграционногоКомпонента",	ЧтениеXML.ЗначениеАтрибута("IntegrationComponentVersion"));
			ПараметрыДрайвера.Вставить("ИнтеграционныйКомпонент",   			ВРег(ЧтениеXML.ЗначениеАтрибута("IntegrationComponent")) = "TRUE");
			ПараметрыДрайвера.Вставить("ОсновнойДрайверУстановлен", 			ВРег(ЧтениеXML.ЗначениеАтрибута("MainDriverInstalled")) = "TRUE");
			ПараметрыДрайвера.Вставить("URLCкачивания",							ЧтениеXML.ЗначениеАтрибута("DownloadURL"));
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыДрайвера;
	
КонецФункции

#КонецЕсли

#КонецОбласти