#Область ПоискФайлов

Функция ПоискФайловПоМаске(Каталог, МассивМасок) Экспорт
	
	МассивФайлов = Новый Массив;
	
	Для Каждого Маска ИЗ МассивМасок Цикл
		
		Файлы = НайтиФайлы(Каталог, Маска);
		
		Для Каждого Файл ИЗ Файлы Цикл
			МассивФайлов.Добавить(Файл.Имя);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции




//Кухарь А.Ю.  03.04.2026 начало
// OUT-203
Функция ПолучитьЕдинственныйДоговорКонтрагента (Контрагент) экспорт
	Запрос = новый запрос;
	запрос.УстановитьПараметр("Контрагент",Контрагент);
	запрос.текст = "ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	не Договоры.ПометкаУдаления
	|	И Договоры.Владелец = &Контрагент";
	Выборка = запрос.Выполнить().Выбрать();
	если Выборка.Количество()<>1 тогда
		возврат Справочники.Договоры.ПустаяСсылка();
	иначе
		Пока Выборка.Следующий() цикл
			возврат Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции
 
//Кухарь А.Ю. 03.04.2026 конец


// Кухарь А.Ю.  15.04.2026 начало
// OUT-203
Функция ПолучитьЕдинственныйБанковскийСчетКонтрагента (Контрагент) экспорт  
	
	Запрос = новый запрос;
	запрос.УстановитьПараметр("Контрагент",Контрагент);
	запрос.текст = "ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Контрагент
	|	И НЕ БанковскиеСчета.ПометкаУдаления";
	Выборка = запрос.Выполнить().Выбрать();
	если Выборка.Количество()<>1 тогда
		возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	иначе
		Пока Выборка.Следующий() цикл
			возврат Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
		
КонецФункции
// Кухарь А.Ю.  15.04.2026 конец

#КонецОбласти