// +++ {Кузнецов Сергей Владимирович [07.11.2023]
Перем ПроверяемыеРеквизиты;
// }Кузнецов Сергей Владимирович +++ [07.11.2023]

// Шворобей ВЮ 30.09.2024 ++
Функция ЗаписатьПроИзмененияСкидок(ТаблицаИзмененныхСтрок) Экспорт
	
	Если ТипЗнч(ТаблицаИзмененныхСтрок) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого СтрокаСкидок Из ТаблицаИзмененныхСтрок Цикл
			
			Если ЗначениеЗаполнено(СтрокаСкидок.Номенклатура) Тогда
				
				Запись = РегистрыСведений.ЖурналИзмененийСкидок.СоздатьМенеджерЗаписи();
				
				Запись.Дата			= ТекущаяДатаСеанса();
				Запись.Номенклатура		= СтрокаСкидок.Номенклатура;			
				Запись.Контрагент		= Ссылка;
				
				Запись.СтараяСкидка		= СтрокаСкидок.ИсхСкидка;
				Запись.НоваяСкидка		= СтрокаСкидок.Скидка;
				
				Запись.СтараяНаценка		= СтрокаСкидок.ИсхНаценка;
				Запись.НоваяНаценка		= СтрокаСкидок.Наценка;
				
				Запись.ТипЦен			= СтрокаСкидок.ТипЦен;
				
				Запись.НомерСообщения	= ПараметрыСеанса.НомерСообщения;
				Запись.Отправитель		= ОбменДанными.Отправитель;			
				Запись.Пользователь		= ПараметрыСеанса.Пользователь;
				
				Запись.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// Шворобей ВЮ 30.09.2024 ++

Процедура ПередЗаписью(Отказ)
	// +++ {Кузнецов Сергей Владимирович [07.11.2023]
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ПроверяемыеРеквизиты = Новый Структура;       
		Если ЭтоНовый() И НЕ КодВторичногоКонтрагентаДляB2B = ""  Тогда
			ПроверяемыеРеквизиты.Вставить("ЭтоНовый",Истина); 
		Иначе
			Если НЕ ЭтоГруппа И НЕ КодВторичногоКонтрагентаДляB2B ="" Тогда
				ПроверяемыеРеквизиты.Вставить("Наименование",Ссылка.Наименование);
				ПроверяемыеРеквизиты.Вставить("ЕМэйл1",Ссылка.ЕМэйл1);
				ПроверяемыеРеквизиты.Вставить("КаналСбыта1",Ссылка.КаналСбыта1);
				ПроверяемыеРеквизиты.Вставить("КодВторичногоКонтрагентаДляB2B",Ссылка.КодВторичногоКонтрагентаДляB2B);
				ПроверяемыеРеквизиты.Вставить("Скидки",Ссылка.Скидки.Выгрузить());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [07.11.2023]
	Если НЕ ОбменДанными.Загрузка Тогда
		Отказ=НЕ (ПолучитьПолномочиеПользователя("РедактированиеКонтрагентов") ИЛИ ПолучитьПолномочиеПользователя("ВводНовыхКонтрагентов"));
		//крохин начало 22.11.2011
		//контроль оставляем только в форме
		//крохин начало 15.08.2013
		//Колобков попросил вернуть запрет
		//Если НЕ Отказ И Владелец.Код="SMN" Тогда
		//	Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеИнтегральныхКонтрагентов");	
		//КонецЕсли; 
		//крохин начало 01.09.2013
		//для перезаписи менеджера в интегральном права нужна, оставляем проверку только в форме
		//Если НЕ Отказ И Владелец.Код="SMN" Тогда
		//	Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеИнтегральныхКонтрагентов");	
		//КонецЕсли; 
		//крохин конец 01.09.2013
		//крохин конец 15.08.2013
		//крохин конец 22.11.2011
		
		//крохин начало 05.09.2013
		//запретим менять иерархию smn-контрагентов
		Если НЕ Отказ И Владелец.Код="SMN" И Ссылка.Родитель <> Родитель Тогда
			Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеИнтегральныхКонтрагентов");
			#Если Клиент Тогда
				//Кухарь 09.11.15 начало
				если Отказ тогда
					Сообщить("Недостаточно полномочий для редактирования интегральных контрагентов!");
				КонецЕсли;
				//Кухарь 09.11.15 конец
			#КонецЕсли
		КонецЕсли;
		//крохин конец 05.09.2013
		//Кухарь 08.02.16 начало
		//Перенёс в модуль объекта из формы элемента
		Если Владелец <> Справочники.ИБ.НайтиПоКоду("SMN") И Не ЭтоГруппа И НЕ ИНН = "00" И НЕ ИНН = "7707083893" Тогда
			ЗапросИНН = Новый Запрос;
			ЗапросИНН.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Контрагент,
			|	Контрагенты.ИНН,
			|	Контрагенты.Код
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Владелец = &Владелец
			|	И Контрагенты.ИНН = &ИНН
			|	И Контрагенты.Ссылка <> &Ссылка";
			ЗапросИНН.УстановитьПараметр("Владелец",Владелец);
			ЗапросИНН.УстановитьПараметр("ИНН",ИНН);
			ЗапросИНН.УстановитьПараметр("Ссылка",Ссылка);
			ВыборкаИНН = ЗапросИНН.Выполнить().Выбрать();
			Пока ВыборкаИНН.Следующий() Цикл
				#Если Клиент Тогда
					Сообщить("Контрагент с ИНН "+ИНН + " уже существует: "+ВыборкаИНН.Контрагент+ " (код: "+ВыборкаИНН.Код+")");
				#КонецЕсли
				Отказ = Истина;
			КонецЦикла;
		КонецЕсли;
		//Кухарь 08.02.16 конец
		
		//Кухарь А.Ю.  20.09.2021 начало
		если не ЭтоГруппа тогда
			//Кухарь А.Ю.  20.09.2021 конец	
			//крохин начало 14.09.2021	
			Если Не Ведущий.Пустая() Тогда 
				НадоПерезаписыватьИнтегральногоКонтрагента = Ложь;
				Интегральный = Ведущий.ПолучитьОбъект();
				Если НЕ Менеджер.Пустая() И Ведущий.Менеджер <> Менеджер  Тогда	
					Интегральный.Менеджер = Менеджер;
					НадоПерезаписыватьИнтегральногоКонтрагента = Истина;
				КонецЕсли;
				
				Если Ведущий.КаналСбыта1 <> КаналСбыта1 И НЕ КаналСбыта1.Пустая() Тогда
					Интегральный.КаналСбыта1 = КаналСбыта1;
					НадоПерезаписыватьИнтегральногоКонтрагента = Истина;	
				КонецЕсли;
				Если НадоПерезаписыватьИнтегральногоКонтрагента Тогда
					Интегральный.Записать();
				КонецЕсли;
			КонецЕсли;
			//крохин конец 14.09.2021
			//Кухарь А.Ю.  20.09.2021 начало
		КонецЕсли;
		//Кухарь А.Ю.  20.09.2021 конец
		
	КонецЕсли;
	
	//крохин начало 27.01.2012
	//интегральные группы корректируем только в офисе
	Если ОбменДанными.Загрузка И Владелец = Справочники.ИБ.НайтиПоКоду("SMN") И ЭтоГруппа И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		//	Если ОбменДанными.Загрузка И Владелец = Справочники.ИБ.НайтиПоКоду("SMN")  Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//крохин конец 27.01.2012
	
	//крохин начало 23.01.2012
	Если НЕ ОбменДанными.Загрузка Тогда
		ВыгрузитьВТЦ();
	КонецЕсли;
	//крохин конец 23.01.2012
	
	//крохин начало 08.07.2019
	//запретим выгружать Мегамарт АО Диски ЮГ, по этому контрагенту в ЦО и филиале должны быть разные реквизиты
	Если Код = "SSP-3687" И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
	Иначе
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	//крохин конец 08.07.2019
	
	// Шворобей ВЮ 09.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2458
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(СтавкаНДСКонтрагента) Тогда
			Если СтрДлина(ИНН) = 12 Тогда
				СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.БезНДС;
			Иначе  
				//крохин начало 02.03.2026
				//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-158
				Если ТекущаяДата() > '20260101' Тогда   
				СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.НДС22;	
					Иначе
				СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.НДС20;  
				КонецЕсли;
				//крохин конец 02.03.2026
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// для сайта b2b нечаева 30052022 +++		
	Выгружать=ПроцедурыОбменаССайтом.РегистрироватьИзмененияКонтрагентовДляСайта_b2b(Ссылка,ЭтотОбъект);
	Если Выгружать Тогда
		ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(Ссылка,Отказ);
	КонецЕсли;
	// для сайта b2b нечаева 30052022 ---
	
	//нечаева 21,10,2022 +++
	// если модифицируют интегрального добавим автоматом на сайт б2б  все подчиненные.
	Если Владелец = Справочники.ИБ.НайтиПоКоду("SMN") и выгружать  Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	Контрагенты.Код КАК Код
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ведущий.Ссылка = &Ссылка
		|	И Контрагенты.ПометкаУдаления = ложь";
		// нечаева 02,12,2022++
		// т.к. теперь передаем битрикс активность, нужно всех перевыгрузить, и снять-поставить активность. если меняем у интегрального.
		//   |	И Контрагенты.НеИспользовать = ложь";
		// нечаева 02,12,2022---			
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			#Если Клиент Тогда
				//Сообщить("Контрагент добавлен в план обмена на б2б: "+Выборка.Контрагент+ " (код: "+Выборка.Код+")");
				
			#КонецЕсли
			ТекСсылка = выборка.контрагент;
			ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(ТекСсылка,Отказ);
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 21,10,2022 ----
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// +++ {Кузнецов Сергей Владимирович [07.11.2023]
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если НЕ ПроверяемыеРеквизиты.Количество()=0 Тогда
			Если  ПроверяемыеРеквизиты.Свойство("ЭтоНовый") И ПроверяемыеРеквизиты.ЭтоНовый Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.ОбменМерч.НайтиПоНаименованию("Мерч",Истина), Ссылка);
			Иначе
				Если Владелец = Справочники.ИБ.НайтиПоНаименованию("Колготки Москва",Истина) И НЕ ЭтоГруппа И ((НЕ ПроверяемыеРеквизиты.Свойство("Наименование") И НЕ Наименование = ПроверяемыеРеквизиты["Наименование"]) ИЛИ (ПроверяемыеРеквизиты.Свойство("КодВторичногоКонтрагентаДляB2B") И НЕ КодВторичногоКонтрагентаДляB2B = ПроверяемыеРеквизиты["КодВторичногоКонтрагентаДляB2B"] И НЕ КодВторичногоКонтрагентаДляB2B = "")) ИЛИ (ПроверяемыеРеквизиты.Свойство("ЕМэйл1") И  НЕ ЕМэйл1 = ПроверяемыеРеквизиты["ЕМэйл1"]) ИЛИ (ПроверяемыеРеквизиты.Свойство("КаналСбыта1") И  НЕ КаналСбыта1 = ПроверяемыеРеквизиты["КаналСбыта1"]) ИЛИ  (ПроверяемыеРеквизиты.Свойство("Скидки") И ( НЕ ДанныеСовпадают(Скидки.Выгрузить(), ПроверяемыеРеквизиты["Скидки"])))  Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.ОбменМерч.НайтиПоНаименованию("Мерч",Истина), Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [07.11.2023]
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		//крохин начало
		//Префикс=Владелец.Код+"-";
		Если Владелец.Код = "SSP" Тогда
			// Кухарь А.Ю.  07.09.2022 начало
			//Кончились номера
			// Префикс="SSR-";
			Префикс="SST-";		
			// Кухарь А.Ю.  07.09.2022 конец

			//крохин начало 15.06.2012
			//в SMN тоже закончились коды
		ИначеЕсли Владелец.Код = "SMN" Тогда
			// Кухарь А.Ю.  21.06.2023 начало
			//SMR закончились
			//Префикс="SMR-";
			Префикс="SMS-";			
			// Кухарь А.Ю.  21.06.2023 конец
			//крохин конец 15.06.2012
		Иначе
			Префикс=Владелец.Код+"-"
		КонецЕсли;
		//крохин конец
		
	Иначе
		Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ ЭтоГруппа Тогда
		ОсновнойДоговор	=Неопределено;
		КодЦБ			=Неопределено;
		Ведущий			=Неопределено;
	КонецЕсли;	
	//крохин начало 03.02.2011
	//обнулим пункт доставки, банковский счет при копировании
	ОсновнойБанковскийСчет = Неопределено;
	ОсновнойДоговорКасса = Неопределено;
	ОсновнойПунктДоставки = Неопределено;
	//крохин конец 03.02.2011
	
КонецПроцедуры

Процедура ВыгрузитьВТЦ()
	
	//крохин начало 19.04.2019
	//запретим выгружать Мегамарт АО Дикси ЮГ, по этому контрагенту в ЦО и филиале должны быть разные реквизиты
	Если Код = "SSP-3687" Тогда
Возврат;
    КонецЕсли;
	//крохин конец 19.04.2019

	
	//крохин начало
	//выгрузим контрагента в филиалы, если необходимо
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодУзла");
	//крохин начало 14.11.2012
	//по контрагенту тоже можно ставить отдельные узлы
	//ВерхнийУровень = ЭтотОбъект.Родитель;
	ВерхнийУровень = ЭтотОбъект.Ссылка;
	//крохин конец 14.11.2012
	Пока ВерхнийУровень <> Справочники.Контрагенты.ПустаяСсылка() Цикл
		Для Каждого КодУзла Из ВерхнийУровень.РегиональныеУзлы Цикл
			//Катаев+ 25/07/13
			//СтрокаТЗ = ТЗ.Добавить();
			//СтрокаТЗ.КодУзла = КодУзла.КодУзла;
			Если Не ПустаяСтрока(КодУзла.КодУзла) Тогда
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.КодУзла = КодУзла.КодУзла;
			КонецЕсли;
			//Катаев- 25/07/13
		КонецЦикла;
		ВерхнийУровень = ВерхнийУровень.Родитель;
	КонецЦикла;
	ТЗ.Свернуть("КодУзла");
	//крохин начало
	//из складских баз выгружаем только в ЦО
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ТЗ.Очистить();
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.КодУзла = "SNL";
	КонецЕсли;
	//крохин конец
	Если Тз.Количество() <> 0 Тогда
		СписокУзловПолучателей=Новый Массив;	
		Для Каждого строкаТЗ Из ТЗ Цикл
			//+HELP-5068 20250515 Михайловский
			//вместо
			//СписокУзловПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(СтрокаТЗ.КодУзла));
			СсылУз = ПланыОбмена.Основной.НайтиПоКоду(СтрокаТЗ.КодУзла);
			Если НЕ СсылУз.Пустая() Тогда
				СписокУзловПолучателей.Добавить(СсылУз);
			КонецЕсли;
			//-HELP-5068 20250515 Михайловский
		КонецЦикла;
		//+HELP-5068 20250515 Михайловский
		Если СписокУзловПолучателей.Количество() > 0 Тогда
		//-HELP-5068 20250515 Михайловский	
			Для Н = 0 По СписокУзловПолучателей.Количество()-1 Цикл
				ЭтотОбъект.ОбменДанными.Получатели.Добавить(СписокУзловПолучателей.Получить(Н));	
			КонецЦикла;
		КонецЕсли;	
		Если НЕ ЭтотОбъект.ссылка.ЭтоГруппа Тогда
			
			
			//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ЭтотОбъект.ссылка);
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПунктыДоставки.Ссылка КАК Адрес
			|ИЗ
			|	Справочник.ПунктыДоставки КАК ПунктыДоставки
			|ГДЕ
			|	ПунктыДоставки.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец",ЭтотОбъект.ссылка);			   
			ВыборкаФактАдреса =	Запрос.Выполнить().Выбрать();
			Пока ВыборкаФактАдреса.Следующий() Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаФактАдреса.Адрес);	
			КонецЦикла;      
			//крохин начало 27.02.2013
			//если не заполнен Код ЦБ, выгружаем договоры и счета по владельцу 
			
			//Запрос = Новый Запрос;
			//Запрос.Текст = "ВЫБРАТЬ
			//|	Договоры.Ссылка КАК Договор
			//|ИЗ
			//|	Справочник.Договоры КАК Договоры
			//|ГДЕ
			//|	Договоры.КодЦБ = &КодЦБ";
			//Запрос.УстановитьПараметр("КодЦБ",ЭтотОбъект.ссылка.КодЦБ);
			//ВыборкаДоговоры =	Запрос.Выполнить().Выбрать();
			//Пока ВыборкаДоговоры.Следующий() Цикл
			//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаДоговоры.Договор);
			//КонецЦикла;
			////банковские счета
			//Запрос = Новый Запрос;
			//Запрос.Текст = "ВЫБРАТЬ
			//|	БанковскиеСчета.Ссылка КАК БанковскийСчет
			//|ИЗ
			//|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			//|ГДЕ
			//|	БанковскиеСчета.Владелец.КодЦБ = &КодЦБ";
			//Запрос.УстановитьПараметр("КодЦБ",ЭтотОбъект.ссылка.КодЦБ);
			//ВыборкаБанковскиеСчета =	Запрос.Выполнить().Выбрать();
			//Пока ВыборкаБанковскиеСчета.Следующий() Цикл
			//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаБанковскиеСчета.БанковскийСчет);
			//КонецЦикла;
			Если НЕ ПустаяСтрока(ЭтотОбъект.Ссылка.КодЦб) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	Договоры.Ссылка КАК Договор
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.КодЦБ = &КодЦБ";
				Запрос.УстановитьПараметр("КодЦБ",ЭтотОбъект.ссылка.КодЦБ);
				ВыборкаДоговоры =	Запрос.Выполнить().Выбрать();
				Пока ВыборкаДоговоры.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаДоговоры.Договор);
				КонецЦикла;
				//банковские счета
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	БанковскиеСчета.Ссылка КАК БанковскийСчет
				|ИЗ
				|	Справочник.БанковскиеСчета КАК БанковскиеСчета
				|ГДЕ
				|	БанковскиеСчета.Владелец.КодЦБ = &КодЦБ";
				Запрос.УстановитьПараметр("КодЦБ",ЭтотОбъект.ссылка.КодЦБ);
				ВыборкаБанковскиеСчета =	Запрос.Выполнить().Выбрать();
				Пока ВыборкаБанковскиеСчета.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаБанковскиеСчета.БанковскийСчет);
				КонецЦикла;
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	Договоры.Ссылка КАК Договор
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.Владелец = &Владелец";
				Запрос.УстановитьПараметр("Владелец",ЭтотОбъект.ссылка);
				ВыборкаДоговоры =	Запрос.Выполнить().Выбрать();
				Пока ВыборкаДоговоры.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаДоговоры.Договор);
				КонецЦикла;
				//банковские счета
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	БанковскиеСчета.Ссылка КАК БанковскийСчет
				|ИЗ
				|	Справочник.БанковскиеСчета КАК БанковскиеСчета
				|ГДЕ
				|	БанковскиеСчета.Владелец = &Владелец";
				Запрос.УстановитьПараметр("Владелец",ЭтотОбъект.ссылка);
				ВыборкаБанковскиеСчета =	Запрос.Выполнить().Выбрать();
				Пока ВыборкаБанковскиеСчета.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВыборкаБанковскиеСчета.БанковскийСчет);
				КонецЦикла;
			КонецЕсли;
			//крохин конец 27.02.2013
			
		КонецЕсли;
		//не выгружаем иерархию и ведущих, они выгрузятся сами, при записи элемента/группыв соответствующей группе
		//ведущие
		//Если Не ЭтотОбъект.ссылка.Ведущий.Пустая() Тогда
		//ВерхнийУровеньВедущий = ЭтотОбъект.ссылка.Ведущий;
		//Пока ВерхнийУровеньВедущий <> Справочники.Контрагенты.ПустаяСсылка() Цикл
		//	
		//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВерхнийУровеньВедущий);
		//	ВерхнийУровеньВедущий = ВерхнийУровеньВедущий.Родитель;
		//КонецЦикла;
		
		//КонецЕсли;
		//иерархия
		
		//ВерхнийУровень = ЭтотОбъект.ссылка;
		//Пока ВерхнийУровень <> Справочники.Контрагенты.ПустаяСсылка() Цикл
		//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ВерхнийУровень);
		//	ВерхнийУровень = ВерхнийУровень.Родитель;
		//КонецЦикла;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

// +++ {Кузнецов Сергей Владимирович [07.11.2023]
// Сравнивает данные сложной структуры с учетом вложенности.
//
// Параметры:
//  Данные1 - Структура
//          - ФиксированнаяСтруктура
//          - Соответствие
//          - ФиксированноеСоответствие
//          - Массив
//          - ФиксированныйМассив
//          - ХранилищеЗначения
//          - ТаблицаЗначений
//          - Строка
//          - Число
//          - Булево - сравниваемые данные.
//  Данные2 - Произвольный - те же типы, что и для параметра Данные1.
//
// Возвращаемое значение:
//  Булево - Истина, если совпадают.
//
Функция ДанныеСовпадают(Данные1, Данные2) Экспорт
	
	Если ТипЗнч(Данные1) <> ТипЗнч(Данные2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Данные1) = Тип("Структура")
		ИЛИ ТипЗнч(Данные1) = Тип("ФиксированнаяСтруктура") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Для каждого КлючИЗначение Из Данные1 Цикл
			СтароеЗначение = Неопределено;
			
			Если НЕ Данные2.Свойство(КлючИЗначение.Ключ, СтароеЗначение)
				ИЛИ НЕ ДанныеСовпадают(КлючИЗначение.Значение, СтароеЗначение) Тогда
				
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("Соответствие")
		ИЛИ ТипЗнч(Данные1) = Тип("ФиксированноеСоответствие") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		КлючиНовогоСоответствия = Новый Соответствие;
		
		Для каждого КлючИЗначение Из Данные1 Цикл
			КлючиНовогоСоответствия.Вставить(КлючИЗначение.Ключ, Истина);
			СтароеЗначение = Данные2.Получить(КлючИЗначение.Ключ);
			
			Если НЕ ДанныеСовпадают(КлючИЗначение.Значение, СтароеЗначение) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого КлючИЗначение Из Данные2 Цикл
			Если КлючиНовогоСоответствия[КлючИЗначение.Ключ] = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("Массив")
		ИЛИ ТипЗнч(Данные1) = Тип("ФиксированныйМассив") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Данные1.Количество()-1;
		Пока Индекс >= 0 Цикл
			Если НЕ ДанныеСовпадают(Данные1.Получить(Индекс), Данные2.Получить(Индекс)) Тогда
				Возврат Ложь;
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("ТаблицаЗначений") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Данные1.Колонки.Количество() <> Данные2.Колонки.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Для каждого Колонка Из Данные1.Колонки Цикл
			Если Данные2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Индекс = Данные1.Количество()-1;
			Пока Индекс >= 0 Цикл
				Если НЕ ДанныеСовпадают(Данные1[Индекс][Колонка.Имя], Данные2[Индекс][Колонка.Имя]) Тогда
					Возврат Ложь;
				КонецЕсли;
				Индекс = Индекс - 1;
			КонецЦикла;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("ХранилищеЗначения") Тогда
		
		Если НЕ ДанныеСовпадают(Данные1.Получить(), Данные2.Получить()) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Данные1 = Данные2;
	
КонецФункции
// }Кузнецов Сергей Владимирович +++ [07.11.2023]

// Шворобей ВЮ 13.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4050
Функция ЗаписатьИзмененияТЗнаДО(ТаблицаИзмененныхСтрокТЗ) Экспорт
	
	Если ТипЗнч(ТаблицаИзмененныхСтрокТЗ) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого СтрокаТЗ Из ТаблицаИзмененныхСтрокТЗ Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЗ.ИмяФайла) Тогда
				
				Запись = РегистрыСведений.ТЗнаДОКонтрагентов.СоздатьМенеджерЗаписи();
				
				Запись.Период			= ТекущаяДатаСеанса();
				Запись.Контрагент		= ?(НЕ ЗначениеЗаполнено(СтрокаТЗ.Контрагент), Ссылка, СтрокаТЗ.Контрагент);
				
				Запись.ИмяФайла		= СтрокаТЗ.ИмяФайла;
				Запись.ТипТЗнаДО		= СтрокаТЗ.ТипТЗнаДО;
				
				Запись.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// Шворобей ВЮ 13.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4050
