Процедура НастроитьПостроитель(ВыбПостроитель,СтрокаОтбора="") Экспорт
	Если ПустаяСтрока(Тип) ИЛИ ПустаяСтрока(Вид) Тогда Возврат КонецЕсли; 
	
	ВыбПостроитель.Текст="
	|ВЫБРАТЬ
	|	*
	|ИЗ "+Тип+"."+Вид+"
	|ГДЕ Ссылка=&Ссылка
	|{ГДЕ Ссылка.*}";
	
	ВыбПостроитель.ЗаполнитьНастройки();	
	
	Если НЕ ПустаяСтрока(СтрокаОтбора) Тогда
		Настройки=ЗначениеИзСтрокиВнутр(СтрокаОтбора);
		
		ВыбПостроитель.УстановитьНастройки(Настройки,Истина,Ложь,Ложь,Ложь,Ложь);
		
		Отбор=ВыбПостроитель.Отбор;
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если ЭлементОтбора.Использование И ЭлементОтбора.Значение="###" Тогда
				Если Найти(ЭлементОтбора.ПутьКДанным,"КодФизическогоУзла")<>0 Тогда
					ЭлементОтбора.Значение=ПараметрыСеанса.ЭтотУзел.Код;			
				КонецЕсли;			
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры