
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗадачиАСУ") Тогда
		// Заполнение шапки
		Заказчик = ДанныеЗаполнения.Заказчик;
		КатегорияЗадачи = ДанныеЗаполнения.КатегорияЗадачи;
		НаименованиеЗадачи = ДанныеЗаполнения.НаименованиеЗадачи;
		ПодразделениеЗаказчика = ДанныеЗаполнения.ПодразделениеЗаказчика;
		ПодразделениеИсполнителя = ДанныеЗаполнения.ПодразделениеИсполнителя;
		ОсновнаяЗадача = ДанныеЗаполнения.ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Совещание") Тогда
		// Заполнение шапки
		Совещание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
	
	
	// Кухарь А.Ю.  09.08.2022 начало
	//
	ДатаНачалаРаботыПоПоследнемуИзменению=ПустаяДата();
	ДатаФактическогоНачала=ПустаяДата();
	ДатаПланируемогоНачала=ПустаяДата();
	ДатаФактическогоНачала=ПустаяДата();
	ДатаПланируемогоОкончания=ПустаяДата();
	ДатаПостановки=ПустаяДата();
	ЗадачаИзСогласованногоПлана=Ложь;
	// Кухарь А.Ю.  09.08.2022 конец
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	    
ЭтотОбъект.Автор = параметрысеанса.Пользователь.ФизЛицо;

// Кухарь А.Ю.  09.08.2022 начало
//
ДатаНачалаРаботыПоПоследнемуИзменению=ПустаяДата();
ДатаФактическогоНачала=ПустаяДата();
ДатаПланируемогоНачала=ПустаяДата();
ДатаФактическогоНачала=ПустаяДата();
ДатаПланируемогоОкончания=ПустаяДата();
ДатаПостановки=ПустаяДата();
ЗадачаИзСогласованногоПлана=Ложь;
// Кухарь А.Ю.  09.08.2022 конец


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если ЗначениеЗаполнено(Исполнитель) и ЗначениеЗаполнено(Исполнитель.Подразделение) тогда
		ПодразделениеИсполнителя=Исполнитель.Подразделение;
	КонецЕсли;
	
	если ЗначениеЗаполнено(ПродолжительностьДни) и ЗначениеЗаполнено(ДатаПланируемогоНачала) тогда
		Запрос=новый запрос;
		запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	КалендарьДни.Дата КАК Дата
		|ПОМЕСТИТЬ ВремТЗ
		|ИЗ
		|	Справочник.Календарь.Дни КАК КалендарьДни
		|ГДЕ
		|	НЕ КалендарьДни.Ссылка.ПометкаУдаления
		|	И КалендарьДни.Дата > &Дата
		|	И КалендарьДни.Часы = 8
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВремТЗ.Дата КАК Дата
		|ИЗ
		|	ВремТЗ КАК ВремТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		запрос.УстановитьПараметр("Дата",ДатаПланируемогоНачала);
		запрос.Текст=СтрЗаменить(запрос.Текст," ПЕРВЫЕ 100", " ПЕРВЫЕ "+Строка(ПродолжительностьДни));
		результат=запрос.Выполнить().выбрать();
		пока результат.Следующий() цикл
			ДатаПланируемогоОкончания=результат.дата;
		КонецЦикла; 			
	КонецЕсли;
КонецПроцедуры
