Перем МассивЦветовФранчайзинг;

//крохин начало 31.05.2019
//вместо авторегистрации изменений
Процедура ПередЗаписью(Отказ)
	
	Если ОсновнойЦветНеОбязателен Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ЭтоНовый() Тогда
		
		Если Родитель <> Справочники.Цвета.ПустаяСсылка() И ПолучитьРеквизитШапки(Родитель, "НеИспользовать") <> НеИспользовать Тогда
			СообщитьИзМодуля("Реквизит <НеИспользовать> у элемента и у группы должны совпадать!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	//крохин начало 24.02.2023	
	//основной цвет только для групп
	//Если НеИспользовать = Ложь Тогда
	    Если НЕ (ЭтоГруппа ИЛИ НеИспользовать)  Тогда
	//крохин конец 24.02.2023	
			Если НЕ ЗначениеЗаполнено(ОсновнойЦвет) И МассивЦветовФранчайзинг.Найти(Родитель) = Неопределено Тогда
				СообщитьИзМодуля("Основной цвет не заполнен, Элемент не находится в папке <Франчайзинг>");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если Родитель <> Справочники.Цвета.ПустаяСсылка() И ПолучитьРеквизитРодителя(Ссылка, "НеИспользовать") <> НеИспользовать Тогда
			СообщитьИзМодуля("Реквизит <НеИспользовать> у элемента и у группы должны совпадать!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		//крохин начало 24.02.2023	
	//основной цвет только для групп
	//Если НеИспользовать = Ложь Тогда
	    Если НЕ (ЭтоГруппа ИЛИ НеИспользовать)  Тогда
	//крохин конец 24.02.2023
			Если НЕ ЗначениеЗаполнено(ОсновнойЦвет) И МассивЦветовФранчайзинг.Найти(Ссылка) = Неопределено Тогда
				СообщитьИзМодуля("Основной цвет не заполнен, Элемент не находится в папке <Франчайзинг>");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);

КонецПроцедуры
//крохин конец 31.05.2019

Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Цвета.Ссылка КАК Цвет
|ИЗ
|	Справочник.Цвета КАК Цвета
|ГДЕ
|	Цвета.Ссылка В ИЕРАРХИИ(&ГруппаФранчайзинг)
|	И НЕ Цвета.ПометкаУдаления";

Запрос.УстановитьПараметр("ГруппаФранчайзинг", Справочники.Цвета.НайтиПоНаименованию("Франчайзинг"));

УстановитьПривилегированныйРежим(Истина);
МассивЦветовФранчайзинг = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Цвет");
УстановитьПривилегированныйРежим(Ложь);