
Функция ПолучитьСтруктуруСправочниковДляWS (ТЗСправочников) Экспорт 
	
	СтруктураОбмена=Новый Структура();		
	Для каждого СтрТЗ из ТЗСправочников цикл
		если СтрТЗ.ИмяСправочника="Номенклатура"  тогда
			СтруктураМассивов=ПолучитьМассивНоменклатурыДляWS();
			СтруктураОбмена.Вставить("МассивТоваров",СтруктураМассивов["МассивВыгрузки"]);	
		ИначеЕсли  СтрТЗ.ИмяСправочника="ШтрихКоды"  тогда
			Если СтруктураМассивов<>Неопределено тогда
				ТЗ=СтруктураМассивов["ТаблицаНоменклатуры"];
			иначе
				ТЗ=Неопределено
			КонецЕсли;
			СтруктураОбмена.Вставить("МассивШтрихКодов",ПолучитьМассивШКДляWS(ТЗ));	
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураОбмена	
КонецФункции


Функция ПолучитьМассивНоменклатурыДляWS ()
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 30
	|	ОстаткиТМЦОстатки.Номенклатура.Наименование КАК Наименование,
	|	ОстаткиТМЦОстатки.Номенклатура.Цвет.Наименование КАК Цвет,
	|	ОстаткиТМЦОстатки.Номенклатура.Размер.Наименование КАК Размер,
	|	ОстаткиТМЦОстатки.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ОстаткиТМЦОстатки.Номенклатура.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	ОстаткиТМЦОстатки.Номенклатура КАК НоменклатураСсылка,
	|	ОстаткиТМЦОстатки.Номенклатура.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад = &Склад) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";
	запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	запрос.УстановитьПараметр("Склад",Справочники.Склады.НайтиПоКоду("STA-48"));	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		если результат.Наименование=Null тогда Продолжить;КонецЕсли;
		ВремСтруктура = новый Структура("Наименование,Код,Цвет,Размер,ШтукВКоробке,ШтукВКоробочке",
		результат.Наименование,
		результат.Код,		
		результат.Цвет,
		результат.Размер,
		результат.ШтукВКоробке,
		результат.ШтукВКоробочке);			
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	СтруктураВозврата=новый Структура;
	СтруктураВозврата.Вставить("МассивВыгрузки",МассивВыгрузки);
	СтруктураВозврата.Вставить("ТаблицаНоменклатуры",тз.ВыгрузитьКолонку("НоменклатураСсылка"));
	
	Возврат СтруктураВозврата;
КонецФункции


Функция ПолучитьМассивШКДляWS  (МассивНоменклатуры)
	МассивВыгрузки=новый Массив;		
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ШтрихКоды.Наименование КАК Наименование,
	|	ШтрихКоды.ТипШК КАК ТипШК,
	|	ШтрихКоды.ВидШК КАК ВидШК,
	|	ШтрихКоды.Владелец.Код КАК КодНоменклатуры,
	|	ШтрихКоды.Код КАК Код
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	Не ШтрихКоды.ПометкаУдаления 
	|	И ПОДСТРОКА(ШтрихКоды.Наименование, 1, 4) <> ""9999""
	|	И ШтрихКоды.Владелец В(&Владелец)
	|	И ШтрихКоды.ТипШК <> &ТипШК
	|	И ШтрихКоды.ВидШК <> &ВидШК";
	если МассивНоменклатуры<>Неопределено тогда
		запрос.УстановитьПараметр("Владелец",МассивНоменклатуры);      //ШК по ряду позиций
	иначе
		запрос.Текст=СтрЗаменить(запрос.Текст,"И ШтрихКоды.Владелец В(&Владелец)","");    //Все ШК
	КонецЕсли;
	
	
	запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.ПустаяСсылка());
	запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.ПустаяСсылка());	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл			
		если результат.Наименование=Null  тогда Продолжить;КонецЕсли;
		ТипШК=Перечисления.ТипыШтрихКодов.Индекс(результат.ТипШК);
		ВидШК=Перечисления.ВидыШК.Индекс(результат.ВидШК);
		
		ВремСтруктура = новый Структура("Наименование,ТипШК,ВидШК,КодНоменклатуры,Код",
		результат.Наименование,
		ТипШК,		
		ВидШК,
		результат.КодНоменклатуры,
		результат.Код);	
		
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	Возврат МассивВыгрузки;
КонецФункции




Функция ПолучитьСтруктуруПлановНабора () Экспорт 
	
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПеремещениеТовары.Ссылка.Номер КАК Номер,
	|	ПеремещениеТовары.Ссылка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ПеремещениеТовары.Номенклатура.код КАК Номенклатура,
	|	ПеремещениеТовары.Количество КАК Заявка
	|ИЗ
	|	Документ.Перемещение.Товары КАК ПеремещениеТовары
	|ГДЕ
	|	ПеремещениеТовары.Ссылка.Номер = &Номер
	|	И ПеремещениеТовары.Ссылка.Дата >= &Дата";
	запрос.УстановитьПараметр("Номер","SSP-015587");
	запрос.УстановитьПараметр("Дата",'20190711');
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("Номер,ДатаОтгрузки,Номенклатура,Заявка",
		результат.Номер,
		Строка(результат.ДатаОтгрузки),		
		результат.Номенклатура,
		результат.Заявка);
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	
	
КонецФункции


// Кухарь А.Ю.  28.07.2022 начало
//
Функция ПолучитьДанныеТабеля(КодПодразделения,Дата) Экспорт
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ТабельДанные.Сотрудник.ТабельныйНомер КАК СотрудникТабельныйНомер,
	|	ТабельДанные.Значение КАК Значение,
	|	ТабельДанные.Дата КАК Дата
	|ИЗ
	|	Документ.Табель.Данные КАК ТабельДанные
	|ГДЕ
	|	ТабельДанные.Ссылка.Подразделение = &Подразделение
	|	И ТабельДанные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	
	запрос.УстановитьПараметр("Подразделение",Справочники.Подразделения.НайтиПоКоду(КодПодразделения));
	запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("СотрудникТабельныйНомер,Значение,Дата",
		результат.СотрудникТабельныйНомер,
		Строка(результат.Значение),		
		Строка(результат.Дата));
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	

КонецФункции
// Кухарь А.Ю.  28.07.2022 конец



// Кухарь А.Ю.  06.07.2023 начало
//
Функция ПолучитьДанныеПоПапкамВерхнегоУровня () Экспорт
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Ссылка,
	             |	Номенклатура.Наименование КАК Наименование,
	             |	Номенклатура.Код КАК Код,
	             |	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.ЭтоГруппа
	             |	И Номенклатура.Родитель = &Пустая
	             |	И Номенклатура.ВидНоменклатуры = &Товар";
	запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклаутры.Товар);
	запрос.УстановитьПараметр("Пустая",Справочники.Номенклатура.ПустаяСсылка());
	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("Наименование,Код,ПометкаУдаления,УИД",
		результат.Наименование,
		результат.Код,		
		результат.ПометкаУдаления,
		Строка(результат.ссылка.УникальныйИдентификатор()));
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	
	
КонецФункции


Функция ПолучитьДанныеПоКаналамСбыта () Экспорт
	СтруктураОбмена=Новый Структура();		
	МассивВыгрузки=новый Массив;	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КаналСбыта.Ссылка КАК Ссылка,
	|	КаналСбыта.Код КАК Код,
	|	КаналСбыта.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КаналСбыта КАК КаналСбыта
	|ГДЕ
	|	НЕ КаналСбыта.ЭтоГруппа
	|	И не КаналСбыта.ПометкаУдаления";
	
	ТЗ=запрос.Выполнить().выгрузить();
	Для каждого результат из ТЗ цикл
		ВремСтруктура = новый Структура("Наименование,Код,УИД",
		результат.Наименование,
		результат.Код,		
		Строка(результат.ссылка.УникальныйИдентификатор()));
		МассивВыгрузки.Добавить(ВремСтруктура);			
	КонецЦикла;
	
	СтруктураОбмена.Вставить("МассивТоваров",МассивВыгрузки);	
	Возврат СтруктураОбмена;	
	
	
КонецФункции


// Кухарь А.Ю.  06.07.2023 конец
