Перем Ошибки Экспорт;
Перем КритичОшибки Экспорт;



Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	//+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
      
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Проверка ОКС. Автопроверка разрешена для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	//

	ЗаписатьВЛог("Регламент","Начало проверка. Задача: Проверка ОКС.","Информация");                     
	
	// проверяем текущую дату
	Дата1 = ТекущаяДата() - 10*( 60 * 60 * 24); // - 10 дней
	Дата2 = ТекущаяДата();
	
	//Сообщить(""+Дата1+"       "+Дата2);
	Запрос=Новый запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКассовойСмены.Контрагент как контрагент,
	|	ОтчетКассовойСмены.Ссылка как ссылка
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары КАК ОтчетКассовойСмены
	|ГДЕ
	|	ОтчетКассовойСмены.Контрагент.Ведущий = &Пустая
	|	И ОтчетКассовойСмены.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ОтчетКассовойСмены.Ссылка.Проведен = ИСТИНА ";
	
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",Дата2);
	Запрос.УстановитьПараметр("Пустая",Справочники.Контрагенты.ПустаяСсылка());
	
	Рез=Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()>0 Тогда
		СообщитьМенеджеру(рез);
	КонецЕсли;

	ЗаписатьВЛог("Регламент","Конец проверки. Задача: Проверка ОКС.","Информация");                     
	
КонецПроцедуры

Процедура СообщитьМенеджеру(ТЗДанные) Экспорт

	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь       = "*%*%*%";
	//Профиль.Пароль             = "*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
			
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("nadejda@collant.ru");
	Сообщение.Получатели.Добавить("kolobkov_k@collant.ru");
	Сообщение.Отправитель="helpdesk@collant.ru";
		
	Сообщение.Тема="Проверка ОКС на наличие у контрагентов ""ведущих""";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Символы.ПС;
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+"Отсутствует ведущий контрагент у:";
		
	Для Каждого ТекСтр из ТЗДанные Цикл
		
		Контр=ТекСтр.Контрагент;
		ОКС=ТекСтр.Ссылка;
		Строка=Строка+Символы.ПС+НомСтр+". "+Контр.Наименование+" (код: "+Контр.Код+"). Из документа - "+ОКС ;
		Строка=Строка+Символы.ПС;
		НомСтр=НомСтр+1;
				
	КонецЦикла;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Строка=Строка+Символы.ПС+"Служба автопроверки данных.";

	
	Сообщение.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если КритичОшибки.Количество()>0 Тогда
		
		СообщитьКритОшибки();
		
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура СообщитьКритОшибки() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь       = "*%*%*%";
	//Профиль.Пароль             = "*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
			
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
		
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Отправитель="helpdesk@collant.ru";

	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	
	СообщениеКрит.Тема="Проверка ОКС. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры


КритичОшибки= Новый массив;
Ошибки=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;

ТЗКонтр=Новый ТаблицаЗначений;
ТЗКонтр.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗКонтр.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
ТЗКонтр.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗКонтр.Колонки.Добавить("КодПокуп",Новый ОписаниеТипов("Строка"));
