Функция ПолучитьНазначениеПоШК(Знач ШтрихКод) Экспорт
	Результат = Справочники.НазначенияШК.ПустаяСсылка();
			
	ШтрихКод = СокрЛП(ШтрихКод);
	Если СтрНачинаетсяС(ШтрихКод, "777") Тогда
		Результат = Справочники.НазначенияШК.ФизЛицо; 
	//Валетов + 15,04,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9465
	//Сократим коды коробов до 4 цифр
	//ИначеЕсли СтрНачинаетсяС(ШтрихКод, "999000") Тогда 
	ИначеЕсли СтрНачинаетсяС(ШтрихКод, "9990") Тогда
		Результат = Справочники.НазначенияШК.ТипКороба;		
	Иначе           
		Результат = Справочники.НазначенияШК.НайтиПоРеквизиту("ШтрихКод", ШтрихКод);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьНазначениеПоШК(Знач ШтрихКод) Экспорт
