Функция УстановитьОрганизацию(СтрокаТЧ)
	Если СтрокаТЧ.ИсточникОрганизации="Склад" Тогда
		Организация=ТекДок.Склад.Организация;
	ИначеЕсли СтрокаТЧ.ИсточникОрганизации="Документ" Тогда			
		Организация=ТекДок.Организация;					
	КонецЕсли; 
	Если Организация.Пустая() Тогда
		Организация=ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");	
	КонецЕсли;
КонецФункции // УстановитьОрганизацию()


Процедура ПечатьПакета() Экспорт	
	ИмяПринтера=ПолучитьЗначениеПоУмолчанию("ОсновнойПринтер");	
	
	ДопПараметы=Новый Структура;
	ДопПараметы.Вставить("НаборПечатныхФорм",НаборФорм);
	ДопПараметы.Вставить("ПакетнаяПечать",Истина);
	
	Для Каждого СтрокаТЧ Из НаборФорм.Список Цикл
		
		УстановитьОрганизацию(СтрокаТЧ);
		
		ДопПараметы.Вставить("ВыходнаяФорма",СтрокаТЧ);
		ДопПараметы.Вставить("ПредварительнаяПечать",Истина);
		
		ОбработкаПечатиОбъект	= ПолучитьВнешнююОбработку(СтрокаТЧ.ИмяФайла,"PrnForms\");		
		Если ОбработкаПечатиОбъект=Неопределено Тогда Возврат КонецЕсли; 
		
		ОбработкаПечати=ОбработкаПечатиОбъект.ПолучитьФорму();
		ОбработкаПечати.Дата=?(ЕстьРеквизитДокумента("ДатаОтгрузки",ТекДок.Метаданные()),ТекДок.ДатаОтгрузки,ТекДок.Дата);
		
		Если СтрокаТЧ.ВыходнаяФорма="Торг12" ИЛИ СтрокаТЧ.ВыходнаяФорма="СФ"  ИЛИ СтрокаТЧ.ВыходнаяФорма="УПД" Тогда
			ТабДок = ОбработкаПечати.Печать(ТекДок.ПолучитьОбъект(),ДопПараметы);
		Иначе
			ТабДок=Неопределено;
		КонецЕсли;
		Если ТабДок=Неопределено Тогда Продолжить КонецЕсли;
		
		ДляУдаления = Новый Массив;
		Для Каждого стр Из ТабДок.Рисунки Цикл
			Попытка
				ТипОбъекта = ТипЗнч(стр.Объект);
			Исключение
				ТипОбъекта = Неопределено;
			КонецПопытки;
			Если ТипОбъекта = Тип("ActiveX") Тогда
				ДляУдаления.Добавить(стр);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого стр из ДляУдаления Цикл
			ТабДок.Рисунки.Удалить(стр);
		КонецЦикла;
		//табДок = Новый табличныйДокумент;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
			ОбластьОчистки = ТабДок.Области.найти("Заголовок");
			//Очищаем кололнки унифицированнных данных
			Область1 = ТабДок.НайтиТекст("Унифицированная форма № ТОРГ-12",,ОбластьОчистки);
			Область1.Очистить(Истина,Ложь,Истина);
			
			Область = ТабДок.НайтиТекст("Вид операции",,ОбластьОчистки);
			//крохин начало 16.09.2013
			//может не быть такой области, в некоторых mxl
			//Строка1 = Область.Низ;
			//Колонка1 = Область.Лево-1;
			//Колонка2 = Область.Лево+1;
			//ИмяОбласти = "R1C1:R6C"+СокрЛП(Колонка2);
			//Область1 = ТабДок.Область(ИмяОбласти);
			//Область1.Очистить(Истина,Ложь,Истина);
			//ИмяОбласти = "R1C"+СокрЛП(Колонка1)+":R"+СокрЛП(Строка1)+"C"+СокрЛП(Колонка2);
			//Область1 = ТабДок.Область(ИмяОбласти);
			//Область1.Очистить(Истина,Ложь,Истина);
			
			Если Область <> Неопределено Тогда
				Строка1 = Область.Низ;
				Колонка1 = Область.Лево-1;
				Колонка2 = Область.Лево+1;
				ИмяОбласти = "R1C1:R6C"+СокрЛП(Колонка2);
				Область1 = ТабДок.Область(ИмяОбласти);
				Область1.Очистить(Истина,Ложь,Истина);
				ИмяОбласти = "R1C"+СокрЛП(Колонка1)+":R"+СокрЛП(Строка1)+"C"+СокрЛП(Колонка2);
				Область1 = ТабДок.Область(ИмяОбласти);
				Область1.Очистить(Истина,Ложь,Истина);
			КонецЕсли;
			//крохин конец 16.09.2013
			// Удаляем пустые строки до Грузополучателя
			Область = ТабДок.НайтиТекст("Грузополучатель",,ОбластьОчистки);
			Если Область <> Неопределено Тогда
				ОбластьДляУдаления = ТабДок.Область("R1:R"+СокрЛП(Область.Низ-1));
				ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			КонецЕсли;
			// Изменяем ТОВАРНАЯ НАКЛАДНАЯ
			Область = ТабДок.НайтиТекст("ТОВАРНАЯ НАКЛАДНАЯ",,ОбластьОчистки);
			Область.Текст = "ФОРМА ДЛЯ СОГЛАСОВАНИЯ ТОВАРНОЙ НАКЛАДНОЙ";
			//Очищаем ячейку содержащую количество страниц
			стрНачала = Область;
			Область1 = ТабДок.НайтиТекст("стр.", стрНачала);
			Если Область1 <> Неопределено тогда
				ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Область1.Низ)+":R"+СокрЛП(Область1.Низ));
				ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			КонецЕсли;
			//Убираем шапки между данными
			Область1 = ТабДок.НайтиТекст("Итого", стрНачала);
			Строка1 = Область1.Низ;
			Область2 = ТабДок.НайтиТекст("Всего по накладной", стрНачала);
			Строка2 = Область2.Низ;
			Пока Строка2 <> Строка1+1 Цикл
				//Делаем поиск начала следующей строки с данными ТЧ
				Строка3 = Строка1 + 1;
				Пока ТабДок.Область("R"+СокрЛП(Строка3)+"C1").Текст <> "1" Цикл
					Строка3 = Строка3 + 1;
				КонецЦикла;
				ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Строка1)+":R"+СокрЛП(Строка3));
				ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				Область1 = ТабДок.НайтиТекст("Итого", стрНачала);
				Строка1 = Область1.Низ;
				Область2 = ТабДок.НайтиТекст("Всего по накладной", стрНачала);
				Строка2 = Область2.Низ;
			КонецЦикла;
			//Убираем подписи
			Строка3 = ТабДок.ВысотаТаблицы;
			ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Строка2+1)+":R"+СокрЛП(Строка3));
			ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//Убираем Область1
			ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Строка1)+":R"+СокрЛП(Строка1));
			ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ"  Тогда
			ТабДок.АвтоМасштаб = Истина;
			ОбластьОчистки = ТабДок.Области.найти("Заголовок");
			Область = ТабДок.НайтиТекст("Приложение №1",,ОбластьОчистки);
			Область.Очистить();
			Область1 = табДок.НайтиТекст("ФАКТУРА");
			Область1.Текст = "ФОРМА ДЛЯ СОГЛАСОВАНИЯ СЧЕТ-ФАКТУРЫ К НАКЛАДНОЙ № "+ТекДок.Номер;
		
			//Катаев+ 08/11/13 Уменьшил шрифт для выводимого текста по просьбе Кудряшова (на некоторых СФ обрезался номер)
			Шрифт = Новый Шрифт("Arial",12, Истина);
			Область1.Шрифт = Шрифт;
			//Катаев- 08/11/13
			ОбластьДляУдаления = ТабДок.Область("R1:R"+СокрЛП(Область1.Низ-1));
			ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//Очищаем ячейку содержащую количество страниц
			стрНачала = Область;
			Область1 = ТабДок.НайтиТекст("стр. 1 из", стрНачала);
			Если Область1 <> Неопределено Тогда
				Область1.Очистить(Истина,Ложь,Истина);
			КонецЕсли;
			Область2 = ТабДок.НайтиТекст("Страница", стрНачала);
			Если Область2 <> Неопределено Тогда
				Если область1 = Неопределено Тогда
					Область2.Очистить(Истина,Ложь,Истина);
				Иначе
					ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Область1.Низ)+":R"+СокрЛП(Область1.Низ));
					ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				КонецЕсли;
			КонецЕсли;
			Если Область1 <> Неопределено Тогда
				стрНачала = Область1;
			ИначеЕсли Область2 <> Неопределено тогда
				стрНачала = Область2;
			КонецЕсли;
			//Убираем шапки между данными
			Область1 = ТабДок.НайтиТекст("стр.", стрНачала);
			Область2 = ТабДок.НайтиТекст("Страница", стрНачала);
			Если Область1 = Неопределено И Область2 = Неопределено Тогда
				СтрокаНачалаУдаления = 0;
			Иначе
				Если Область1 = Неопределено Тогда
					Строка1 = Область2.Низ;
				Иначе
					Строка1 = Область1.Низ;
				КонецЕсли;
				Если Область2 = Неопределено Тогда
					Строка2 = Область1.Низ;
				Иначе
					Строка2 = Область2.Низ;
				КонецЕсли;
				Если Строка1 < Строка2 Тогда
					СтрокаНачалаУдаления = Строка1;
				Иначе
					СтрокаНачалаУдаления = Строка2;
				КонецЕсли;
			КонецЕсли;
			Пока СтрокаНачалаУдаления <> 0 Цикл
				//Делаем поиск начала следующей строки с данными ТЧ
				Строка3 = Строка1 + 1;
				Пока Не (ТабДок.Область("R"+СокрЛП(Строка3)+"C1").Текст = "1" ИЛИ ТабДок.Область("R"+СокрЛП(Строка3)+"C2").Текст = "1" ИЛИ ТабДок.Область("R"+СокрЛП(Строка3)+"C3").Текст = "1") Цикл
					Строка3 = Строка3 + 1;
				КонецЦикла;
				ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(СтрокаНачалаУдаления)+":R"+СокрЛП(Строка3));
				ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				Область1 = ТабДок.НайтиТекст("стр.", стрНачала);
				Область2 = ТабДок.НайтиТекст("Страница", стрНачала);
				Если Область1 = Неопределено И Область2 = Неопределено Тогда
					СтрокаНачалаУдаления = 0;
				Иначе
					Если Область1 = Неопределено Тогда
						Строка1 = Область2.Низ;
					Иначе
						Строка1 = Область1.Низ;
					КонецЕсли;
					Если Область2 = Неопределено Тогда
						Строка2 = Область1.Низ;
					Иначе
						Строка2 = Область2.Низ;
					КонецЕсли;
					Если Строка1 < Строка2 Тогда
						СтрокаНачалаУдаления = Строка1;
					Иначе
						СтрокаНачалаУдаления = Строка2;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			//Убираем подписи
			Строка3 = ТабДок.ВысотаТаблицы;
			Область1 = ТабДок.НайтиТекст("Руководитель организации или иное уполномоченное лицо");
			Область2 = ТабДок.НайтиТекст("Главный бухгалтер или иное уполномоченное лицо");
			Если Область1.Низ > Область2.Низ Тогда
				Строка2 = Область2.Низ;
			Иначе
				Строка2 = Область1.Низ;
			КонецЕсли;
			ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Строка2)+":R"+СокрЛП(Строка3));
			ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			
	//нечаева 06,07,17 +++	
	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="УПД"  Тогда
		
			ТабДок.АвтоМасштаб = Истина;
			ОбластьОчистки = ТабДок.Области.найти("Заголовок");
			Область = ТабДок.НайтиТекст("Приложение",,ОбластьОчистки);
			Область.Очистить();
			Область1 = табДок.НайтиТекст("Счет");
			Область1.Текст = "ФОРМА ДЛЯ СОГЛАСОВАНИЯ СЧЕТ-ФАКТУРЫ К НАКЛАДНОЙ № "+ТекДок.Номер;
			
			//Область1.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			//Катаев+ 08/11/13 Уменьшил шрифт для выводимого текста по просьбе Кудряшова (на некоторых СФ обрезался номер)
			Шрифт = Новый Шрифт("Arial",10, Истина);
			Область1.Шрифт = Шрифт;
			//Катаев- 08/11/13
			ОбластьДляУдаления = ТабДок.Область("R1:R"+СокрЛП(Область1.Верх-1));
			ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//Очищаем ячейку содержащую количество страниц
			стрНачала = Область;
			Область1 = ТабДок.НайтиТекст("стр. 1 из", стрНачала);
			Если Область1 <> Неопределено Тогда
				Область1.Очистить(Истина,Ложь,Истина);
			КонецЕсли;
			Область2 = ТабДок.НайтиТекст("Страница", стрНачала);
			Если Область2 <> Неопределено Тогда
				Если область1 = Неопределено Тогда
					Область2.Очистить(Истина,Ложь,Истина);
				Иначе
					ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Область1.Низ)+":R"+СокрЛП(Область1.Низ));
					ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				КонецЕсли;
			КонецЕсли;
			Если Область1 <> Неопределено Тогда
				стрНачала = Область1;
			ИначеЕсли Область2 <> Неопределено тогда
				стрНачала = Область2;
			КонецЕсли;
			//Убираем шапки между данными
			Область1 = ТабДок.НайтиТекст("стр.", стрНачала);
			Область2 = ТабДок.НайтиТекст("Страница", стрНачала);
			Если Область1 = Неопределено И Область2 = Неопределено Тогда
				СтрокаНачалаУдаления = 0;
			Иначе
				Если Область1 = Неопределено Тогда
					Строка1 = Область2.Низ;
				Иначе
					Строка1 = Область1.Низ;
				КонецЕсли;
				Если Область2 = Неопределено Тогда
					Строка2 = Область1.Низ;
				Иначе
					Строка2 = Область2.Низ;
				КонецЕсли;
				Если Строка1 < Строка2 Тогда
					СтрокаНачалаУдаления = Строка1;
				Иначе
					СтрокаНачалаУдаления = Строка2;
				КонецЕсли;
			КонецЕсли;
			Пока СтрокаНачалаУдаления <> 0 Цикл
				//Делаем поиск начала следующей строки с данными ТЧ
				Строка3 = Строка1 + 1;
				Пока Не (ТабДок.Область("R"+СокрЛП(Строка3)+"C1").Текст = "А" ИЛИ ТабДок.Область("R"+СокрЛП(Строка3)+"C2").Текст = "А" ИЛИ ТабДок.Область("R"+СокрЛП(Строка3)+"C3").Текст = "А") Цикл
					Строка3 = Строка3 + 1;
				КонецЦикла;
				ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(СтрокаНачалаУдаления)+":R"+СокрЛП(Строка3));
				ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				Область1 = ТабДок.НайтиТекст("стр.", стрНачала);
				Область2 = ТабДок.НайтиТекст("Страница", стрНачала);
				Если Область1 = Неопределено И Область2 = Неопределено Тогда
					СтрокаНачалаУдаления = 0;
				Иначе
					Если Область1 = Неопределено Тогда
						Строка1 = Область2.Низ;
					Иначе
						Строка1 = Область1.Низ;
					КонецЕсли;
					Если Область2 = Неопределено Тогда
						Строка2 = Область1.Низ;
					Иначе
						Строка2 = Область2.Низ;
					КонецЕсли;
					Если Строка1 < Строка2 Тогда
						СтрокаНачалаУдаления = Строка1;
					Иначе
						СтрокаНачалаУдаления = Строка2;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			
			//Убираем подписи
			Строка3 = ТабДок.ВысотаТаблицы;
			Область1 = ТабДок.НайтиТекст("Руководитель организации");
			Область2 = ТабДок.НайтиТекст("Индивидуальный предприниматель");
			Если Область1.Низ > Область2.Низ Тогда
				Строка2 = Область2.Низ;
			Иначе
				Строка2 = Область1.Низ;
			КонецЕсли;
			ОбластьДляУдаления = ТабДок.Область("R"+СокрЛП(Строка2)+":R"+СокрЛП(Строка3));
			ТабДок.УдалитьОбласть(ОбластьДляУдаления,ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
			
		КонецЕсли;
		
		
		Область = ТабДок.НайтиТекст("На основании приказа");
		Если Область <> неопределено Тогда
			Область.Очистить();
		КонецЕсли;
		//Удаляем все разрывы страницы
		ном = 1;
		Пока ном <> ТабДок.ВысотаТаблицы Цикл
			ТабДок.Область("R"+СокрЛП(ном)).КонецСтраницы = Ложь;
			ном = ном+1;
		КонецЦикла;
		ТабДок.Показать(""+СтрокаТЧ.ВыходнаяФорма+" "+ТекДок.Номер);
	КонецЦикла;
	
КонецПроцедуры