Функция СоздатьППвходящие(ДокСсылка) Экспорт
	ПометитьНаУдалениеЛишниеПП(ДокСсылка);
	СоздатьПП(ДокСсылка);
КонецФункции //СоздатьППвходящие()

Функция ПометитьНаУдалениеЛишниеПП(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ПРС.Ссылка					КАК ППВход,
	|	Платежи.УИД_СтрокиПлатежа	КАК УИД_СтрокиПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ПО 
	|	ПРС.ДокОснование = Платежи.Ссылка
	|	И ПРС.УИД_СтрокиПлатежа = Платежи.УИД_СтрокиПлатежа
	|ГДЕ
	|	ПРС.ДокОснование = &ДокСсылка
	|	И НЕ ПРС.ПометкаУдаления
	|	И Платежи.УИД_СтрокиПлатежа ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.ППВход.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Выборка.Количество();
КонецФункции //ПометитьНаУдалениеЛишниеПП(ДокСсылка)

Функция СоздатьПП(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Платежи.УИД_СтрокиПлатежа		КАК УИД_СтрокиПлатежа,
	|	Платежи.Ссылка					КАК ДокОснование,
	|	Платежи.Ссылка.Организация		КАК Организация,
	|	Платежи.Ссылка.БанковскийСчет	КАК СчетОрганизации,
	|	Платежи.Ссылка.Дата				КАК Дата,
	|	Платежи.КонтрагентПоБанку		КАК Контрагент,
	|	Платежи.Договор					КАК Договор,
	|	Платежи.Приход					КАК СуммаДокумента,
	|	Платежи.Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	Платежи.СтатьяДДС				КАК СтатьяДДС,
	|	Платежи.НазначениеПлатежа		КАК НазначениеПлатежа,
	|	Платежи.СтрокаБанкКлиент		КАК СтрокаБанкКлиент,	
	|
	|	ПРС.Ссылка						КАК ППВход
	|
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС	
	|ПО 
	|	ПРС.ДокОснование = Платежи.Ссылка
	|	И ПРС.УИД_СтрокиПлатежа = Платежи.УИД_СтрокиПлатежа
	|ГДЕ
	|	Платежи.Ссылка = &ДокСсылка	
	|	И Платежи.УИД_СтрокиПлатежа <> &ПустойУИД
	|	И Платежи.Приход > 0
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
		
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПустойУИД", ПустойУИД());
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ППВход) Тогда
			ДокОбъект = Выборка.ППВход.ПолучитьОбъект();
		Иначе
			ДокОбъект 		= Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();			
			ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка);
		ЗаполнитьЗначенияСвойств(ДокОбъект, ПолучитьНомерДатуПП(Выборка.СтрокаБанкКлиент));
		
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Выборка.Количество();
КонецФункции //СоздатьПП(ДокСсылка)

Функция ПолучитьНомерДатуПП(СтрокаБанкКлиент)
	Результат = Новый Структура("НомерВходящегоДокумента,ДатаВходящегоДокумента", "", ПустаяДата());
	
	Части = СтрРазделить(СтрокаБанкКлиент, Символы.ПС);	
	Для каждого Стр Из Части Цикл
		Поля = МаркировкаКС.СтрокуВСтруктуру(Стр, "Ключ,Значение", "=");
		Если ВРег(Поля.Ключ) = "НОМЕР" Тогда
			Результат.НомерВходящегоДокумента = СокрЛП(Поля.Значение);					
		КонецЕсли;		
		Если ВРег(Поля.Ключ) = "ДАТА" Тогда
			Результат.ДатаВходящегоДокумента = ПолучитьДатуИзСтроки(СокрЛП(Поля.Значение));
		КонецЕсли;	                                                     
		Если ЗначениеЗаполнено(Результат.ДатаВходящегоДокумента) И ЗначениеЗаполнено(Результат.НомерВходящегоДокумента) Тогда
			Прервать;		
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //ПолучитьНомерДатуПП(СтрокаБанкКлиент)

Функция ПолучитьДатуИзСтроки(СтрДаты)
	Результат = ПустаяДата();
	
	Части = СтрРазделить(СтрДаты, ".");	
	Если Части.Количество() < 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	
	ТипЧисло = ПолучитьОписаниеТиповЧисла(10,0);
	
	ЧислоДаты	= Части[0];
	МесяцДаты 	= Части[1];	
	ГодДаты 	= Части[2];
	Если СтрДлина(ГодДаты) = 2 Тогда
		Если Число(ГодДаты) < 50 Тогда
			ГодДаты = "20" + ГодДаты;
		Иначе
			ГодДаты = "19" + ГодДаты ;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Результат = Дата(ТипЧисло.ПривестиЗначение(ГодДаты), ТипЧисло.ПривестиЗначение(МесяцДаты), ТипЧисло.ПривестиЗначение(ЧислоДаты));		
	Исключение		
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции
