
/////////////// СЛУЖЕБНЫЕ ///////////////////////////////////////////////////////////////

Функция ПрочитатьHTMLИзФайла(Файл)
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.ОткрытьФайл(Файл, "UTF-8");
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	ЧтениеHTML.Закрыть();
	
	Возврат ПолучитьТекстHTML(ДокументHTML);
	
КонецФункции

Функция ПолучитьТекстHTML(ДокументHTML)
	
	ЗапиcьHTML = Новый ЗаписьHTML;
	ЗапиcьHTML.УстановитьСтроку();
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументHTML, ЗапиcьHTML);
	
	Возврат ЗапиcьHTML.Закрыть();
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СформироватьОтчет(ТаблицаПараметров);
КонецПроцедуры

Процедура СформироватьОтчет(ТаблицаПараметров)
	// Кухарь А.Ю.  31.05.2022 начало
	//
	ФизСкл=новый Массив; 
	СписокПолучателей=новый СписокЗначений;
	СтрокаПараметров="";
	// Кухарь А.Ю.  31.05.2022 конец
	
	Если ТаблицаПараметров <> Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			
			// Кухарь А.Ю.  31.05.2022 начало
			//Для записи в лог
			СтрокаПараметров=СтрокаПараметров+", Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение; 
			// Кухарь А.Ю.  31.05.2022 конец
			
			
			Если СтрокаТП.Имя = "Склад" Тогда			
				// Кухарь А.Ю.  31.05.2022 начало
				ФизСкл.Добавить(СтрокаТП.Значение);
				// Кухарь А.Ю.  31.05.2022 конец
			КонецЕсли;
			
			
			// Кухарь А.Ю.  31.05.2022 начало
			//
			Если СтрокаТП.Имя = "Получатель" Тогда			
				// Кухарь А.Ю.  31.05.2022 начало
				СписокПолучателей.Добавить(СтрокаТП.Значение);
				// Кухарь А.Ю.  31.05.2022 конец
			КонецЕсли;
			
			// Кухарь А.Ю.  31.05.2022 конец
			
		КонецЦикла;
	КонецЕсли;
	//СписокПолучателей.Добавить("nechaeva@collant.ru");
	// Кухарь А.Ю.  31.05.2022 начало
	//
	ЗаписатьВЛог("Регламент",СтрокаПараметров,"Информация");
	
	если ФизСкл.Количество()=0  тогда 
		ЗаписатьВЛог("Регламент","Не выбрали склады","Информация");
		
		Возврат;
	КонецЕсли;
	
	если СписокПолучателей.Количество()=0 тогда
		ЗаписатьВЛог("Регламент","Не выбрали получателей","Информация");	
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю.  31.05.2022 конец
	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Отчет");
	

		Запрос=Новый Запрос;     
	    Запрос.текст =   "ВЫБРАТЬ
	                     |	Ном.Ссылка КАК Номенклатура,
	                     |	СУММА(ВложенныйЗапрос.КолКонФакт) КАК КолКонФакт,
	                     |	СУММА(ВложенныйЗапрос.КолКонБух) КАК КолКонБух,
	                     |	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв,
	                     |	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код КАК МодельКод,
	                     |	Ном.Код КАК Код,
	                     |	Ном.Наименование КАК Наименование,
	                     |	ВложенныйЗапрос1.ШК КАК Штрихкод
	                     |ИЗ
	                     |	Справочник.Номенклатура КАК Ном
	                     |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                     |			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	                     |			ВЫБОР
	                     |				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	                     |					ТОГДА NULL
	                     |				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	                     |			КОНЕЦ КАК ЦенаСеб,
	                     |			СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	                     |			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	                     |			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка,
	                     |			Остатки.Склад КАК Склад
	                     |		ИЗ
	                     |			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	                     |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	                     |				ПО Остатки.Номенклатура = Резервы.Номенклатура
	                     |					И Остатки.Склад = Резервы.Склад
	                     |		
	                     |		СГРУППИРОВАТЬ ПО
	                     |			Остатки.Номенклатура.Ссылка,
	                     |			Остатки.Склад) КАК ВложенныйЗапрос
	                     |		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	                     |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                     |			Номенклатура.Код КАК Код,
	                     |			Номенклатура.Наименование КАК Наименование,
	                     |			ШтрихКоды.Наименование КАК ШК,
	                     |			Номенклатура.Цвет КАК Цвет,
	                     |			Номенклатура.Размер КАК Размер,
	                     |			Номенклатура.Родитель.Код КАК РодительКод,
	                     |			Номенклатура.Ссылка КАК Ссылка,
	                     |			ШтрихКоды.Ссылка КАК ШКСсылка
	                     |		ИЗ
	                     |			Справочник.Номенклатура КАК Номенклатура
	                     |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	                     |				ПО Номенклатура.Ссылка = ШтрихКоды.Владелец
	                     |		ГДЕ
	                     |			Номенклатура.ПометкаУдаления = ЛОЖЬ
	                     |			И ШтрихКоды.ПометкаУдаления = ЛОЖЬ
	                     |			И ШтрихКоды.ТипШК = &ТипШК
	                     |			И ШтрихКоды.ВидШК = &ВидШК) КАК ВложенныйЗапрос1
	                     |		ПО Ном.Ссылка = ВложенныйЗапрос1.Ссылка
	                     |ГДЕ
	                     |	НЕ Ном.ЭтоГруппа
	                     |	И ВЫБОР
	                     |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |				ТОГДА ""Да""
	                     |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |				ТОГДА ""Нет""
	                     |			ИНАЧЕ ВЫБОР
	                     |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |						ТОГДА ""Да""
	                     |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |						ТОГДА ""Нет""
	                     |					ИНАЧЕ ВЫБОР
	                     |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |								ТОГДА ""Да""
	                     |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |								ТОГДА ""Нет""
	                     |							ИНАЧЕ ВЫБОР
	                     |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	                     |										ТОГДА ""Да""
	                     |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	                     |										ТОГДА ""Нет""
	                     |									ИНАЧЕ ""Нет""
	                     |								КОНЕЦ
	                     |						КОНЕЦ
	                     |				КОНЕЦ
	                     |		КОНЕЦ = ""Да""
	                     |	И Ном.ЖизненныйЦиклНоменклатуры = &активна
	                     |	И ВложенныйЗапрос.КолКонФакт > 0
	                     |	И Ном.Родитель.ВидНоменклатуры = &ТипТовар
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	Ном.Ссылка,
	                     |	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код,
	                     |	Ном.Код,
	                     |	Ном.Наименование,
	                     |	ВложенныйЗапрос1.ШК
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	Ном.Наименование";
		
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	Запрос.УстановитьПараметр("склады", ФизСкл);
	//Запрос.УстановитьПараметр("ТекНом",СпРаспродажногоТОвара);
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("активна",перечисления.ЖизненныйЦиклНоменклатуры.Активна);
	Запрос.УстановитьПараметр("ТипТовар", перечисления.ВидыНоменклаутры.Товар);
	Запрос.УстановитьПараметр("ТипШК", перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШк", перечисления.ВидыШК.Основной);

	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	//#Если Клиент Тогда
	//	Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	//#КонецЕсли
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.НачатьАвтогруппировкуСтрок();
	//
	ДругойЦвет=ложь;
	СтарыйСклад=Неопределено;
	СтараяНоменклатура=Неопределено;
	
	Пока Результат.Следующий() Цикл
		
		НоваяНоменклатура=Результат.Номенклатура;
		ОбластьНоменклатура.Параметры.Заполнить(Результат);
		ТабДок.Вывести(ОбластьНоменклатура);
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
	ИмяФайла = КаталогВременныхФайлов() + "ОстаткиФилиала.XLS";
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	
	ТекстСообщения = "Остатки филиала на дату "+ТекущаяДата();
	Осн =  документы.ЗаявкаНаДоставку.ПустаяСсылка();

	СформироватьВнутреннееУведомление(СписокПолучателей,ТекстСообщения, "Остатки филиала", Осн, , ИмяФайла);
	
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");
	//
	Параметры=новый ТаблицаЗначений;
	Параметры.Колонки.Добавить("Имя");
	Параметры.Колонки.Добавить("Значение");
	СтрТЗ=Параметры.Добавить();
	СтрТЗ.Имя="Обработка";
	СтрТЗ.Значение="ОбработатьПисьмаНаОтправку";
	//
	//
	//СтрТЗ=Параметры.Добавить();
	//СтрТЗ.Имя="ОтборПоДокументу";
	//СтрТЗ.Значение=Осн;
	
	МассивПараметров=новый Массив;
	МассивПараметров.Добавить(Параметры);
	ФоновыеЗадания.Выполнить("Регламент.ВнешнееЗадание",МассивПараметров,новый УникальныйИдентификатор,"Отправка писем для шины данных");
 
	
КонецПроцедуры
