//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	= Модифицированность();
	НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента 		= Товары.Итог("Количество");
		СуммаОплатыСертификатами    = ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);	
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	//+HELP-2684 20250204 Михайловский
	Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И (Дата>='20241201') И НЕ (Подразделение	= Касса.ПодразделениеДляУчета)  Тогда
		Подразделение	= Касса.ПодразделениеДляУчета;
		//+HELP-3018 20250318 Михайловский 
		Для Каждого ТСтр Из Товары Цикл
			Если НЕ (ТСтр.Подразделение = Подразделение) Тогда
				ТСтр.Подразделение = Подразделение;
			КонецЕсли;	
		КонецЦикла;
		//-HELP-3018 20250318 Михайловский
	КонецЕсли;
	//-HELP-2684 20250204 Михайловский
	
	//+HELP-5235 20250904 Михайловский
	Если СуммаОплатыБНПодели <> 0 И ЗначениеЗаполнено(ПроцентКомиссииПодели) Тогда
		 //СуммаОплатыБНПодели1 = Цел(СуммаОплатыБНПодели * (1 - (ПроцентКомиссииПодели / 100)));
		 СуммаОплатыБНПодели1 = Окр(СуммаОплатыБНПодели * (1 - (ПроцентКомиссииПодели / 100)), 2);
	КонецЕсли;	
	//-HELP-5235 20250904 Михайловский
	
КонецПроцедуры

//+SNL-69 20251205 Михайловский
Функция НайтиДоговорыПодели(Контрагент, Организация)
	Рез = Новый Структура("Основной, Комиссия", Справочники.Договоры.ПустаяСсылка(), Справочники.Договоры.ПустаяСсылка());
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Ссылка,
	               |	Договоры.ДопСоглашение КАК ДопСоглашение
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |ГДЕ
	               |	Договоры.Владелец = &Владелец
	               |	И Договоры.Организация = &Организация";
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Выб = Запрос.Выполнить().Выбрать();	
	Пока Выб.Следующий() Цикл
		Если Выб.ДопСоглашение = Истина Тогда
			Рез.Комиссия = Выб.Ссылка;
		Иначе	
			Рез.Основной = Выб.Ссылка;
		КонецЕсли;	
	КонецЦикла;	
	Возврат Рез;
КонецФункции //-SNL-69 20251205 Михайловский

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			//ДенежныеСредства
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 

Процедура УдалитьЧеки(Отказ)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НомерЧека,
	|	НомерЧекаККМ,	 
	|	Ссылка.Касса КАК Касса
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары КАК ОтчетКассовойСменыТовары
	|ГДЕ 
	|	Ссылка=&ОКС";
	
	Запрос.УстановитьПараметр("ОКС",Ссылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Чек=Документы.Чек.НайтиПоНомеру(Выборка.НомерЧека,Дата);
		Если Чек.Пустая() Тогда
			//крохин начало 08.02.2017
			//при обмене не нужно сообщений
			//Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение  И НЕ ОбменДанными.Загрузка Тогда
			//крохин конец 08.02.2017	
				Сообщить("Не найден чек №: "+Выборка.НомерЧека);			
			КонецЕсли;			
		Иначе
			Если Чек.Проведен Тогда
				ЧекОбъект=Чек.ПолучитьОбъект();
				Попытка
					ЧекОбъект.УстановитьПометкуУдаления(Истина);		
				Исключение
					СообщитьОбОшибке("Не удалось удалить чек ! №: "+Чек.Номер+". "+ОписаниеОшибки(),Отказ);					
				КонецПопытки;				
			КонецЕсли; 			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьДоговорЧЛ_ПК()
	Контрагент=Касса.ОсновнойПокупатель;
	НаименованиеДоговора=""+Подразделение+" пластиковые карты";
	Договор=Справочники.Договоры.НайтиПоНаименованию(НаименованиеДоговора,Истина,,Контрагент);
	Если Договор.Пустая() Тогда
		Договор=Справочники.Договоры.СоздатьЭлемент();	
		
		Договор.Владелец		= Контрагент;
		
		Договор.Наименование	= НаименованиеДоговора;
		Договор.Организация 	= Организация;
		Договор.КодЦБ			= Контрагент.КодЦБ;
		Договор.ВалютаКредита   = Валюта;
		Договор.ТипЦен			= Касса.ОсновнойТипЦен;
		Договор.ТипСкидок		= Касса.ОсновнойТипСкидок;
		
		Договор.Записать();
		
		Договор=Договор.Ссылка;
	КонецЕсли; 
	
	Возврат Договор;
КонецФункции 

Функция НайтиДоговор(Контрагент, Организация)
	Рез = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	       |	Договоры.Ссылка КАК Ссылка
	       |ИЗ
	       |	Справочник.Договоры КАК Договоры
	       |ГДЕ
	       |	Договоры.Владелец = &Владелец
	       |	И Договоры.Организация = &Организация";
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Выб = Запрос.Выполнить().Выбрать();	
	Если Выб.Следующий() Тогда
		Рез = Выб.Ссылка;
	КонецЕсли;	
	Возврат Рез;
КонецФункции	

Процедура СформироватьДвиженияПоКассам(Записывать=Ложь,Корректировки=Ложь) Экспорт
	Если Корректировки Тогда
		СформироватьДвиженияПоВзаиморасчетам(Ложь);
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	Контрагент,СУММА(Всего) КАК Всего
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	Контрагент.Ведущий КАК Контрагент,
	|	Всего КАК Всего
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары
	|ГДЕ
	|	Ссылка = &Ссылка	
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	Контрагент.Ведущий КАК Контрагент,
	|	-СуммаОплатыСертификатами КАК Всего
	|ИЗ
	|	Документ.ОтчетКассовойСмены.ПодарочныеСертификаты
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И
	|	не ВидСертификата=Значение(Справочник.ВидыПодарочныхСертификатов.КупонНаСкидку)
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	СтатьяДДС = ?(ВидОплаты=Перечисления.ВидыОплаты.БН,Справочники.СтатьиЗатрат.ПриходОтПокупателейПК,Справочники.СтатьиЗатрат.Выручка);	
	
	ИтогоСуммаДС=0;
	
	ВалютаУпр	=ПараметрыСеанса.ВалютаУпр_2009;
	КурсУпр		=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	КурсВалюты	=ПолучитьКурсВалюты_ПоРусски(Валюта,Дата);
	
	
	
	// нечаева для сотрудника. 21,10,13 +++
	НовРез=запрос.Выполнить().Выгрузить();
	НовРез.Свернуть("Контрагент");
	ПрСотрудник=Ложь;
	Если НовРез.Количество()=1 Тогда
		контраг=Новрез.Получить(0).контрагент;
		Если Контраг=справочники.Контрагенты.НайтиПоКоду("SMN-0600") Тогда // только по сотруднику тогда вычитаем по нему сумму баллов
			ПрСотрудник=Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// нечаева для сотрудника. 21,10,13
	Пока Выборка.Следующий() Цикл	
		//крохин начало
		Если Выборка.Всего = 0 Тогда Продолжить КонецЕсли;
		//крохин конец
		//крохин начало 24.09.2013
		//для частных лиц уменьшаем сумму ДС на потраченные "спасибо"
		Если Выборка.Контрагент = Подразделение.ЧастноеЛицо.Ведущий или ПрСотрудник Тогда
			//нечаева ++21,10,13
			//Если Выборка.контрагент.родитель = подразделение.частноелицо.ведущий.родитель  Тогда
			//нечаева --21,10,13
			Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
				//оплата баллами
				ИтогоСуммаДС = ИтогоСуммаДС - ОплаченоБаллами.Итог("ВсегоБаллов");
			Иначе
				//возврат оплаты баллами
				ИтогоСуммаДС = ИтогоСуммаДС - НачисленныеБаллы.Итог("ВсегоБаллов");
			КонецЕсли;
		КонецЕсли;
		//крохин конец 24.09.2013
		
		Движение=Движения.ДенежныеСредства.Добавить();		
		
		Движение.Период=Дата;
		
		Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
		
		Движение.БанковскийСчет	= Касса;
		Движение.Валюта			= Валюта;
		
		//крохин начало 24.09.2013
		//для частных лиц уменьшаем сумму ДС на потраченные "спасибо"
		//Движение.Сумма			= Выборка.Всего;
		//Если Дата>='20090101' Тогда
		//	Движение.СуммаУпр	= глПересчет(Выборка.Всего,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
		//КонецЕсли;
		//Движение.СуммаДокумента	= Выборка.Всего;
		СуммаПроводки = Выборка.Всего;
		Если Выборка.Контрагент = Подразделение.ЧастноеЛицо.Ведущий или ПрСотрудник Тогда			
			//нечаева  18,10,13 ++
			//Если Выборка.контрагент.родитель = подразделение.частноелицо.ведущий.родитель  Тогда
			//нечаева 18,10,13	--
			Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
				//оплата баллами
				СуммаПроводки = СуммаПроводки - ОплаченоБаллами.Итог("ВсегоБаллов");
			Иначе
				//возврат оплаты баллами
				СуммаПроводки = СуммаПроводки - НачисленныеБаллы.Итог("ВсегоБаллов");
			КонецЕсли;	
		КонецЕсли;
		//крохин начало 14.03.2022
		//смешанный вид оплаты
		//Если СуммаОплатыБН <> 0 Тогда
		//+HELP-7465 20251016 Михайловский
		//СуммаПроводки = СуммаПроводки - СуммаОплатыБН - СуммаОплатыБНПодели1;
		СуммаПроводки = СуммаПроводки - СуммаОплатыБН - СуммаОплатыБНПодели;
		//-HELP-7465 20251016 Михайловский
		СтатьяДДС = Справочники.СтатьиЗатрат.Выручка;
		//КонецЕсли;
		//крохин конец 14.03.2022
		Движение.Сумма			= СуммаПроводки;
		Если Дата>='20090101' Тогда
			Движение.СуммаУпр	= глПересчет(СуммаПроводки,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
		КонецЕсли;
		Движение.СуммаДокумента	= СуммаПроводки;    
		//крохин конец 24.09.2013
		
		Движение.ВалютаДокумента= Валюта;
		
		Движение.Отправитель	= Выборка.Контрагент;		
		Движение.СтатьяДДС		= СтатьяДДС;
		//+HELP-2684 20250204 Михайловский
		Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И Дата>='20241201'  Тогда
			Движение.Подразделение	= Касса.ПодразделениеДляУчета;
		Иначе
			Движение.Подразделение	= Касса.Владелец;
		КонецЕсли;
		//-HELP-2684 20250204 Михайловский
		//крохин начало
		Движение.Комментарий        = "ОКС нал";
		//крохин конец
		
		//крохин начало 14.03.2022
		//смешанный вид оплаты
		Если СуммаОплатыБН <> 0 Тогда
			СуммаПроводки = СуммаОплатыБН;
			СтатьяДДС = ?(ВидОплаты=Перечисления.ВидыОплаты.БН,Справочники.СтатьиЗатрат.ПриходОтПокупателейПК,Справочники.СтатьиЗатрат.Выручка);
			
			Движение=Движения.ДенежныеСредства.Добавить();		
			
			Движение.Период=Дата;
			
			Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			
			Движение.БанковскийСчет	= Касса;
			Движение.Валюта			= Валюта;
			Движение.Сумма			= СуммаПроводки;
			Если Дата>='20090101' Тогда
				Движение.СуммаУпр	= глПересчет(СуммаПроводки,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
			КонецЕсли;
			Движение.СуммаДокумента	= СуммаПроводки;    
			
			Движение.ВалютаДокумента= Валюта;
			
			Движение.Отправитель	= Выборка.Контрагент;		
			Движение.СтатьяДДС		= СтатьяДДС;
			//+HELP-2684 20250204 Михайловский
			Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И Дата>='20241201'  Тогда
				Движение.Подразделение	= Касса.ПодразделениеДляУчета;
			Иначе
				Движение.Подразделение	= Касса.Владелец;
			КонецЕсли;
			//-HELP-2684 20250204 Михайловский
			
			Движение.Комментарий        = "ОКС БН";
			
			
		КонецЕсли;
        //крохин конец 14.03.2022
		
		Если СуммаОплатыБНПодели <> 0 Тогда
			//+HELP-7465 20251016 Михайловский  
			//СуммаПроводки = СуммаОплатыБНПодели1;
			СуммаПроводки = СуммаОплатыБНПодели;
			//+HELP-7465 20251016 Михайловский
			СтатьяДДС = ?(ВидОплаты=Перечисления.ВидыОплаты.БН,Справочники.СтатьиЗатрат.ПриходОтПокупателейПК,Справочники.СтатьиЗатрат.Выручка);
			
			Движение=Движения.ДенежныеСредства.Добавить();		
			
			Движение.Период=Дата;
			
			Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			
			Движение.БанковскийСчет	= Касса;
			Движение.Валюта			= Валюта;
			Движение.Сумма			= СуммаПроводки;
			Если Дата>='20090101' Тогда
				Движение.СуммаУпр	= глПересчет(СуммаПроводки,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
			КонецЕсли;
			Движение.СуммаДокумента	= СуммаПроводки;    
			
			Движение.ВалютаДокумента= Валюта;
			
			Движение.Отправитель	= КонтрагентПодели;		
			Движение.СтатьяДДС		= СтатьяДДС;
			//+HELP-2684 20250204 Михайловский
			Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И Дата>='20241201'  Тогда
				Движение.Подразделение	= Касса.ПодразделениеДляУчета;
			Иначе
				Движение.Подразделение	= Касса.Владелец;
			КонецЕсли;
			//-HELP-2684 20250204 Михайловский
			
			Движение.Комментарий        = "ОКС БН Подели";
			
			
		КонецЕсли;
		
		ИтогоСуммаДС            = ИтогоСуммаДС+Выборка.Всего;
	КонецЦикла;
	// нечаева для сотрудника. 21,10,13 ---
	
	

	
	
	
	//крохин начало 25.06.2013
	//крохин начало 05.09.2013
	//тут всё сложнее
	//ИтогоСуммаДС = ИтогоСуммаДС - ОплаченоБаллами.Итог("ВсегоБаллов");
	//крохин начало 24.09.2013
	//выше, в цикле
	//	Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
	//		//оплата баллами
	//	ИтогоСуммаДС = ИтогоСуммаДС - ОплаченоБаллами.Итог("ВсегоБаллов");
	//Иначе
	//		//возврат оплаты баллами
	//	ИтогоСуммаДС = ИтогоСуммаДС - НачисленныеБаллы.Итог("ВсегоБаллов");
	//КонецЕсли;
	//крохин конец 24.09.2013
	//крохин конец 05.09.2013	
	//крохин конец 25.06.2013
	
	//движения по БН - ????? (уберем когда-нибудь) и подарочным сертификатам
	//крохин начало 10.04.2013
	//франчайзинг - реквизит подразедления
	//Если ВидОплаты=Перечисления.ВидыОплаты.БН И Подразделение.Код<>"SSP-0148" Тогда	//Чирков - заплата от франча (21.01.13)
	//крохин начало 13.01.2014
	//в базе ТЦ проводка нужна
	//Если ВидОплаты=Перечисления.ВидыОплаты.БН И Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг Тогда	//Чирков - заплата от франча (21.01.13)
	//крохин начало 21.01.2022
	//смешанный вид оплаты
	//Если ВидОплаты=Перечисления.ВидыОплаты.БН И (Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг ИЛИ ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение) Тогда	
	Если (ВидОплаты=Перечисления.ВидыОплаты.БН ИЛИ СуммаОплатыБН <> 0
		//+HELP-5235 20250904 Михайловский
		ИЛИ СуммаОплатыБНПодели1 <> 0
		//-HELP-5235 20250904 Михайловский
		) И 
		(Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг ИЛИ ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение) Тогда	
	//крохин конец 21.01.2022	
		//крохин конец 13.01.2014
		//крохин конец 10.04.2013
		
		СтатьяДДС_Транзит=Справочники.СтатьиЗатрат.Транзит;
		
		//расход по кассе
		Движение=Движения.ДенежныеСредства.Добавить();		
		
		Движение.Период=Дата;
		
		Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		
		Движение.БанковскийСчет	= Касса;
		Движение.Валюта			= Валюта;
		
		//крохин начало 21.01.2022
		//смешанный вид оплаты
		//Движение.Сумма			= ИтогоСуммаДС;
		//Если Дата>='20090101' Тогда
		//	Движение.СуммаУпр	= глПересчет(ИтогоСуммаДС,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
		//КонецЕсли;
		//
		//Движение.СуммаДокумента	= ИтогоСуммаДС;

		Если СуммаОплатыБН = 0 И СуммаОплатыБНПодели = 0 Тогда
			ИтогоСуммаДСБН = ИтогоСуммаДС;
		Иначе
			//+HELP-7465 20251016 Михайловский
			//ИтогоСуммаДСБН = СуммаОплатыБН + СуммаОплатыБНПодели1;
			ИтогоСуммаДСБН = СуммаОплатыБН + СуммаОплатыБНПодели;
			//-HELP-7465 20251016 Михайловский
		КонецЕсли;

		Движение.Сумма			= ИтогоСуммаДСБН;
		Если Дата>='20090101' Тогда
			Движение.СуммаУпр	= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
		КонецЕсли;
		
		Движение.СуммаДокумента	= ИтогоСуммаДС;
		
		//крохин конец 21.01.2022
		Движение.ВалютаДокумента= Валюта;
		
		Движение.Отправитель	= Выборка.Контрагент;	
		Движение.СтатьяДДС		= СтатьяДДС_Транзит;
		//+HELP-2684 20250204 Михайловский
		Если ЗначениеЗаполнено(Касса.ПодразделениеДляУчета) И Дата>='20241201'  Тогда
			Движение.Подразделение	= Касса.ПодразделениеДляУчета;
		Иначе
			Движение.Подразделение	= Касса.Владелец;
		КонецЕсли;
		//-HELP-2684 20250204 Михайловский
		//крохин начало
		Движение.Комментарий        = "ОКС БН";
		//крохин конец
		
		
		Если НЕ СуммаОплатыБН = 0 Тогда	
			КонтрагентПК			= Касса.Владелец.БанкПК;
			ДоговорПК				= Касса.Владелец.ДоговорПК;
			
			//Долг банка
			ВалютаРасчетов			= ПолучитьВалютуРасчетов(ДоговорПК);
			
			//+HELP-5235 20250904 Михайловский
			//дс подели
			
			//HELP-5235 20250904 Михайловский
			
			
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			
			Движение.Контрагент		= КонтрагентПК.Ведущий;
			Движение.Договор		= ДоговорПК;		
			
			//крохин начало 21.01.2022
			//смешанный вид оплаты
			//Движение.СуммаВал		= глПересчет(ИтогоСуммаДС,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			//Движение.СуммаУпр		= глПересчет(ИтогоСуммаДС,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			//Если СуммаОплатыБН = 0 Тогда
			//	ИтогоСуммаДСБН = ИтогоСуммаДС;
			//Иначе
			ИтогоСуммаДСБН = СуммаОплатыБН;
			//КонецЕсли;
			Движение.СуммаВал		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			
			//крохин конец 21.01.2022
			
			Движение.КодОперации	= КодОперации;
			
			Движение.СуммаДокумента	= ИтогоСуммаДС;
			Движение.ВалютаДокумента= Валюта;
			
			Движение.СтатьяДДС		= СтатьяДДС_Транзит;
		КонецЕсли;	
		//+HELP-5235 20250904 Михайловский
		Если СуммаОплатыБНПодели1 > 0 Тогда
			
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			
			Движение.Контрагент		= КонтрагентПодели.Ведущий; 
			стрДоги = НайтиДоговорыПодели(КонтрагентПодели, Организация);
			//Попытка
			Движение.Договор		= стрДоги.Основной;
				//НайтиДоговор(КонтрагентПодели, Организация);		
			//Исключение
			///КонецПопытки;	
			//ИтогоСуммаДСБН = СуммаОплатыБНПодели1; 
			ИтогоСуммаДСБН = ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация, СуммаОплатыБНПодели1, ?((Дата >= Дата('20251101')), СуммаОплатыБНПодели, СуммаОплатыБНПодели1));
			//+корр по письму
			Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
				ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("810");
				Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
					ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("643");
				КонецЕсли;
			КонецЕсли;
			//-корр по письму
			Движение.СуммаВал		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			
			//крохин конец 21.01.2022
			
			Движение.КодОперации	= КодОперации;
			
			Движение.СуммаДокумента	= ИтогоСуммаДС;
			Движение.ВалютаДокумента= Валюта;
			
			Движение.СтатьяДДС		= СтатьяДДС_Транзит;
			//+SNL-69 20251205 Михайловский
			//Если (СуммаОплатыБНПодели > СуммаОплатыБНПодели1) Тогда
			Если (КодОперации=Перечисления.КодыОперацийОстатки.Реализация) И (СуммаОплатыБНПодели > СуммаОплатыБНПодели1) И (Дата >= Дата('20251101')) Тогда
				
				СтатьяДДС_Комиссия = Справочники.СтатьиЗатрат.НайтиПоКоду("320 570");
				
				Движение=Движения.Взаиморасчеты.Добавить();
				
				Движение.Период			= Дата;
				
				//Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
				
				Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
				
				Движение.Контрагент		= КонтрагентПодели.Ведущий;  
				//Движение.Договор		= Справочники.Договоры.ПустаяСсылка();		
				Движение.Договор		= стрДоги.Комиссия;	
				ИтогоСуммаДСБН = СуммаОплатыБНПодели - СуммаОплатыБНПодели1;  
				//+корр по письму
				Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
					ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("810");
					Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
						ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("643");
					КонецЕсли;
				КонецЕсли;
				//-корр по письму
				Движение.СуммаВал		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
				Движение.СуммаУпр		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
				
				//крохин конец 21.01.2022
				
				Движение.КодОперации	= КодОперации;
				
				Движение.СуммаДокумента	= ИтогоСуммаДС;
				Движение.ВалютаДокумента= Валюта;
				
				Движение.СтатьяДДС		= СтатьяДДС_Комиссия;
				
				
				//+пров
				
				Движение=Движения.Взаиморасчеты.Добавить();
				
				Движение.Период			= Дата;
				
				//Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
				
				Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
				
				Движение.Контрагент		= КонтрагентПодели.Ведущий;  
				//Движение.Договор		= Справочники.Договоры.ПустаяСсылка();		
				Движение.Договор		= стрДоги.Комиссия;	
				ИтогоСуммаДСБН = СуммаОплатыБНПодели - СуммаОплатыБНПодели1;  
				//+корр по письму
				Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
					ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("810");
					Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
						ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("643");
					КонецЕсли;
				КонецЕсли;
				//-корр по письму
				Движение.СуммаВал		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
				Движение.СуммаУпр		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
				
				//крохин конец 21.01.2022
				
				Движение.КодОперации	= КодОперации;
				
				Движение.СуммаДокумента	= ИтогоСуммаДС;
				Движение.ВалютаДокумента= Валюта;
				
				Движение.СтатьяДДС		= СтатьяДДС_Комиссия;
				
				//затраты
				Движение = Движения.Затраты.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
				Движение.Период=Дата;
				Движение.ПериодРасходов = НачалоМесяца(Дата);
				Движение.Подразделение = Подразделение;
				Движение.СтатьяЗатрат = СтатьяДДС_Комиссия;
				Движение.СубЗатрата = Справочники.СубЗатраты.ПустаяСсылка();
				Движение.Контрагент		= КонтрагентПодели.Ведущий;  
				//Движение.Договор		= Справочники.Договоры.ПустаяСсылка();		
				Движение.Договор		= стрДоги.Комиссия;	
				ИтогоСуммаДСБН = СуммаОплатыБНПодели - СуммаОплатыБНПодели1;
				Движение.Комментарий = "Комиссия сервиса рассрочки";
				//+корр по письму
				Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
					ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("810");
					Если НЕ ЗначениеЗаполнено(ВалютаРасчетов) Тогда
						ВалютаРасчетов = Справочники.Валюты.НайтиПоКоду("643");
					КонецЕсли;
				КонецЕсли;
				//-корр по письму
				//Движение.СуммаВал		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
				Движение.СуммаУпр		= глПересчет(ИтогоСуммаДСБН,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
												
				Движение.ДатаЗаписи	= ТекущаяДатаСеанса();
				
				Движение.СуммаДокумента	= ИтогоСуммаДС;
				Движение.ВалютаДокумента= Валюта;				

			КонецЕсли;	
			//-SNL-69 20251205 Михайловский
			
		КонецЕсли;	
		//-HELP-5235 20250904 Михайловский
		
		//крохин начало 25.06.2013
		//спасибо от сбербанка
		ДоговорСпасибо			= Касса.Владелец.ДоговорСпасибоСбербанка;
		НачисленоБаллов = НачисленныеБаллы.Итог("ВсегоБаллов");
		Если НачисленоБаллов > 0 Тогда
			ВалютаРасчетов			= ПолучитьВалютуРасчетов(ДоговорПК);
			
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период			= Дата;
			
			
			//крохин начало 05.09.2013
			//код операции не влияет на знак проводки, только ТЧ
			//Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//крохин конец 05.09.2013
			
			Движение.Контрагент		= КонтрагентПК.Ведущий;
			Движение.Договор		= ДоговорСпасибо;		
			
			Движение.СуммаВал		= глПересчет(НачисленоБаллов,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		= глПересчет(НачисленоБаллов,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			
			Движение.КодОперации	= КодОперации;
			
			Движение.СуммаДокумента	= ИтогоСуммаДС;
			Движение.ВалютаДокумента= Валюта;
			
			Движение.СтатьяДДС		= СтатьяДДС_Транзит;
			
		КонецЕсли;
		ТекОплаченоБаллами = ОплаченоБаллами.Итог("ВсегоБаллов");
		Если ТекОплаченоБаллами > 0 Тогда
			ВалютаРасчетов			= ПолучитьВалютуРасчетов(ДоговорПК);
			
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период			= Дата;
			//крохин начало 05.09.2013
			//код операции не влияет на знак проводки, только ТЧ
			//Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//крохин конец 05.09.2013
			
			Движение.Контрагент		= КонтрагентПК.Ведущий;
			Движение.Договор		= ДоговорСпасибо;		
			
			Движение.СуммаВал		= глПересчет(ТекОплаченоБаллами,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		= глПересчет(ТекОплаченоБаллами,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			
			Движение.КодОперации	= КодОперации;
			
			Движение.СуммаДокумента	= ИтогоСуммаДС;
			Движение.ВалютаДокумента= Валюта;
			
			Движение.СтатьяДДС		= СтатьяДДС_Транзит;
			
		КонецЕсли;
		//крохин конец 25.06.2013
	КонецЕсли;
	
	//нечаева 23,10,13 +++	
	//движения по нальным чекам для баллов по взаиморасчетам
	Если ВидОплаты=Перечисления.ВидыОплаты.НАЛ И Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг Тогда	//Чирков - заплата от франча (21.01.13)
		
		КонтрагентПК			= Касса.Владелец.БанкПК;
		ДоговорПК				= Касса.Владелец.ДоговорПК;
		//
		////Долг банка
		ВалютаРасчетов			= ПолучитьВалютуРасчетов(ДоговорПК);
		//крохин начало 25.06.2013
		//спасибо от сбербанка
		ДоговорСпасибо			= Касса.Владелец.ДоговорСпасибоСбербанка;
		НачисленоБаллов = НачисленныеБаллы.Итог("ВсегоБаллов");
		Если НачисленоБаллов > 0 Тогда
			ВалютаРасчетов			= ПолучитьВалютуРасчетов(ДоговорПК);
			
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период			= Дата;
			
			
			//крохин начало 05.09.2013
			//код операции не влияет на знак проводки, только ТЧ
			//Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//крохин конец 05.09.2013
			
			Движение.Контрагент		= КонтрагентПК.Ведущий;
			Движение.Договор		= ДоговорСпасибо;		
			
			Движение.СуммаВал		= глПересчет(НачисленоБаллов,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		= глПересчет(НачисленоБаллов,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			
			Движение.КодОперации	= КодОперации;
			
			Движение.СуммаДокумента	= ИтогоСуммаДС;
			Движение.ВалютаДокумента= Валюта;
			
			Движение.СтатьяДДС		= СтатьяДДС_Транзит;
			
		КонецЕсли;
		ТекОплаченоБаллами = ОплаченоБаллами.Итог("ВсегоБаллов");
		Если ТекОплаченоБаллами > 0 Тогда
			ВалютаРасчетов			= ПолучитьВалютуРасчетов(ДоговорПК);
			
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период			= Дата;
			//крохин начало 05.09.2013
			//код операции не влияет на знак проводки, только ТЧ
			//Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//крохин конец 05.09.2013
			
			Движение.Контрагент		= КонтрагентПК.Ведущий;
			Движение.Договор		= ДоговорСпасибо;		
			
			Движение.СуммаВал		= глПересчет(ТекОплаченоБаллами,Валюта,КурсВалюты,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		= глПересчет(ТекОплаченоБаллами,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);
			
			Движение.КодОперации	= КодОперации;
			
			Движение.СуммаДокумента	= ИтогоСуммаДС;
			Движение.ВалютаДокумента= Валюта;
			
			Движение.СтатьяДДС		= СтатьяДДС_Транзит;
			
		КонецЕсли;
		//крохин конец 25.06.2013
	КонецЕсли;	
	//нечаева 23,10,13 ----
	
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ТС=ПодарочныеСертификаты.Выгрузить(,"ВидСертификата,СуммаОплатыСертификатами,Номинал");
		ТС.Свернуть("ВидСертификата","СуммаОплатыСертификатами,Номинал");
		Для Каждого СтрокаТЧ Из ТС Цикл
			Если СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.Содексо Тогда			
				ВалютаРасчетов			= ПолучитьВалютуРасчетов(СтрокаТЧ.ВидСертификата.Договор);
				
				Движение=Движения.Взаиморасчеты.Добавить();	
				
				Движение.Активность		= Истина;
				
				Движение.Период			= Дата;	
				Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
				
				Движение.Контрагент		= СтрокаТЧ.ВидСертификата.Контрагент;
				Движение.Договор		= СтрокаТЧ.ВидСертификата.Договор;
				//крохин начало 05.05.2011
				//с 1 апреля 2011 года пишем номинал, разницу- в доход
				//Движение.СуммаВал		= глПересчет(СтрокаТЧ.СуммаОплатыСертификатами,Валюта,Курс,ВалютаРасчетов,Дата);
				//Движение.СуммаУпр		= глПересчет(СтрокаТЧ.СуммаОплатыСертификатами,Валюта,Курс,ВалютаУпр,КурсУпр);
				//Движение.СуммаДокумента	= СтрокаТЧ.СуммаОплатыСертификатами;
				
				Если Дата >= '20110401' Тогда
					Движение.СуммаВал		= глПересчет(СтрокаТЧ.Номинал,Валюта,Курс,ВалютаРасчетов,Дата);
					Движение.СуммаУпр		= глПересчет(СтрокаТЧ.Номинал,Валюта,Курс,ВалютаУпр,КурсУпр);
					Движение.СуммаДокумента	= СтрокаТЧ.Номинал;
				Иначе
					Движение.СуммаВал		= глПересчет(СтрокаТЧ.СуммаОплатыСертификатами,Валюта,Курс,ВалютаРасчетов,Дата);
					Движение.СуммаУпр		= глПересчет(СтрокаТЧ.СуммаОплатыСертификатами,Валюта,Курс,ВалютаУпр,КурсУпр);
					Движение.СуммаДокумента	= СтрокаТЧ.СуммаОплатыСертификатами;
				КонецЕсли;
				//крохин конец 05.05.2011
				
				Движение.ВалютаДокумента= Валюта;
				
				Движение.КодОперации	= КодОперации;
				Движение.СтатьяДДС		= СтатьяДДС_Транзит;		
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
		//крохин начало 27.07.2021
	//сдача с сертификата, всегда наличные
//	Запрос=Новый Запрос;
//	Запрос.Текст="ВЫБРАТЬ
//	             |	ОтчетКассовойСменыПодарочныеСертификаты.Контрагент.Ведущий КАК Контрагент,
//	             |	СУММА(ОтчетКассовойСменыПодарочныеСертификаты.Сдача) КАК Всего
//	             |ИЗ
//	             |	Документ.ОтчетКассовойСмены.ПодарочныеСертификаты КАК ОтчетКассовойСменыПодарочныеСертификаты
//	             |ГДЕ
//	             |	ОтчетКассовойСменыПодарочныеСертификаты.Ссылка = &Ссылка
//	             |
//	             |СГРУППИРОВАТЬ ПО
//	             |	Контрагент";
//	 	Запрос.УстановитьПараметр("Ссылка",Ссылка);
//	Выборка=Запрос.Выполнить().Выбрать();

//	Пока Выборка.Следующий() Цикл
//		Если Выборка.Всего = 0 Тогда Продолжить КонецЕсли;
//	Движение=Движения.ДенежныеСредства.Добавить();		
//		
//		Движение.Период=Дата;
//		
//		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
//		
//		Движение.БанковскийСчет	= Касса;
//		Движение.Валюта			= Валюта;
//СуммаПроводки = Выборка.Всего;

//	
//		Движение.Сумма			= СуммаПроводки;
//		Если Дата>='20090101' Тогда
//			Движение.СуммаУпр	= глПересчет(СуммаПроводки,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
//		КонецЕсли;
//		Движение.СуммаДокумента	= СуммаПроводки;    

//		
//		Движение.ВалютаДокумента= Валюта;
//		
//		Движение.Отправитель	= Выборка.Контрагент;		
//		Движение.СтатьяДДС		= СтатьяДДС;
//		Движение.Подразделение	= Касса.Владелец;
//		Движение.Комментарий        = "сдача сертификата";
//		
//		
//		ИтогоСуммаДС            = ИтогоСуммаДС+Выборка.Всего;

//	КонецЦикла;
	//крохин конец 27.07.2021
	
	
	//крохин начало 14.03.2024
	//сдача сертификата оформляется как возврат сертификата, проводка не нужна и реквизит лишний
	////Малахов начало сдача с сертификатов 27.12.2023
	//Если Дата>='20240101' и СуммаСдачиПодарочногоСертификата>0 Тогда 
	//	Движение=Движения.ДенежныеСредства.Добавить();		
	//	
	//	Движение.Период=Дата;
	//	
	//	Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
	//	
	//	Движение.БанковскийСчет	= Касса;
	//	Движение.Валюта			= Валюта;
	//	СуммаПроводки = СуммаСдачиПодарочногоСертификата;

	//
	//	Движение.Сумма			= СуммаПроводки;

	//	Движение.СуммаУпр	= глПересчет(СуммаПроводки,Валюта,КурсВалюты,ВалютаУпр,КурсУпр);		
	//	Движение.СуммаДокумента	= СуммаПроводки;    

	//	
	//	Движение.ВалютаДокумента= Валюта;
	//	
	//	Движение.Отправитель	= Выборка.Контрагент;		
	//	Движение.СтатьяДДС		= СтатьяДДС;
	//	Движение.Подразделение	= Касса.Владелец;
	//	Движение.Комментарий        = "сдача сертификата";
	//	
	//	
	//	ИтогоСуммаДС            = ИтогоСуммаДС+Выборка.Всего;
	//КонецЕсли;
	//Малахов конец
	//крохин конец 14.03.2024
	
	Если Записывать Тогда		
		Движения.ДенежныеСредства.Записать();		
		Движения.Взаиморасчеты.Записать();
	КонецЕсли; 
КонецПроцедуры 

Процедура СформироватьДвиженияПоВзаиморасчетам(Записывать=Ложь)
	ДвиженияПоВзаиморасчетам=Неопределено;
	РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,ОбменДанными.Загрузка);	
	
	Если Записывать Тогда
		Движения.Взаиморасчеты.Записать();
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	УдалитьЧеки(Отказ);
	Если Отказ Тогда Возврат КонецЕсли; 
	
	ДвиженияПоРегистрам=Неопределено;	ТаблицаСписания=неопределено;
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТаблицаСписания);	
	
	Результат=РезультатПроведения["Результат"];
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда 			
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));
	КонецЕсли;
	
	Если Не Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);		
		СформироватьДвиженияПоЗатратам(ТаблицаСписания);
		СформироватьДвиженияПоВзаиморасчетам(ОбменДанными.Загрузка);
		
		Если Дата>='20080501' Тогда
			СформироватьДвиженияПоКассам(ОбменДанными.Загрузка);	
		КонецЕсли;	
		
	КонецЕсли;	
	
	//кухарь учет сертификатов 11.09.13 начало
	если не УчетСертификатов.ПровестиДокументПоСертификатнымОстаткам(ЭтотОбъект) тогда
		отказ=Истина;
	КонецЕсли;
	//кухарь учет сертификатов 11.09.13 конец
	
	//кухарь 24.10.14 начало	
	если ОбменДанными.Загрузка тогда
		Движения.СертификатныеОстатки.Записать();
	КонецЕсли;
	//кухарь 24.10.14 конец	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	ВариантЗаполнения=Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
		ВариантЗаполнения=ВыбратьВариантЗаполнения();
	#КОНЕЦЕСЛИ
	Если ВариантЗаполнения=Неопределено Тогда
		ВариантЗаполнения="Целиком";
	КонецЕсли;	
	
	ДокОснование	= Основание;
	
	ИБ				= Основание.ИБ;
	
	Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент");
	Договор			= ПолучитьРеквизитОбъекта(ДокОснование,"Договор");
	ЛевыйКонтрагент = ПолучитьРеквизитОбъекта(ДокОснование,"ЛевыйКонтрагент");
	ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	
	БанковскийСчет	= ПолучитьРеквизитОбъекта(ДокОснование,"БанковскийСчет");		
	ОтсрочкаПлатежа = ПолучитьРеквизитОбъекта(ДокОснование,"ОтсрочкаПлатежа");			
	ВидОплаты		= ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");		
	
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");		
	Если ВидОснования="Перемещение" Тогда
		Склад		= ДокОснование.СкладПолучатель;	
	Иначе		
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	КонецЕсли;
	ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");	
	
	КодОперации		= ?(ВидОснования="РасходнаяНакладная",Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя,Перечисления.КодыОперацийОстатки.Закупка);
	
	ТранспортнаяКомпания = ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпания");
	
	Если ВариантЗаполнения="РазницаСНабором" Тогда
		Комментарий		= "Пересорт по "+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
	Иначе
		Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");	
	КонецЕсли; 
	
	
	Если ВидОснования="ПриходнаяНакладная" И НЕ ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен") Тогда
		ОбнулитьЦены=Истина;	
	Иначе
		ОбнулитьЦены=Ложь;	
	КонецЕсли;
	
	Если ВариантЗаполнения="РазницаСНабором" Тогда
		Форма=Обработки.СравнениеЛистовНабора.ПолучитьФорму();		
		Форма.Документ		=ДокОснование;
		
		РезультатСравнения	=Форма.ПолучитьОшибкиНабора();	
		ТП					=РезультатСравнения.ТП;
		
		Дата				=ДокОснование.Дата;
		ДатаОтгрузки		=Дата;
	КонецЕсли;
	
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
		СтрокаТЧ.ЦенаБезСкидки=СтрокаТЧ.Цена;
		Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="Целиком" Тогда
			Если СтрокаТЧ.Заявка=0 Тогда
				СтрокаТЧ.Заявка	=СтрокаТЧ.Количество;			
			КонецЕсли;
		ИначеЕсли ВариантЗаполнения="РазницаСНабором" Тогда
			СтрокаТП=ТП.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаТП=Неопределено Тогда
				СтрокаТЧ.Количество=0;	
			Иначе
				СтрокаТЧ.Количество				=-СтрокаТП.Разница;
				СтрокаТЧ.Заявка					=-СтрокаТП.Разница;
				СтрокаТЧ.ПодтвержденнаяЗаявка	=-СтрокаТП.Разница;
			КонецЕсли;			
		КонецЕсли;		
		
		Если ОбнулитьЦены Тогда
			СтрокаТЧ.Цена=0;		
			СтрокаТЧ.ЦенаБезСкидки=0;
		КонецЕсли;
		
		Если СтрокаТЧ.Количество=0 Тогда
			Товары.Удалить(СтрокаТЧ);	
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ОчиститьДвиженияДокументаПоИстории(Ссылка);
КонецПроцедуры

Процедура СформироватьДвиженияПоЗатратам(ТС) Экспорт
	//крохин начало 10.04.2013
	//франчайзинг - реквизит подразделения
	//+++Чирков 21.01.13
	//Если Подразделение.Код="SSP-0148" Тогда Возврат КонецЕсли; //Схема расчетов по сертификатам подаркам и прочим доходам-расходам по сертификатам отсутствует - поэтому пока так		
	//---Чирков 21.01.13
	Если Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда Возврат КонецЕсли;
	//крохин конец 10.04.2013
	
	//крохин начало 05.05.2011
	//пишем в доход разницу между номиналом и суммой оплаты сертификатов, в том числе содексо
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить();
	Если Дата >= '20110401' Тогда
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
			//крохин начало 30.01.2017
	//с 01.02.2017г. дохода больше нет, выписывается РКО
	//Если НЕ СтрокаТЧ.Сертификат.Подарок И СтрокаТЧ.СуммаОплатыСертификатами < СтрокаТЧ.Номинал Тогда	
	//крохин начало 07.04.2017
	//исправление ошибки, в январе и феврале 2017 не тот знак, до 2017 - сдачи нет. Затраты только в случае "сдачи нет"
	//Если НЕ СтрокаТЧ.Сертификат.Подарок И СтрокаТЧ.Сдача > 0 Тогда
	ЕстьСдача = Ложь;
	Если Дата >= '20170101' Тогда
		Если Дата >= '20170301' Тогда
			Если СтрокаТЧ.Сдача > 0 Тогда 
				ЕстьСдача = Истина;
			КонецЕсли;	
		Иначе
			Если СтрокаТЧ.Сдача = 0 Тогда
				ЕстьСдача = Истина;
			КонецЕсли;	
		КонецЕсли;
	Иначе
		Если СтрокаТЧ.СуммаОплатыСертификатами  = СтрокаТЧ.Номинал Тогда
			ЕстьСдача = Истина;
		КонецЕсли;
	КонецЕсли;
	//крохин начало 15.09.2024
	//с 01.08.2024 сдача оформляется как возвратный ОКС
	Если Дата >= '20240801' Тогда
		ЕстьСдача = Истина;
	КонецЕсли;	
	//крохин конец 15.09.2024
	//крохин начало 20.08.2024
	//купоны на скидку не делают затрат
	//Если (НЕ СтрокаТЧ.Сертификат.Подарок) И (Не ЕстьСдача) Тогда
	Если (НЕ СтрокаТЧ.Сертификат.Подарок) И (Не ЕстьСдача) И (НЕ СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.КупонНаСкидку) Тогда
		
	//крохин конец 20.08.2024	
	//крохин конец 07.04.2014	
	//крохин конец 30.01.2017
				Движение=Движения.Затраты.Добавить();
				
				Движение.Период			= Дата;
				
				Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
				Движение.Подразделение	= Подразделение;
				
				//реклама и продвижение продаж в магазинах
				Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
				СуммаСписания = СтрокаТЧ.Номинал - СтрокаТЧ.СуммаОплатыСертификатами;
				Движение.СуммаУпр		= СуммаСписания;	
				
				Движение.СуммаДокумента	= СуммаСписания;
				Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
				Движение.ВалютаДокумента= ВалютаУпр;
				Движение.Комментарий        = "разница между номиналом и суммой оплаты сертификата";
				Движение.ДатаЗаписи		= ТекущаяДата();		 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//крохин конец 05.05.2011
	
	//Списываем сертификаты-подарки и чудо ЕЕ из чека	
	ТС.Свернуть("Номенклатура","Количество,СписанаСтоимость");
	
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить();
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		Если СтрокаТЧ.Сертификат.Подарок и не СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.КупонНаСкидку  Тогда						
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Сертификат.ПодразделениеЗатрат) Тогда
				Движение.Подразделение	= СтрокаТЧ.Сертификат.ПодразделениеЗатрат;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.Сертификат.Акция.ПодразделениеЗатрат) Тогда
				Движение.Подразделение	= СтрокаТЧ.Сертификат.Акция.ПодразделениеЗатрат;
			Иначе
				//крохин начало 06.05.2011
				//с 1 апреля 2011 года подразделение по умолчанию- маркетинг
				//Движение.Подразделение	= Подразделение;
				Если Дата >= '20110401' Тогда 
					Движение.Подразделение	= Справочники.Подразделения.НайтиПоКоду("SSP-0048");
				Иначе
					Движение.Подразделение	= Подразделение;
				КонецЕсли;
				//крохин конец 06.05.2011
				//крохин начало 20.12.2011
				//с 1 января 2012 года - подразделение снова ТЦ
				Если Дата >= '20120101' Тогда 
					Движение.Подразделение	= Подразделение;
				КонецЕсли;
				//крохин конец 20.12.2011
		
			КонецЕсли;
			//крохин начало		
			
			//крохин начало 10.07.2017
				//по магазинам-франчайзи по подарочным сертификатам - подаркам делаем движение по подразделению "Франчайзинг" из папки ЦО
				Если Дата >= '20170601' И Движение.Подразделение.ВидПодразделения = Перечисления.ВидыПодразделений.Франчайзинг Тогда
                Движение.Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0150");//          Франчайзиг
                КонецЕсли;
			//крохин конец 10.07.2017
			
			Если Дата >= '20090901' Тогда
				Если ЗначениеЗаполнено(СтрокаТЧ.Сертификат.Акция) Тогда
					Движение.СтатьяЗатрат	= СтрокаТЧ.Сертификат.Акция.СтатьяЗатрат;
				Иначе
					//реклама и продвижение продаж в магазинах
					Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
				КонецЕсли;
			иначе
				Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.ПустаяСсылка();
			КонецЕсли;
			//крохин начало 05.05.2011
			//с 1 апреля подарки списывают затраты на сумму оплаты сертификатами
			
			////крохин начало 
			//	Если Дата > '20100101' Тогда
			//   			СуммаСписания = РассчитатьСуммуСебестоимостиПоЧеку(ТС,СтрокаТЧ);
			//	Движение.СуммаУпр		= СуммаСписания;//СтрокаТЧ.СуммаОплатыСертификатами;	
			//	
			//	Движение.СуммаДокумента	= СуммаСписания;//СтрокаТЧ.СуммаОплатыСертификатами;
			//	Иначе
			//	Движение.СуммаДокумента	= СтрокаТЧ.СуммаОплатыСертификатами;
			//	Движение.СуммаУпр		= СтрокаТЧ.СуммаОплатыСертификатами;
			//	КонецЕсли;
			//	Если Дата > '20100101' Тогда 
			//	Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
			//	КонецЕсли;
			//	 //крохин конец
			Если Дата >= '20110401' Тогда
				Движение.СуммаДокумента	= СтрокаТЧ.СуммаОплатыСертификатами;
				Движение.СуммаУпр = СтрокаТЧ.СуммаОплатыСертификатами;
				Если Дата > '20100101' Тогда 
					Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
				КонецЕсли;
				
			Иначе
				//крохин начало 
				Если Дата > '20100101' Тогда
					СуммаСписания = РассчитатьСуммуСебестоимостиПоЧеку(ТС,СтрокаТЧ);
					Движение.СуммаУпр		= СуммаСписания;//СтрокаТЧ.СуммаОплатыСертификатами;	
					
					Движение.СуммаДокумента	= СуммаСписания;//СтрокаТЧ.СуммаОплатыСертификатами;
				Иначе
					Движение.СуммаДокумента	= СтрокаТЧ.СуммаОплатыСертификатами;
					Движение.СуммаУпр		= СтрокаТЧ.СуммаОплатыСертификатами;
				КонецЕсли;
				Если Дата > '20100101' Тогда 
					Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
				КонецЕсли;
				//крохин конец
			КонецЕсли;
			
			//крохин конец 05.05.2011
			
			
			Движение.ВалютаДокумента= ВалютаУпр;
			
			//крохин начало
			Движение.Комментарий        = "оплата сертификатом - подарком";
			//крохин конец
			
			
			Движение.ДатаЗаписи		= ТекущаяДата();			
		КонецЕсли;		
	КонецЦикла;
	
	//списания по акциям
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Подразделение");
	ТЗ.Колонки.Добавить("СтатьяЗатрат");
	//крохин начало 22.11.2011
	//проект
	ТЗ.Колонки.Добавить("Проект");
	//крохин конец 22.11.2011
	
	ТЗ.Колонки.Добавить("СуммаУпр",ПолучитьОписаниеТиповЧисла(19,2));		
	Для Каждого СтрокаТЧ Из Товары Цикл	
		Если СтрокаТЧ.Скидка = 100 Тогда
			СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");			
			
			Если СтрокаТС<>Неопределено И СтрокаТС.Количество<>0 Тогда				
				СтрокаТЗ=ТЗ.Добавить();				
				
				СтрокаТЗ.СуммаУпр		= СтрокаТЧ.Количество*Окр(СтрокаТС.СписанаСтоимость/СтрокаТС.Количество,2);//СтрокаТС.СписанаСтоимость/СтрокаТС.Количество;
				СтрокаТЗ.СтатьяЗатрат	= СтрокаТЧ.Акция.СтатьяЗатрат;
				Если ЗначениеЗаполнено(СтрокаТЧ.Акция.ПодразделениеЗатрат) Тогда
					СтрокаТЗ.Подразделение	= СтрокаТЧ.Акция.ПодразделениеЗатрат;
				Иначе					
					СтрокаТЗ.Подразделение	= Подразделение;
				КонецЕсли;	
				//крохин начало 20.12.2011
				//с 1 января 2012 года - подразделение снова ТЦ
				Если Дата >= '20120101' Тогда 
					СтрокаТЗ.Подразделение	= Подразделение;
				КонецЕсли;
				//крохин конец 20.12.2011
				
				
				//крохин начало 22.11.2011
				
				//проект
				СтрокаТЗ.Проект = СтрокаТЧ.Акция.Проект;
				//крохин конец 22.11.2011
			КонецЕсли;			
		Конецесли;		
	КонецЦикла;
	
	
	//крохин начало 22.11.2011
	//проект
	//ТЗ.Свернуть("Подразделение,СтатьяЗатрат","СуммаУпр");
	ТЗ.Свернуть("Подразделение,СтатьяЗатрат,Проект","СуммаУпр");
	//крохин конец 22.11.2011
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл			
		Движение=Движения.Затраты.Добавить();
		
		Движение.Период			= Дата;
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;		
		
		Движение.Подразделение	= СтрокаТЗ.Подразделение;			
		Движение.СтатьяЗатрат	= СтрокаТЗ.СтатьяЗатрат;
		//крохин начало 28.02.2012
		//реклама и продвижение продаж в магазинах
		Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
		//крохин конец 28.02.2012
		//крохин начало
		Если Дата > '20100101' Тогда 
			Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
		КонецЕсли;
		//крохин конец
		
		//крохин начало 13.12.2022
		//новая статья и субзатрата
		Если Дата >= '20221101' Тогда 
			Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 570");
			Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00063");
		КонецЕсли;

		//крохин конец 13.12.2022
		
		//крохин начало 22.11.2011
		//проект
		Движение.Проект = СтрокаТЗ.Проект;
		//крохин конец 22.11.2011
		
		Движение.СуммаУпр		= СтрокаТЗ.СуммаУпр;	
		
		Движение.СуммаДокумента	= СтрокаТЗ.СуммаУпр;
		Движение.ВалютаДокумента= ВалютаУпр;
		
		//крохин начало
		Движение.Комментарий        = "Акция ТЦ";
		//крохин конец
		
		Движение.ДатаЗаписи		= ТекущаяДата();
	КонецЦикла; 
	
	//крохин начало 25.06.2013
	//спасибо Сбербанка
	
	//крохин начало 05.09.2013
	//затраты - одной строкой
	//Для Каждого СтрокаТЧ ИЗ НачисленныеБаллы Цикл
	//крохин начало 23.09.2013
	//возврат списания не делает затрат	
	//ВсегоБалловНачислено = НачисленныеБаллы.Итог("ВсегоБаллов");
	Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
		ВсегоБалловНачислено = НачисленныеБаллы.Итог("ВсегоБаллов");	
	Иначе
		ВсегоБалловНачислено = 0;	
	КонецЕсли;
	//крохин конец 23.09.2013
	Если  ВсегоБалловНачислено <> 0 Тогда
		//крохин конец 05.09.2013
		Движение=Движения.Затраты.Добавить();
		
		Движение.Период			= Дата;
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;		
		
		Движение.Подразделение	= Справочники.Подразделения.НайтиПоКоду("SSP-0048");		
		
		Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
		Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
		
		//крохин начало 05.09.2013
		//затраты - одной строкой
		//Движение.СуммаУпр		= СтрокаТЧ.ВсегоБаллов;	
		//Движение.СуммаДокумента	= СтрокаТЧ.ВсегоБаллов;
		Движение.СуммаУпр		= ВсегоБалловНачислено;	
		Движение.СуммаДокумента	= ВсегоБалловНачислено;
		//крохин конец 05.09.2013
		Движение.ВалютаДокумента= ВалютаУпр;
		
		Движение.Комментарий        = "Спасибо от Сбербанка";
		
		Движение.ДатаЗаписи		= ТекущаяДата();
		
		//крохин начало 05.09.2013
		//затраты - одной строкой
		//КонецЦикла;
	КонецЕсли;
	//крохин конец 05.09.2013
	
	//крохин начало 05.09.2013
	//затраты - одной строкой
	//Для Каждого СтрокаТЧ Из ОплаченоБаллами Цикл
	//крохин начало 23.09.2013
	//оплата баллами не делает затрат, только возврат начисления	
	//ВсегоБалловОплачено = ОплаченоБаллами.Итог("ВсегоБаллов");
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
		ВсегоБалловОплачено = ОплаченоБаллами.Итог("ВсегоБаллов");	
	Иначе
		ВсегоБалловОплачено = 0;	
	КонецЕсли;
	//крохин конец 23.09.2013
	
	Если  ВсегоБалловОплачено <> 0 Тогда
		//крохин конец 05.09.2013
		Движение=Движения.Затраты.Добавить();
		
		Движение.Период			= Дата;
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
		
		Движение.Подразделение	= Справочники.Подразделения.НайтиПоКоду("SSP-0048");		
		
		Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
		Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
		
		//крохин начало 05.09.2013
		//затраты - одной строкой
		//Движение.СуммаУпр		= СтрокаТЧ.ВсегоБаллов;	
		//Движение.СуммаДокумента	= СтрокаТЧ.ВсегоБаллов;
		Движение.СуммаУпр		= ВсегоБалловОплачено;	
		Движение.СуммаДокумента	= ВсегоБалловОплачено;
		//крохин конец 05.09.2013
		//крохин конец 25.06.2013
		
		Движение.ВалютаДокумента= ВалютаУпр;
		
		Движение.Комментарий        = "Спасибо от Сбербанка";
		
		Движение.ДатаЗаписи		= ТекущаяДата();
		
		
		//крохин начало 05.09.2013
		//затраты - одной строкой
		//КонецЦикла;
	КонецЕсли;
	//крохин конец 05.09.2013
	//крохин конец 25.06.2013
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Затраты.Записать();	
	КонецЕсли;	
КонецПроцедуры

//крохин начало
Функция РассчитатьСуммуСебестоимостиПоЧеку(ТС,СтрокаТС)
	СуммаЧека = 0;
	СебестоимостьЧека = 0;
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.НомерЧека = СтрокаТС.НомерЧека Тогда	
			СуммаЧека = СуммаЧека + СтрокаТЧ.Всего;	
			СтрокаСебестоимости=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаТС <> Неопределено Тогда
				СебестоимостьЧека = СебестоимостьЧека +  СтрокаСебестоимости.СписанаСтоимость/СтрокаСебестоимости.Количество;
			Конецесли;
		КонецЕсли;	
	КонецЦикла;	
	Если СуммаЧека > 0 Тогда
		Процент = Мин(СтрокаТС.Номинал/СуммаЧека,1);
	Иначе
		Процент = 0;
	КонецЕсли;
	Возврат Окр(СебестоимостьЧека*Процент,2);
КонецФункции
//крохин конец

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры
//Катаев- 08/10/14
