
&НаКлиенте
Процедура ВыбратьИзСпискаНомеров(Команда)
	мНомера = Новый Массив;
	СтрокаНомеров = "";
	Если ВвестиСтроку(СтрокаНомеров, "Введите номера", , Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СтрокаНомеров, Символы.ПС) Цикл
			мНомера.Добавить(строка);				
		КонецЦикла;
		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.Номер в (&мНомера)";
		запрос.УстановитьПараметр("мНомера",мНомера);
		МассивДокументов=запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ОповеститьОВыборе(МассивДокументов);
		
		

		
	КонецЕсли;	


КонецПроцедуры
