Функция ЕстьСотрудникВПлане(ПолеСотрудника)
	Запрос		= Новый Запрос;
	Запрос.Текст= "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.ПланНабора.тБрэндов
	|ГДЕ			
	|	"+ПолеСотрудника+" = &Сотрудник
	|";
	Если ПолеСотрудника="Наборщик" Тогда
		Запрос.Текст= Запрос.Текст+"
		|	И НачалоНабора >= &Дата
		|	И НЕ НаборЗакончен";
	ИначеЕсли ПолеСотрудника="Термоусадчик" Тогда
		Запрос.Текст= Запрос.Текст+"
		|	И НачалоТермоусадки >= &Дата
		|	И НЕ ТермоусадкаЗакончена";	
	КонецЕсли; 
	Запрос.Текст= Запрос.Текст+"
	|	И Ссылка.Дата >= &Дата
	|	И Ссылка.Накладная.Проведен
	|	И Ссылка.Проведен			
	|";	
	Запрос.УстановитьПараметр("Дата",		ТекущаяДата()-48*3600);				
	Запрос.УстановитьПараметр("Сотрудник",	Сотрудник);
	
	Результат=Запрос.Выполнить().Выгрузить();
	Возврат Результат.Количество()>0;
КонецФункции // ()
 
Процедура Сформировать() Экспорт
	ВремяНачала			= ТекущаяДата();
	ПланНабора_Объект 	= ПланНабора.ПолучитьОбъект();
	
	РеквизитыНакладной=ПолучитьРеквизитыШапки(ПланНабора_Объект.Накладная,"Номер,Дата","Документ");
	Если НачалоДня(ПланНабора_Объект.Дата) <> НачалоДня(РеквизитыНакладной.Дата) Тогда
		ПланНабора_Объект.Дата = РеквизитыНакладной.Дата;	
	КонецЕсли;	
	
	если ПланНабора_Объект.ДокОснование=Неопределено тогда
		Накладная		=ПланНабора_Объект.Накладная;	
	иначе
		Накладная		=ПланНабора_Объект.ДокОснование;		
	КонецЕсли;
	
	Если Накладная.Метаданные().Имя="РасходнаяНакладная" Тогда
		ЕстьДопОбработка=ТребуетсяДопОбработка(Накладная);
	Иначе
		ЕстьДопОбработка=Ложь;
	КонецЕсли;	
	
	для каждого СтрЗНБ из СписокЗаданий цикл	
		НовоеСостояние=ПолучитьНовоеСостояниеЗНБ (СтрЗНБ.Значение);
		Если НовоеСостояние = Перечисления.СостоянияНакладной.ВНаборе Тогда
			НомСимв=Найти(ПараметрыСеанса.АктивныеНаборщики,Сотрудник);
			Если НомСимв>0 Тогда
				Если НЕ ЕстьСотрудникВПлане("Наборщик") Тогда
					УстановитьТекущиеЗаданияСотрудников(Сотрудник);
				Иначе		
					Сообщить("Сотрудник уже начал набор "+Сред(ПараметрыСеанса.АктивныеНаборщики,НомСимв,СтрДлина(Сотрудник.Наименование)+11));
					Возврат;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Термоусадка Тогда
			НомСимв=Найти(ПараметрыСеанса.АктивныеНаборщики,Сотрудник);
			Если НомСимв>0 тогда			
				Если НЕ ЕстьСотрудникВПлане("Термоусадчик") Тогда
					УстановитьТекущиеЗаданияСотрудников(Сотрудник);	
				Иначе		
					Сообщить("Сотрудник уже начал термоусадку "+Сред(ПараметрыСеанса.АктивныеНаборщики,НомСимв,СтрДлина(Сотрудник.Наименование)+11));
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МассСтрок=ПланНабора_Объект.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",СтрЗНБ.Значение.НомерЧасти));
		Для каждого СтрокаДокумента из МассСтрок цикл 
			// Кухарь А.Ю. 16.01.2020 конец		
			Если НовоеСостояние = Перечисления.СостоянияНакладной.ДопОбработка Тогда
				Если СтрокаДокумента.Состояние = Перечисления.СостоянияНакладной.ОжиданиеДопОбработки Тогда
					СтрокаДокумента.Состояние = НовоеСостояние;					
				КонецЕсли;		
			ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Термоусадка Тогда
				Если СтрокаДокумента.Состояние = Перечисления.СостоянияНакладной.ОжиданиеТермоусадки Тогда
					СтрокаДокумента.Состояние = НовоеСостояние;			
				КонецЕсли;			
			ИначеЕсли НовоеСостояние=Перечисления.СостоянияНакладной.Переукладка тогда				
				Если ЕстьДопОбработка Тогда
					Если СтрокаДокумента.ДопОбработкаЗакончена тогда
						СтрокаДокумента.Состояние = НовоеСостояние;
					КонецЕсли;					
				Иначе
					Если СтрокаДокумента.СканировкаЗакончена Тогда
						СтрокаДокумента.Состояние = НовоеСостояние;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				СтрокаДокумента.Состояние = НовоеСостояние;			
			КонецЕсли;		
			
			Если НовоеСостояние = Перечисления.СостоянияНакладной.ВНаборе Тогда
				СтрокаДокумента.НачалоНабора 			= ВремяНачала;
				СтрокаДокумента.Наборщик 				= Сотрудник;
				СтрокаДокумента.ВремяТекущегоСостояния 	= ВремяНачала;
			ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.ДопОбработка Тогда
				СтрокаДокумента.НачалоДопОбработки 		= ВремяНачала;
				СтрокаДокумента.ДопОбработчик 			= Сотрудник;
				СтрокаДокумента.ВремяТекущегоСостояния 	= ВремяНачала;			
			ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Термоусадка Тогда
				СтрокаДокумента.НачалоТермоусадки 		= ВремяНачала;
				СтрокаДокумента.Термоусадчик 			= Сотрудник;
				СтрокаДокумента.ВремяТекущегоСостояния 	= ВремяНачала;		
			ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Переукладка Тогда
				СтрокаДокумента.НачалоПереукладки 		= ВремяНачала;
				СтрокаДокумента.Переукладчик 			= Сотрудник;
				СтрокаДокумента.ВремяТекущегоСостояния 	= ВремяНачала;			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ПланНабора_Объект.Записать(РежимЗаписиДокумента.Запись);
	
	Если НовоеСостояние = Перечисления.СостоянияНакладной.ВНаборе Тогда
		Сообщить("Установлен наборщик: "+Сотрудник );
	ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.ДопОбработка Тогда
		Сообщить("Установлен сотрудник для доп.обработки: "+Сотрудник);	
	ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Термоусадка Тогда
		Сообщить("Установлен сотрудник для термоусадки: "+Сотрудник);		
	ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Переукладка Тогда
		Сообщить("Установлен сотрудник для переукладки: "+Сотрудник);		
	КонецЕсли;	
	
	Если НовоеСостояние = Перечисления.СостоянияНакладной.ВНаборе Тогда		
		УстановитьТекущиеЗаданияСотрудников(Сотрудник,РеквизитыНакладной.Номер);
	ИначеЕсли НовоеСостояние = Перечисления.СостоянияНакладной.Термоусадка Тогда
		УстановитьТекущиеЗаданияСотрудников(Сотрудник,РеквизитыНакладной.Номер);
	КонецЕсли;	
	
	УстановитьСостояниеЗНБ(НовоеСостояние);
КонецПроцедуры

Процедура ЗаписатьДопОбработчикавЛистыНабора()
	МассивЛН=Новый Массив;
	Если НЕ ЛистНабора.Пустая() Тогда
		МассивЛН.Добавить(ЛистНабора);			
	Иначе
		//Сканировали ШК плана набора, ищем по всем листам
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Документ.ЛистНабора
		|ГДЕ
		|	ДокОснование 	= &ДокОснование			
		|	И Проведен
		|	И ДопОбработчик	= ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|";			
		Запрос.УстановитьПараметр("ДокОснование",Накладная);
		Выборка = Запрос.Выполнить().Выбрать();			
		Пока Выборка.Следующий() Цикл				
			МассивЛН.Добавить(Выборка.Ссылка);				
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекЛН Из МассивЛН Цикл
		ЛистНабора_Объект							= ТекЛН.ПолучитьОбъект();
		ЛистНабора_Объект.Комментарий		 		= ЛистНабора_Объект.Комментарий + "#"+Сотрудник.Код+"$ВремяНачала"+Формат(ТекущаяДата(),"");
		ЛистНабора_Объект.ДопОбработчик				= Сотрудник;
		ЛистНабора_Объект.ВремяНачалаДопОбработки 	= ТекущаяДата();
		ЛистНабора_Объект.Записать(РежимЗаписиДокумента.Запись);		
	КонецЦикла;	
КонецПроцедуры
 
Процедура УстановитьСостояниеЗНБ(СостояниеНакладной)	
	НомераЧастей=ПолучитьНомераЧастейПН();	
	
	Для Каждого ТекНомерЧасти Из НомераЧастей Цикл
		ЗаданиеНабора=НайтиДокумент("ЗаданиеНабора",Новый Структура("ДокументОснование,НомерЧасти",ПланНабора,ТекНомерЧасти));
		Если НЕ ЗаданиеНабора.Пустая() И ПолучитьРеквизитШапки(ЗаданиеНабора,"СостояниеНакладной","Документ")<>СостояниеНакладной Тогда
			УстановитьРеквизитыОбъекта(ЗаданиеНабора,Новый Структура("СостояниеНакладной",СостояниеНакладной));			
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры
 
Функция ПолучитьНомераЧастейПН()
	НомераЧастей=Новый Массив;
	
	Если НомерЧасти<>0 Тогда		
		НомераЧастей.Добавить(НомерЧасти);
	Иначе
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НомерЧасти
		|ИЗ
		|	Документ.ПланНабора.тБрэндов
		|ГДЕ
		|	Ссылка 			= &ПланНабора
		|	И НомерСтроки 	В (&СписокСтрокПланаНабора)
		|";
		
		Запрос.УстановитьПараметр("ПланНабора",				ПланНабора);
		Запрос.УстановитьПараметр("СписокСтрокПланаНабора",	СписокСтрокПланаНабора);
		
		НомераЧастей=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерЧасти");
	КонецЕсли;
	
	Возврат НомераЧастей;
КонецФункции
 