Функция УдалитьПовторяющиесяЭлементыМассива(ВходМассив)
	ВыходМассив			= Новый Массив;
	ВремСоответствие	= Новый Соответствие;
	
	Для Каждого Элемент Из ВходМассив Цикл
		Если ВремСоответствие.Получить(Элемент)=Неопределено Тогда
			ВремСоответствие.Вставить(Элемент,Истина);		
			ВыходМассив.Добавить(Элемент);					
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат ВыходМассив;
КонецФункции //УдалитьПовторяющиесяЭлементыМассива(ВходМассив)

Функция УстановитьПараметрДанных(КомпоновщикНастроек,ИмяПараметра,Значение) Экспорт
	Результат	= Ложь;
	ЭлементПараметра=КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ЭлементПараметра<>Неопределено Тогда
		ЭлементПараметра.Значение		= Значение;
		ЭлементПараметра.Использование	= Истина;
			
		Результат	= Истина;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //УстановитьПараметрДанных(КомпоновщикНастроек,ИмяПараметра,Значение) Экспорт

Функция ДобавитьОтбор(Отбор,Имя,Значение) Экспорт
	Элемент	= Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	Элемент.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(Имя);
	Элемент.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение	= Значение;
	Элемент.Использование	= Истина;
	
	Возврат Элемент;
КонецФункции // ()

Функция ПолучитьТекстыЗапросов(МакетКомпоновки) Экспорт
	ТекстыЗапросов="";
	Для Каждого НаборДанных Из МакетКомпоновки.НаборыДанных Цикл
		Если ТипЗнч(НаборДанных)=Тип("НаборДанныхЗапросМакетаКомпоновкиДанных") Тогда
			ТекстыЗапросов=ТекстыЗапросов+НаборДанных.Имя+"
			|
			|"+НаборДанных.Запрос+Символы.ПС;			
		ИначеЕсли ТипЗнч(НаборДанных)=Тип("НаборДанныхОбъединениеМакетаКомпоновкиДанных") Тогда
			Для Каждого ЭлементНабора Из НаборДанных.Элементы Цикл
				ТекстыЗапросов=ТекстыЗапросов+ЭлементНабора.Имя+"
				|
				|"+ЭлементНабора.Запрос+Символы.ПС;				
			КонецЦикла;				
		КонецЕсли;			
	КонецЦикла;	
КонецФункции //ПолучитьТекстыЗапросов(МакетКомпоновки)

Функция РасшифровкиИзВыделенныхОбластей(ТД_Результат) Экспорт
	МР=Новый Массив;
	
	Для Каждого Область ИЗ ТД_Результат.ВыделенныеОбласти  Цикл
		Для Стр = Область.Верх По Область.Низ  Цикл
			Для Кол=Область.Лево По Область.Право  Цикл
				Ячейка=ТД_Результат.Область(Стр,Кол);				
				Если ТипЗнч(Ячейка.Расшифровка)=Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда		
					МР.Добавить(Ячейка.Расшифровка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МР;
КонецФункции //РасшифровкиИзВыделенныхОбластей()

Функция ПолучитьДанныеРасшифровок(МР,АдресДанныхРасшифровки) Экспорт
	Возврат ПолучитьДанныеРасшифровок_НаСервере(МР,АдресДанныхРасшифровки);
КонецФункции
	
Функция ПолучитьДанныеРасшифровок_НаСервере(МР,АдресДанныхРасшифровки) Экспорт
	Данные				= Новый Соответствие();	
	ПервоеПоле			= Неопределено;
	ДанныеРасшифровки	= ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);	
		
	Для Каждого Расшифровка Из МР Цикл		
		Результат = ПолучитьМассивПолейРасшифровки(ДанныеРасшифровки, Расшифровка, Истина);
		
		Если ПервоеПоле=Неопределено Тогда
			ПервоеПоле=Результат.ПервоеПоле;		
		КонецЕсли; 
		
		Для Каждого ДанныеПоля Из Результат.МассивПолей Цикл
			Поле	= ДанныеПоля.Поле;			
			Если ТипЗнч(Поле)=Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
				ИмяПоля		= Поле.Поле;
				ЗначениеПоля= Поле.Значение;
				Коллекция	= Данные.Получить(ИмяПоля);
				Если Коллекция=Неопределено Тогда
					Коллекция=Новый Массив;				
				КонецЕсли; 
				Коллекция.Добавить(ЗначениеПоля);
				Данные.Вставить(ИмяПоля,Коллекция);
			КонецЕсли;									
		КонецЦикла;
	КонецЦикла;
	
	ДанныеБезДублей	= Новый Соответствие;
	
	Для Каждого ЭлементКоллекции Из Данные Цикл
		ДанныеБезДублей.Вставить(ЭлементКоллекции.Ключ,УдалитьПовторяющиесяЭлементыМассива(ЭлементКоллекции.Значение));			
	КонецЦикла; 

	Возврат Новый Структура("Данные,ПервоеПоле",ДанныеБезДублей,ПервоеПоле);

КонецФункции

Функция ПолучитьМассивПолейРасшифровки(ДанныеРасшифровки, Расшифровка, ВключатьРесурсы = Ложь) Экспорт
	
	Результат	= Новый Структура("ПервоеПоле,МассивПолей",Неопределено,Новый Массив);
	МассивПолейРасшифровки	= Новый Массив;	
	
	Если НЕ (
		ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") 
		ИЛИ ТипЗнч(Расшифровка) = Тип("ДанныеРасшифровкиКомпоновкиДанных")) Тогда
		Возврат МассивПолейРасшифровки;
	КонецЕсли;		
	
	ЭлементРасшифровки	= ДанныеРасшифровки.Элементы[Расшифровка];
		
	// Добавим поля родительских группировок
	Результат.МассивПолей	= ДобавитьРодителей(ДанныеРасшифровки, ЭлементРасшифровки, Истина, ВключатьРесурсы);
	
	ПервоеПоле	= Новый Структура("ИмяПоля,Значение,Тип","",Неопределено,Неопределено);
	Если Результат.МассивПолей.Количество()>0 Тогда
		ДанныеПоля	= Результат.МассивПолей[0];
		
		ПервоеПоле.ИмяПоля			= ДанныеПоля.Поле.Поле;
		ПервоеПоле.Значение			= ДанныеПоля.Поле.Значение;
		ПервоеПоле.Тип				= ДанныеПоля.Тип;
	КонецЕсли;
	
	Результат.ПервоеПоле	= ПервоеПоле;
	Результат.МассивПолей	= УдалитьПовторяющиесяЭлементыМассива(Результат.МассивПолей);	
	
	//// Добавим отбор, установленный в отчете
	//Для Каждого ЭлементОтбора Из ТекущийОтчет.Настройки.Отбор.Элементы Цикл
	//	Если Не ЭлементОтбора.Использование Тогда Продолжить КонецЕсли;
	//	
	//	ДоступноеПоле=ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ЭлементОтбора.ЛевоеЗначение,ТекущийОтчет);
	//	Если Не ВключатьРесурсы И ДоступноеПоле.Ресурс Тогда Продолжить КонецЕсли;
	//	
	//	МассивПолейРасшифровки.Добавить(ЭлементОтбора);
	//КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьРодителей(ДанныеРасшифровки,ЭлементРасшифровки,Рекурсивно,ВключатьРесурсы)  Экспорт
	МассивПолей	= Новый Массив;
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для Каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл          
			ПолеКД			= Новый ПолеКомпоновкиДанных(Поле.Поле);
			ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ДанныеРасшифровки, ПолеКД);
			
			Если ДоступноеПоле = Неопределено Тогда 
				ВыбраноеПоле = ПолучитьВыбранноеПолеПоПолюКомпоновкиДанных(ДанныеРасшифровки, ПолеКД);
				Если ВыбраноеПоле <> Неопределено Тогда
					МассивПолей.Добавить(Новый Структура("Поле,Тип", Поле, Неопределено));				
				КонецЕсли;
			Иначе
				Если Не ВключатьРесурсы И ДоступноеПоле.Ресурс Тогда Продолжить КонецЕсли;			
				МассивПолей.Добавить(Новый Структура("Поле,Тип",Поле,ДоступноеПоле.Тип));
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	Если Рекурсивно Тогда
		Для Каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
			ПоляРодителей = ДобавитьРодителей(ДанныеРасшифровки,Родитель,Рекурсивно,ВключатьРесурсы);
			Для Каждого Элемент Из ПоляРодителей Цикл
				МассивПолей.Добавить(Элемент);		
			КонецЦикла; 
		КонецЦикла;	
	КонецЕсли;
	
	Возврат МассивПолей;
КонецФункции

Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ДанныеРасшифровки, ПолеКомпоновкиДанных) Экспорт
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Поле	= ДанныеРасшифровки.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);
	
	Возврат Поле;	
КонецФункции

Функция ПолучитьВыбранноеПолеПоПолюКомпоновкиДанных(ДанныеРасшифровки, ПолеКомпоновкиДанных) Экспорт
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Поле = Неопределено;
	
	Для каждого ВыбранноеПоле Из ДанныеРасшифровки.Настройки.Выбор.Элементы  Цикл
		Если ТипЗнч(ВыбранноеПоле) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			Если ВыбранноеПоле.Поле = ПолеПоиска Тогда
				Поле = ВыбранноеПоле.Поле;									
			КонецЕсли;							
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Поле;	
КонецФункции

Функция ВывестиСхемуВТД(СК, ИмяНастройки = Неопределено, ПараметрыДанных = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Отбор 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Отбор",			Новый Структура);
	ВнешниеДанные	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВнешниеДанные", Новый Структура);	
	МВТ				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "МВТ",			Новый МенеджерВременныхТаблиц);	
	Адрес			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Адрес", "");	
	ТД				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТД_Результат", Новый ТабличныйДокумент);
	
	КМ = Новый КомпоновщикМакетаКомпоновкиДанных;	
	
	КН				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КомпоновщикНастроек");
	
	Если КН = Неопределено Тогда
		КН = Новый КомпоновщикНастроекКомпоновкиДанных;
		КН.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СК));
			
		Если ИмяНастройки = Неопределено Тогда
			КН.ЗагрузитьНастройки(СК.НастройкиПоУмолчанию);
		Иначе
			КН.ЗагрузитьНастройки(СК.ВариантыНастроек[ИмяНастройки].Настройки);	
		КонецЕсли; 
		
		КН.Настройки.Отбор.Элементы.Очистить();
		Если Отбор<>Неопределено Тогда
			Для Каждого Элемент_Отбора Из Отбор Цикл
				ДобавитьПолеОтбора(КН, Элемент_Отбора);		
			КонецЦикла; 
		КонецЕсли;	
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыДанных)=Тип("Структура") Тогда
		Для Каждого Элемент Из ПараметрыДанных Цикл
			Параметр=КН.Настройки.ПараметрыДанных.Элементы.Найти(Элемент.Ключ);
			Если Параметр<>Неопределено Тогда
				Параметр.Использование	=Истина;
				Параметр.Значение		=Элемент.Значение;			
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	ЗаголовкиПолей	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ЗаголовкиПолей");
	Если ЗаголовкиПолей <> Неопределено Тогда
		//УстановитьЗаголовки(КН.Настройки.Выбор.Элементы, ЗаголовкиПолей);		 	
	КонецЕсли; 
	
	ДР	= Неопределено;
	КМ	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МК	= КМ.Выполнить(СК,КН.Настройки, ДР,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПВ	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПВ.УстановитьДокумент(ТД);
	
	ПК	= Новый ПроцессорКомпоновкиДанных;
	
	ПК.Инициализировать(МК, ВнешниеДанные, ДР, Истина, Ложь, МВТ);
	
	ТД						= ПВ.Вывести(ПК);
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;
	АдресРасшифровки		= ПоместитьВоВременноеХранилище(ДР,Адрес);
	
	Результат				= Новый Структура("ТД,АдресРасшифровки", ТД, АдресРасшифровки);
	
	ДанныеРасшифровки		= ДР;
	
	Возврат Результат;	
КонецФункции //ВывестиСхемуВТЗ(СК,ПараметрыДанных=Неопределено)

Функция ВывестиСхемуВТЗ(СК, ИмяНастройки = Неопределено, ПараметрыДанных = Неопределено, ДопПараметры = Неопределено) Экспорт
	Отбор 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Отбор",			Новый Структура);
	ВнешниеДанные	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВнешниеДанные", Новый Структура);	
	МВТ				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "МВТ",			Новый МенеджерВременныхТаблиц);	
	Адрес			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Адрес", 		"");
	
	КМ = Новый КомпоновщикМакетаКомпоновкиДанных;	
	КН = Новый КомпоновщикНастроекКомпоновкиДанных;
	КН.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СК));
	
	Если ИмяНастройки = Неопределено Тогда
		КН.ЗагрузитьНастройки(СК.НастройкиПоУмолчанию);
	Иначе
		КН.ЗагрузитьНастройки(СК.ВариантыНастроек[ИмяНастройки].Настройки);	
	КонецЕсли; 
	
	КН.Настройки.Отбор.Элементы.Очистить();
	
	Если ТипЗнч(ПараметрыДанных) = Тип("Структура") Тогда
		Для Каждого Элемент Из ПараметрыДанных Цикл
			Параметр=КН.Настройки.ПараметрыДанных.Элементы.Найти(Элемент.Ключ);
			Если Параметр<>Неопределено Тогда
				Параметр.Использование	=Истина;
				Параметр.Значение		=Элемент.Значение;			
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;	
	
	Если Отбор <> Неопределено Тогда
		Для Каждого Элемент_Отбора Из Отбор Цикл
			ДобавитьПолеОтбора(КН,Элемент_Отбора);		
		КонецЦикла; 
	КонецЕсли;
	
	ДР	= Неопределено;
	КМ	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МК	= КМ.Выполнить(СК,КН.Настройки, ДР,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПВ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ПК = Новый ПроцессорКомпоновкиДанных;
	
	ПК.Инициализировать(МК, ВнешниеДанные, , Истина, , МВТ);
	
	Возврат ПВ.Вывести(ПК);	
КонецФункции //ВывестиСхемуВТЗ(СК, ИмяНастройки = Неопределено, ПараметрыДанных = Неопределено, ДопПараметры = Неопределено) Экспорт

Процедура УстановитьЗаголовки(Поля, Заголовки)
	Для Каждого ЭлементЗаголовка Из Заголовки Цикл
		Для Каждого Поле Из Поля Цикл
			Если ВРег(Поле.Заголовок) = ВРег(ЭлементЗаголовка.Ключ) 
				ИЛИ ВРег(Поле.Поле) = ВРег(ЭлементЗаголовка.Ключ) Тогда
				Поле.Заголовок = ЭлементЗаголовка.Значение;				
			КонецЕсли;
			Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				УстановитьЗаголовки(Поле.Элементы, Заголовки);									
			КонецЕсли; 
		КонецЦикла;			
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьПолеОтбора(КН, Элемент_Отбора)	
	Если КН.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Элемент_Отбора.Ключ))=Неопределено Тогда Возврат КонецЕсли;
	
	Элемент_Пол					= КН.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Элемент_Пол.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(Элемент_Отбора.Ключ);
	Элемент_Пол.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВИерархии;
	Элемент_Пол.ПравоеЗначение	= Элемент_Отбора.Значение;	
КонецПроцедуры