
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущееРабочееМесто", ПараметрыСеанса.РабочееМестоКлиента);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	РабочееМесто = ПолучитьРабочееМестоПоКоду(ИмяКомпьютера());
	
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		
		Отказ = Истина;
		                  
		Текст = НСтр("ru='Создание нового рабочего места не требуется. 
					|Для данного компьютера оно уже создано.
					|Открыть существующее рабочее место?'");
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект, РабочееМесто);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьРабочееМестоПоКоду(Код)	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.РабочиеМеста
	|ГДЕ
	|   Код = &Код
	|";
	
	Запрос.УстановитьПараметр("Код", Код);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции

