
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОтображение();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображение()
	Элементы.ГруппаОдиночная.Видимость = Объект.ВидНастройки = 0;
	Элементы.ГруппаМножественная.Видимость = Объект.ВидНастройки = 1;
	Элементы.ГруппаНеограниченная.Видимость = Объект.ВидНастройки = 2;
КонецПроцедуры	

#КонецОбласти
