
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Если рПроверки.ОшибкиНоменклатуры.Количество()>0 Тогда
		ФормаОбработки = ПолучитьФорму("Обработка.ПроверкаКарточекДляНК.Форма.Форма", Новый Структура,, 1);
		
		ФормаОбработки.Открыть();
		ФормаОбработки.ВывестиРезультатыПроверки(рПроверки.ОшибкиНоменклатуры);		
	КонецЕсли;
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла; 
	
	Обработка_АпиЧЗ = Обработки.АпиЧЗ.Создать();
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		рОбработки = МаркировкаВС.ОтправитьНаОбработку_РегистрацияКарточекНоменклатурыВНК(ДокСсылка);		
		
		Если рОбработки.Успешно Тогда
			ОповеститьОбИзменении(ДокСсылка);
			Оповестить("ИзмененСтатус", , ДокСсылка);	
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиНоменклатуры,ОшибкиДокументов,ДокументыКОбработке", , Новый Массив, Новый Массив);
	
	ОбработкаПроверки = Обработки.ПроверкаКарточекДляНК.Создать();
	
	Для Каждого ДокСсылка Из мСсылки Цикл
		тОшибок 		= ОбработкаПроверки.ПроверитьДанныеТоваровДляМаркировки(ДокСсылка);	
		Если Результат.ОшибкиНоменклатуры = Неопределено Тогда
			Результат.ОшибкиНоменклатуры = тОшибок;
		Иначе
			Для Каждого СтрокаИст Из тОшибок Цикл
				СтрокаПол = Результат.ОшибкиНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПол, СтрокаИст);			
			КонецЦикла; 
		КонецЕсли; 
		
		Если тОшибок.Количество() = 0 Тогда
			рПроверки = Документы.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка);
			Если рПроверки.Успешно Тогда
				Результат.ДокументыКОбработке.Добавить(ДокСсылка);
			Иначе
				МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)
 