
// Кухарь А.Ю.  01.02.2023 начало
//
Процедура ПередЗаписью(Отказ)
	если не ОбменДанными.Загрузка тогда
		если не РольДоступна("Администратор") тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// нечаева 03,04,23+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
	РегистироватьИзменения= ложь;
	Если  ссылка.Родитель <> Этотобъект.родитель ТОгда
		 
		 РегистрироватьИзменения = истина;
		
	КонецЕсли;
	
	Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL" и РегистрироватьИзменения = Истина Тогда
				
		// только для б2б		   
		ПроцедурыОбменаССайтом.РегистрироватьИзмененияГруппыНоменклатурыДляСайта(Ссылка);
		
	КонецЕсли;
	// нечаева 03,04,23---

	
	
КонецПроцедуры
 
// Кухарь А.Ю.  01.02.2023 конец
