Процедура ВыполнитьОбновление() Экспорт
	НоваяВерсияИБ=Метаданные.Версия;
	
	СтрСообщения="Обновление с версии: "+Константы.НомерВерсииКонфигурации.Получить()+" до "+НоваяВерсияИБ;
	
	Если НоваяВерсияИБ="1.0.7.5" Тогда
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Выборка=Документы.ВводОстатковДС.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(ПараметрыСеанса.ЭтотУзел.УправляющийУзел,Выборка.Ссылка);			
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
	Константы.НомерВерсииКонфигурации.Установить(НоваяВерсияИБ);
	
	Если НЕ ПараметрыСеанса.ЭтотУзел.Подразделение.Пустая() Тогда
		ПодразделениеОбъект=ПараметрыСеанса.ЭтотУзел.Подразделение.ПолучитьОбъект();	
		ПодразделениеОбъект.НомерВерсииКонфигурации=НоваяВерсияИБ;
		ПодразделениеОбъект.Записать();
	КонецЕсли; 
	
	Если Константы.НомерВерсииКонфигурации.Получить() = НоваяВерсияИБ Тогда
	   	Сообщить("Выполнено " + СтрСообщения + Символы.ПС, СтатусСообщения.Информация);	    	
	КонецЕсли;
КонецПроцедуры