Перем Ехсеl,Книга,ДиалогОткрытияФайла,СтруктураАктивности Экспорт;
Перем ФайлВыгр Экспорт;
Перем СписокДляПрайса Экспорт;
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки Экспорт;
Перем ТЗШапка Экспорт;
Перем ТекФайл Экспорт;// текущий файл для загрузки РНК
Перем ПРизКр;
Перем ТЗПЕчать Экспорт;



//-------------------------------------------------------------

Функция КоличествоПД2(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

Функция ПерваяСФ2(Префикс,Дата)Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Функция УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс,КоличествоПропусков=0)Экспорт 
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер) КАК Номер
	|ИЗ
	|	Документ."+МетаДок.Имя+"
	|ГДЕ
	|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	|	Номер ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	Если НомерДока<>Неопределено Тогда	
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Если ПоследнийДок<>Неопределено Тогда
			Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента2(ДокументОбъект) Экспорт
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" Тогда
		ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ2(Префикс,ДокументОбъект.Дата) Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				КоличествоПропусков=2;			
			ИначеЕсли Лев(Префикс,2)="КБ" Тогда
				КоличествоПропусков=4;
			Иначе	
				КоличествоПропусков=1;						
			КонецЕсли;			
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			КодИБ="SSP";
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;		
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		Префикс=ДокументОбъект.Организация.Префикс+"-";
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе		
		КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
		
		ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");		
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()



Функция НайтиШК(Ном)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ШтрихКоды.Наименование КАК шк
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ТипШК = &ТипШК
	|	И ШтрихКоды.Владелец = &номенклатура
	|	И ШтрихКоды.ВидШК = &ВидШК";
	
	Запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.Основной);
	
	Запрос.УстановитьПараметр("номенклатура",Ном);
	выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		
		возврат(выборка.шк);
		
	КонецЦикла; 
	
	
КонецФункции

//*************************************************************
//                   автоформирование прайс листов.
//-------------------------------------------------------------

Функция ЗагрузитьСписокДляПрайсаЭксель() 
	
	// заполняем из экселя список номенклатуры.
	Путь="\\SRVECOD\SFERAConnector2\EDI\Unifarm\Price\";
	ИмяФайла1=Путь+"СписокДляПрайса.xls";
	СписокДляПрайса= Новый Массив;
	
	Попытка  
		Ексель	=  Новый COMОбъект("Excel.Application");
	Исключение
	//	ЗаписатьВЛог("Регламент","Открытие экселя "+ОписаниеОшибки(),"Информация");  
        	
		//Возврат СписокДляПрайса;
	КонецПопытки; 
	
	Ексель.Application.Visible=0;
	Попытка
		Книга	= Ексель.WorkBooks.Open(ИмяФайла1);
	Исключение
		//ЗаписатьВЛог("Регламент","Не удалось открыть файл списка номенклатуры! Загрузка отменена.","Информация");  
		ПризКр=1;
		//Возврат СписокДляПрайса;
	КонецПопытки;
	
	НомерСтрокиЕксель=1;
	Пока Ексель.Sheets(1).Cells(НомерСтрокиЕксель,1).Value <> Неопределено Цикл
		Код=СокрЛП(Ексель.Sheets(1).Cells(НомерСтрокиЕксель,1).Value);
		СписокДляПрайса.Добавить(Справочники.Номенклатура.НайтиПоКоду(Код));
		
		НомерСтрокиЕксель=НомерСтрокиЕксель+1;
	КонецЦикла;	                                          
	
	Книга.Close();  	
	Ексель.Quit(); //Почитали и закрыли	
	
	Возврат СписокДляПрайса;
	
КонецФункции

Функция ЗагрузитьСписокДляПрайсаТекстовый() 
	
	// заполняем из экселя список номенклатуры.
	Путь="\\SRVECOD\SFERAConnector2\EDI\Unifarm\Price\";
	ИмяФайла1=Путь+"СписокДляПрайса.txt";
	СписокДляПрайса= Новый Массив;
	
	
	Текст = Новый ТекстовыйДокумент;
    Текст.Прочитать(ИмяФайла1);
    КоличествоСтрок = Текст.КоличествоСтрок();
	
	Стр=0;
	
	Пока Стр<=КоличествоСтрок Цикл		
		
		ТекСтр=Текст.ПолучитьСтроку(Стр);
		Поиск=Найти(ТекСтр,Символы.Таб);
		Если Поиск > 0 Тогда
			
			текКод=Лев(ТекСтр,Поиск-1);
			// ищем если не пустой то добовляем
			Ном=Справочники.Номенклатура.НайтиПоКоду(ТекКод);
			Если не Ном.Пустая() Тогда
				СписокДляПрайса.Добавить(Ном);
			конецЕсли;
		Иначе
			Поиск=Найти(ТекСтр," ");
			Если Поиск > 0 Тогда
				
				текКод=Лев(ТекСтр,Поиск-1);
								
				Ном=Справочники.Номенклатура.НайтиПоКоду(ТекКод);
				Если не Ном.Пустая() Тогда
					СписокДляПрайса.Добавить(Ном);
				конецЕсли;
							
			КонецЕсли;	
			
		КонецЕсли;
		
		Стр=Стр+1;
		
	КонецЦикла;
	
		
	Возврат СписокДляПрайса;
	
КонецФункции


//нечаева 26,04,18+++
Функция ПолучитьАртикулыЦеныМатрицы(Контрагент,Договор)
	
	
	// для договоров не по матрице
	Попытка
		Если Договор.НеИспользоватьМатрицу Тогда
			НеИспользоватьМартицуПоДоговору=Истина;
		иначе
			НеИспользоватьМартицуПоДоговору=ложь;
		КонецЕсли;	
	Исключение
		НеИспользоватьМартицуПоДоговору=ложь;
	конецПопытки;
	ТЗ = новый ТаблицаЗначений;
	Тз.Очистить();
	
	Попытка
		//Если контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда
			// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Матрица.Ссылка КАК Ссылка1
			|ИЗ
			|	Документ.Матрица КАК Матрица
			|ГДЕ
			|	Матрица.Контрагент = &Контрагент
			|	И Матрица.Дата <= &Дата1
			|	И Матрица.ДатаОкончания >= &Дата2
			|	И Матрица.Договор = &Договор
			|	И Матрица.Проведен = истина
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
					
			
			//запрос на получение
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Ссылка,
			|	МатрицаТовары.НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность,
			|	МатрицаТовары.ШККонтрагентаБлочок,
			|	МатрицаТовары.ШКСпайки,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Номенклатура.Код
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
			
		
			Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
				ЕстьМатрицаПоДоговору = истина;
				//с учетом договора
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
							
			иначе
				ЕстьМатрицаПоДоговору = ложь;
			КонецЕсли;
			
			//Попытка
			//	Если Ссылка.ПостояннаяАкция Тогда
			//		Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			//		//постоянные акции только под галку
			//	Иначе
			//		Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//
			//	КонецЕсли;
			//Исключение
			//КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"	
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
						
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			тз1 = Запрос.Выполнить().Выгрузить();
			
			Возврат ТЗ1;
			
			
			
	//	КонецЕсли;
	исключение
		Возврат ТЗ;
	конецПопытки;	
	
	возврат ТЗ; //пустая таблица
	
КонецФункции
//нечаева 26,04,18----



// формируем и автоматом выгружаем прайс-лист
//Это для столетова
Процедура АвтоФормированиеПрайсСт()
	
	
возврат;	
	
	// для выбора остатков
	Склады=Новый Массив;
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STA-48"));
	ТипЦенАв=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301") ; // частное лицо //("SNL-0763"); // доктор столетов
	КонПериода=ТекущаяДата();
	// будем по матрицам брать данные по ценам и номенклатуре.
	
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-7891");
	//SSR-7891, SSP-4660
	Договор = справочники.Договоры.НайтиПоКоду("SNL-025584"); //("SNL-025818");
	

	
	//
	//возврат;

	//
	//	
	//// для выбора остатков
	//Склады=Новый Массив;
	//Склады.Добавить(Справочники.Склады.НайтиПоКоду("STA-48"));
	//ТипЦенАв=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301") ; // частное лицо //("SNL-0763"); // доктор столетов
	//КонПериода=ТекущаяДата();
	//// будем по матрицам брать данные по ценам и номенклатуре.
	//
	//
	//Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-4660");
	//Договор = справочники.Договоры.НайтиПоКоду("SNL-002939");
	
	Тз = новый ТаблицаЗначений;
	ТЗ = ПолучитьАртикулыЦеныМатрицы(Контрагент,Договор);
	
	
	
	
	НомСп=ТЗ.выгрузитьКолонку("Номенклатура");
	
	ЗаписатьВЛог("Регламент","Столетов.Список ном. количество "+НомСП.количество(),"Информация");  
	
	// добавляем
	ПС=Новый XBase;	
	
	ПС.поля.Добавить("CODEPST","C","12");
	ПС.поля.Добавить("NAME","C","80");
	ПС.поля.Добавить("CNTR","C","20");
	ПС.поля.Добавить("FIRM","C","40");
	ПС.поля.Добавить("QNTPACK","N","8");
	ПС.поля.Добавить("EAN13","C","13");
	ПС.поля.Добавить("NDS","N",9,2);       //ставка ндс
	
	ПС.поля.Добавить("GDATE","D","8");
	ПС.поля.Добавить("QNT","N",9,3);      // остаток товара
	ПС.поля.Добавить("NSP","N",9,2);       //ставка нсп
	ПС.поля.Добавить("GNVLS","N",1); 
	
	ПС.поля.Добавить("PRICE2","N",9,2);
	ПС.поля.Добавить("PRICE2N","N",9,2);   //Цена прайса без ндс
	ПС.поля.Добавить("SUMNDS2","N",9,2);// суммаНДС от цены в накладной
	ПС.поля.Добавить("PRICEGR","N",9,2);
	ПС.поля.Добавить("DATEGR","D","8");
	ПС.поля.Добавить("NEWFLG","N","1");
	//нечаева 18,04,18++
	ПС.поля.Добавить("DATEPrice","D","8"); //дата прайса
	
	
	ПС.СоздатьФайл("\\SRVECOD\SFERAConnector2\EDI\Unifarm\Price\price.dbf");
	ПС.Записать();
	
	ПС.АвтоСохранение=Истина;	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ном,
	               |	Номенклатура.Код КАК Код,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Остаток > 100
	               |			ТОГДА 100
	               |		ИНАЧЕ ВложенныйЗапрос.Остаток
	               |	КОНЕЦ КАК Остаток
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ОстаткиТМЦОстатки.Номенклатура КАК Ном,
	               |			ОстаткиТМЦОстатки.КоличествоОстаток КАК Остаток
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиТМЦ.Остатки(&КонПериода, Склад В ИЕРАРХИИ (&Склады)) КАК ОстаткиТМЦОстатки) КАК ВложенныйЗапрос
	               |		ПО Номенклатура.Ссылка = ВложенныйЗапрос.Ном
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И (НЕ Номенклатура.ЭтоГруппа)
	               |	И ВложенныйЗапрос.Остаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ном";
	

	// берем только колготки
	//НомСп=Справочники.Номенклатура.НайтиПоНаименованию("Колготки");
	
	Запрос.УстановитьПараметр("Ссылка",НомСп); // номенклатура
	Запрос.УстановитьПараметр("Склады",Склады);
	Запрос.УстановитьПараметр("КонПериода",КонПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписатьВЛог("Регламент","Столетов.Выборка количество "+Выборка.Количество(),"Информация");  
	
	Пока Выборка.Следующий() Цикл
	
		Номенклатура = Выборка.Ном;
		ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(810);
		КурсДокумента=РегистрыСведений.КурсыВалют;
		Цена =0 ;
				
		НайденнаяСтрока = ТЗ.Найти(Номенклатура, "Номенклатура");
		Если НайденнаяСтрока = Неопределено Тогда
			//Предупреждение("Товар не найден!");
		Иначе
			Цена = НайденнаяСтрока.Цена;
		КонецЕсли;
		
		
		//ПолучитьЦенуНоменклатуры(Номенклатура,Номенклатура.ОсновнаяЕдиница,ТипЦенАв,ВалютаДокумента,1,КонПериода);
		
		Если Цена=Неопределено или Цена=0 Тогда
			продолжить;
		КонецЕсли;
		
		//Если Цена=0 тогда    //+++
		//	продолжить;
		//КонецЕсли;	 
		
		ПС.Добавить();
		ПС.CODEPST=Номенклатура.Код;
		ПС.NAME=Номенклатура;
		ПС.CNTR=" ";
		ПС.FIRM=" ";
		ПС.QNTPACK="0";
		ШК =  НайтиШК(Номенклатура) ;
		ПС.EAN13=ШК;
		ПС.NDS="0";
		ПС.GDATE="0";
		ПС.QNT=Выборка.Остаток;
		ПС.NSP="0";
		ПС.GNVLS="0";
		ПС.PRICE2=Цена;
		ПС.PRICE2N="0";
		ПС.SUMNDS2="0";
		ПС.PRICEGR="0";
		ПС.DATEGR="0"; 
		ПС.NEWFLG="0";
		ПС.DATEPrice = ТекущаяДата();
		ЗаписатьВЛог("Регламент","Столетов.добавлено "+Номенклатура.Код,"Информация");  
		
	КонецЦикла;
	
	Попытка
		ПС.Записать();
	исключение
		ЗаписатьВЛог("Регламент"," прайс лист не записан.","Информация");  
	конецПопытки;
	
	ПС.ЗакрытьФайл();
	ЗаписатьВЛог("Регламент","Столетов. прайс лист сформирован записан.","Информация");  
	
	
	////----------------------------------------------
	////	 переносим автоматом на их фтп - сервер
	////----------------------------------------------
	//
	//Путь="\\E-cod\ediconnector2\Unifarm\Price\";
	//
	//Попытка
	//	Сервер=Новый FTPСоединение("ftp.Unifarm.ru",,"europa-elit","eur735opa"); 
	//Исключение
	//	//Сообщить(ОписаниеОшибки());
	//	Возврат;
	//КонецПопытки;
	//
	//ПолноеИмя="\\E-cod\ediconnector2\Unifarm\Price\price.dbf";
	//Имя="price.dbf";
	//
	//// удаляем старый прайс-лист)
	//Попытка
	//	Сервер.Удалить("/Прайслист/"+Имя);  //+++
	//Исключение
	//КонецПопытки;
	//
	//Попытка
	//	Сервер.Записать(полноеИмя,"/Прайслист/"+Имя);
	//Исключение
	//	КритичОшибки.Добавить("Файл прайс листа не передан на ФТП  "+ОписаниеОшибки() );
	//КонецПопытки;
	//
	//	
	//Если КритичОшибки.Количество()>0 Тогда
	//	СообщитьКритОшибки();
	//КонецЕсли;	
	//

	
	Сервер=Неопределено;
		
	Сообщить("Прайс загружен!");		
	
	//----------------------------------------------

	
КонецПроцедуры


//Это для Юнифарм
Процедура АвтоФормированиеПрайс()   Экспорт
	
	// для выбора остатков
	Склады=Новый Массив;
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STA-48"));
	ТипЦенАв=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301") ; // частное лицо //("SNL-0763"); // доктор столетов
	КонПериода=ТекущаяДата();
	// будем по матрицам брать данные по ценам и номенклатуре.
	//
	//Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-7891");
	////SSR-7891, SSP-4660
	//Договор = справочники.Договоры.НайтиПоКоду("SNL-025584"); //("SNL-025818");
	
		
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-8011");
	//SSR-7891, SSP-4660
	Договор = справочники.Договоры.НайтиПоКоду("SNL-025892"); //("SNL-025818");
	
	
	Тз = новый ТаблицаЗначений;
	ТЗ = ПолучитьАртикулыЦеныМатрицы(Контрагент,Договор);

		
	НомСп=ТЗ.выгрузитьКолонку("Номенклатура");
	
	ЗаписатьВЛог("Регламент","Столетов.Список ном. количество "+НомСП.количество(),"Информация");  
	// добавляем
	ПС=Новый XBase;	
	
	ПС.поля.Добавить("CODEPST","C","12");
	ПС.поля.Добавить("NAME","C","80");
	ПС.поля.Добавить("CNTR","C","20");
	ПС.поля.Добавить("FIRM","C","40");
	ПС.поля.Добавить("QNTPACK","N","8");
	ПС.поля.Добавить("EAN13","C","13");
	ПС.поля.Добавить("GDATE","D","8");
	ПС.поля.Добавить("QNT","N",9,3);      // остаток товара
	ПС.поля.Добавить("PRICE","N",9,2);
	ПС.поля.Добавить("QNTMIN","N",9,3);
	ПС.поля.Добавить("NDS","N",9,2);       //ставка ндс	
	
	//нечаева 05,09,19+++
	Путь  =  Константы.КаталогЕКОД.Получить() + "Unifarm\Price\";
	ПолноеИмя=Путь+"price.dbf";
	Имя="price.dbf";
	ПС.СоздатьФайл(ПолноеИмя);
	//нечаева 05,09,19---
	
	ПС.Записать();
	
	ПС.АвтоСохранение=Истина;	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ном,
	               |	Номенклатура.Код КАК Код,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Остаток > 100
	               |			ТОГДА 100
	               |		ИНАЧЕ ВложенныйЗапрос.Остаток
	               |	КОНЕЦ КАК Остаток
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ОстаткиТМЦОстатки.Номенклатура КАК Ном,
	               |			ОстаткиТМЦОстатки.КоличествоОстаток КАК Остаток
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиТМЦ.Остатки(&КонПериода, Склад В ИЕРАРХИИ (&Склады)) КАК ОстаткиТМЦОстатки) КАК ВложенныйЗапрос
	               |		ПО Номенклатура.Ссылка = ВложенныйЗапрос.Ном
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И (НЕ Номенклатура.ЭтоГруппа)
	               |	И ВложенныйЗапрос.Остаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ном";
	

	// берем только колготки
	//НомСп=Справочники.Номенклатура.НайтиПоНаименованию("Колготки");
	
	Запрос.УстановитьПараметр("Ссылка",НомСп); // номенклатура
	Запрос.УстановитьПараметр("Склады",Склады);
	Запрос.УстановитьПараметр("КонПериода",КонПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписатьВЛог("Регламент","Столетов.Выборка количество "+Выборка.Количество(),"Информация");  
	
	Пока Выборка.Следующий() Цикл
	
		Номенклатура = Выборка.Ном;
		ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(810);
		КурсДокумента=РегистрыСведений.КурсыВалют;
		Цена =0 ;
				
		НайденнаяСтрока = ТЗ.Найти(Номенклатура, "Номенклатура");
		Если НайденнаяСтрока = Неопределено Тогда
			//Предупреждение("Товар не найден!");
		Иначе
			Цена = НайденнаяСтрока.Цена;
		КонецЕсли;
		
		
		//ПолучитьЦенуНоменклатуры(Номенклатура,Номенклатура.ОсновнаяЕдиница,ТипЦенАв,ВалютаДокумента,1,КонПериода);
		
		Если Цена=Неопределено или Цена=0 Тогда
			продолжить;
		КонецЕсли;
		
		//Если Цена=0 тогда    //+++
		//	продолжить;
		//КонецЕсли;	 
		
		ПС.Добавить();
		ПС.CODEPST=Номенклатура.Код;
		ПС.NAME=Номенклатура;
		ПС.CNTR=" ";
		ПС.FIRM=" ";
		ПС.QNTPACK="0";
		ШК =  НайтиШК(Номенклатура) ;
		ПС.EAN13=ШК;
		ПС.NDS=ПолучитьСтавкуНДС(Номенклатура);
		ПС.GDATE="0";
		ПС.QNT=Выборка.Остаток;
		
		ПС.PRICE=Цена;
		ПС.QNTMIN="0"; 
		
		//ПС.NEWFLG="0";
		//ПС.DATEPrice = ТекущаяДата();
		ЗаписатьВЛог("Регламент","Юнифарм.добавлено "+Номенклатура.Код,"Информация");  
		
	КонецЦикла;
	
	Попытка
		ПС.Записать();
	исключение
		ЗаписатьВЛог("Регламент"," прайс лист не записан.","Информация");  
	конецПопытки;
	
	ПС.ЗакрытьФайл();
	ЗаписатьВЛог("Регламент","Юнифарм. прайс лист сформирован записан.","Информация");  
	
	
	////----------------------------------------------
	////	 переносим автоматом на их фтп - сервер
	////----------------------------------------------
	// нечаева 05,09,19+++
	Путь= Константы.КаталогЕКОД.Получить() + "Unifarm\Price\";

	
	Попытка
		Сервер = Новый FTPСоединение("ftp.unifarma.ru",,"unifarma_EEelite","bvn54-RT"); 
	Исключение
		//Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Путь  =  Константы.КаталогЕКОД.Получить() + "Unifarm\Price\";
	ПолноеИмя=Путь+"price.dbf";
	Имя="price.dbf";
	// нечаева 05,09,19---
	
	// удаляем старый прайс-лист)
	Попытка
		Сервер.Удалить("/price/"+Имя);  //+++
	Исключение
	КонецПопытки;
	
	Попытка
		Сервер.Записать(полноеИмя,"/price/"+Имя);
	Исключение
		КритичОшибки.Добавить("Файл прайс листа не передан на ФТП  "+ОписаниеОшибки() );
	КонецПопытки;
	
		
	Если КритичОшибки.Количество()>0 Тогда
		СообщитьКритОшибки();
	КонецЕсли;	
	

	
	Сервер=Неопределено;
		
	Сообщить("Прайс загружен!");		
	
	//----------------------------------------------

	
КонецПроцедуры



//************************************************************
//                    автозагрузка заказов
//************************************************************


Функция ФормированиеПечати(Строки,Шапка) Экспорт
	
	//ДокОбъект=ВыгрРНК;
	
	СтрШапка=Шапка.Получить(0);
	Организация=СтрШапка.Организация;
	
	Макет = ЭтотОбъект.ПолучитьМакет("Заказ");
	ТабДок= Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывод=ИспользованиеВывода.Разрешить;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Стр=Шапка.Получить(0);
	ОбластьЗаголовок.Параметры.Заполнить(Шапка.Получить(0));
	
	ОбластьЗаголовок.Параметры.НомЗаказа=Стр.НомерЗаказа;
	ОбластьЗаголовок.Параметры.КодДоставки=Стр.КодДоставки;
	Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
	Контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-4660"); // столетов
	
	
	Договор=Контрагент.ОсновнойДоговор;
	Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
		Если ЗначениеЗаполнено(Договор.Организация) Тогда
			Организация=Договор.Организация;		
		КонецЕсли;
	КонецЕсли;
	
	ГЛНПродавца="";
	ЕИ="4607182079990";
	КБ="4607182769990";
	
	
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	
	ОбластьИтоги.Параметры.Заполнить(Шапка.Получить(0));
	ОбластьСтрока = Макет.ПолучитьОбласть("ТекущаяСтрока");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	НомПП=1;
	ОбщСумма=0; ОбщКолУпак=0;
	Для каждого ТекСтрока Из Строки Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
		Если ТекСтрока.Колво-ТекСтрока.КолвоОтредактированное Тогда
			ОбластьСтрока.Область("Колво").ЦветТекста = Новый Цвет(255, 0, 0);
		Иначе
			ОбластьСтрока.Область("Колво").ЦветТекста = Новый Цвет(0, 0, 0);
		КонецЕсли;	
		
		Если ТекСтрока.Найдена Тогда
			ОбластьСтрока.Параметры.Найдена="v";
			ОбластьСтрока.Область("ТекущаяСтрока").ЦветТекста = Новый Цвет(0, 0, 0);
		Иначе	
			ОбластьСтрока.Параметры.Найдена="";
			ОбластьСтрока.Область("ТекущаяСтрока").ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		ОбластьСтрока.Параметры.НомПП=НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		НомПП=НомПП+1;
		ОбщСумма=ОбщСумма+ТекСтрока.СуммаБезНДС;
		
		
	КонецЦикла;	
	
	ОбластьИтоги.Параметры.общСумма=ОбщСумма;	
	ТабДок.Вывести(ОбластьИтоги);
	ТабДок.ОтображатьСетку=Ложь;
	
	
	Имя="\\SRVECOD\SFERAConnector2\EDI\Unifarm\"+СокрЛП(СтрШапка.НомерЗаказа)+".mxl";     // ++++
	
	Попытка
		ТабДок.Вывод=ИспользованиеВывода.Разрешить;
		ТабДок.Записать(Имя);
	Исключение
		КритичОшибки.Добавить("Не возможно создать файл печати для заказа "+СтрШапка.НомЗаказа+". Столетов  "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	//ТабДок.Показать(); //+++
	
	Возврат Имя;
	
КонецФункции



Функция НайтиПОШКМатрица(ШК,НамТовара="",Контрагент)Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();

		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.ШККонтрагента = &ТекШК
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
						
			Возврат Рез.Номенклатура;
		КонецЕсли;

	//---------------------------------------------------------------------------
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()


//для отладки пока тут все рассмотрим.
Процедура АвтоЗагрузкаРНК()  Экспорт
	
	ПризКр=0;
	МассивЗагруженных=Новый Массив;                                  //+++
	
	ПутьЗак="\\SRVECOD\SFERAConnector2\EDI\Unifarm\Zakaz\";
	ПутьЗакАрхив="\\SRVECOD\SFERAConnector2\EDI\Unifarm\Zakaz\Arhiv";
	//------------------------------------------------------------------------
	//1. проверяем наличие заказов
	//2. загружаем в базу (делаем копию в архив)
	
	Сервер=Неопределено;
	
	//ПолеСписка.Очистить();
	# Если Клиент  Тогда
		Состояние("Подключение к ФТП");
		
	#КонецЕсли 
	
	
	Попытка
		//Сервер=Новый FTPСоединение("ftp.Unifarm.ru",,"europa-elit","eur735opa",,истина,25);
		Сервер=Новый FTPСоединение("ftp.unifarma.ru",,"unifarma_EEelite","bvn54-RT",,истина,25); 
	Исключение
		КритичОшибки.Добавить("Не удалось подключиться к фтп серверу! " +ОписаниеОшибки());
		//Сообщить(ОписаниеОшибки());
		//Возврат;
	КонецПопытки;
	
	# Если Клиент Тогда
		Состояние("Получение списка файлов..");
	# КонецЕсли
	
	// работает, не нужно ставить второй флеш, чтобы получить данные по списку файлов
	
	МассивФайлов=Сервер.НайтиФайлы("/zakaz","*.*");         // +++
	Для каждого Файл из  МассивФайлов Цикл
		ТЗШапка.Очистить();
		
		Если Файл.этофайл() тогда
			
			Попытка
				МассивЗагруженных.Добавить(""+ПутьЗак+Файл.Имя);
				Сервер.Получить(Файл.ПолноеИмя, ""+ПутьЗак+Файл.Имя);
			Исключение
				КритичОшибки.Добавить("Не удалось получить файл с фтп сервера! "+Файл.ПолноеИмя+"   - " +ОписаниеОшибки());
				продолжить;
			КонецПопытки;
			
			// копируем файл в архив
			
			ИмяДляЗаписи=""+ПутьЗакАрхив+"\"+Файл.Имя;
			КопироватьФайл(""+ПутьЗак+Файл.Имя,ИмяДляЗаписи);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	//-------------------------------------------------------------------------
	//   формируем документы РНК, отправляем письмо менеджеру
	//загрузка
	
	#Если Клиент Тогда
		Состояние("Формирование РНК ...");
	#КонецЕсли
	
	Для Каждого Файл Из МассивЗагруженных Цикл
		
		//ОбработкаПрерыванияПользователя();
		
		ПризКр=0;
		ИмяФайла1=Файл;
		БД=Новый XBase;
		Попытка
			БД.ОткрытьФайл(ИмяФайла1);
		Исключение
			КритичОшибки.Добавить("Не удалось открыть файл заказа! " + ИмяФайла1 +ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		БД.Кодировка = КодировкаXBase.OEM;
		
		НомерЗаказа=БД.NUMZ;
		
		ДатаЗаказа=БД.DATEZ; 
		
		// очищаем все файлы.
		ТзПечать.Очистить();
		КритичОшибки.Очистить();
		СтрокаШапка=ТЗШапка.Добавить();
		Файлы.Очистить();
		Ошибки.Очистить();
		//----------------------
		
		ТекФайл=ИмяФайла1;
		НомерЗаказа= БД.NUMZ;
		
		
		СтрокаШапка.НомерЗаказа=НомерЗаказа;
		СтрокаШапка.ДатаЗаказа=ДатаЗаказа;
		СтрокаШапка.КодДоставки=БД.Podrcd;
		СтрокаШапка.НазваниеМестаДоставки=БД.Podr;
		
		
		ТекДата=ТекущаяДата();
		Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-4660");
		ПунктДоставки=Справочники.ПунктыДоставки.ПустаяСсылка();
		
		КодПодрДоставки=СокрЛП(БД.PODRCD);	
		
		Запрос= Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПунктыДоставки.Владелец,
		|	ПунктыДоставки.Ссылка,
		|	ПунктыДоставки.НомерМагазина
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	ПунктыДоставки.Владелец = &Контрагент
		|	И ПунктыДоставки.НомерМагазина = &ТекНом";
		
		Запрос.УстановитьПараметр("Контрагент",контрагент);
		Запрос.УстановитьПараметр("ТекНом",КодПодрДоставки);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если рез.Следующий() Тогда
			ПунктДоставки=Рез.ссылка;
		КонецЕсли;
		
		СтрокаШапка.АдресМестаДоставки=ПунктДоставки.ПочтовыйАдрес;
		
		//-----------------------------------------------
		//***********************************************
		//-----------------------------------------------
		
		Склад=Справочники.Склады.НайтиПоКоду("STA-48");
		ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		
		// первая строка базы данных
		СтрокаТоваров = ДокОбъект.Товары.Добавить();
		//Поиск = Справочники.Номенклатура.НайтиПоКоду(БД.CODEPST);
		//Ищем номенклатуру по мтарице
		
		Поиск = НайтиПОШКМатрица(БД.CODEPST,"",Контрагент);
		
		
		НовСтр=ТЗПечать.Добавить();
		НомСт=1;
		ОбщКол=0;
		ОбщСумма=0;
		
		Если Поиск.Пустая() Тогда
			
			НовСтр.Номенклатура=Поиск;
			Новстр.Название= ""; // БД.Naim;
			НовСтр.Штрихкод=  БД.CODEPST;
			НовСтр.колво= БД.QNT;
			НовСтр.Цена= БД.Price;
			Новстр.Найдена=Ложь;
			НовСтр.НомерСтроки=НомСт;
			ОБщКол=ОбщКол+НовСтр.колво;
			ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
			
			//Количество	=СтрокаТЧ.Количество;
			//Ндс1шт      =Окр(СтрокаТЧ.Цена*СтавкаНДС/(100+СтавкаНДС),2,0);
			//Цена      	=Окр((СтрокаТЧ.Цена-НДС1шт),2,0);      // уже без  ндс
			//ЦенаОбщ     =Ндс1шт+цена;
			//	
			
		Иначе
			Номенклатура = Поиск;
			строкатоваров.Номенклатура=Номенклатура;
			строкатоваров.Заявка = БД.QNT;
			ПриИзмененииНоменклатурыТабЧасти(строкатоваров,ДокОбъект);   //  
			РассчитатьСуммуТабЧасти(строкатоваров,ДокОбъект);
			
			НовСтр.Номенклатура=Поиск;
			Новстр.Название= ""; // БД.Naim;
			НовСтр.Штрихкод=  БД.CODEPST;
			НовСтр.колво= БД.QNT;
			НовСтр.Цена= БД.Price2;
			Новстр.Найдена=Истина;
			НовСтр.НомерСтроки=НомСт;
			ОБщКол=ОбщКол+НовСтр.колво;
			ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
			
		КонецЕсли;
		
		
		// остальные строки базы данных
		
		Пока БД.Следующая()Цикл
			
			НомСт=НомСт+1;
			//ОбработкаПрерыванияПользователя();
			строкатоваров = ДокОбъект.Товары.Добавить();
			НовСтр=ТЗПечать.Добавить();
			
			//Поиск=Справочники.Номенклатура.НайтиПоКоду(БД.CODEPST);
			Поиск = НайтиПОШКМатрица(БД.CODEPST,"",Контрагент);

			
			Если Поиск.Пустая() Тогда
				
				НовСтр.Номенклатура=Поиск;
				Новстр.Название= "";
				НовСтр.Штрихкод=  БД.CODEPST;
				НовСтр.колво= БД.QNT;
				НовСтр.Цена= БД.Price2;
				Новстр.Найдена=Ложь;
				НовСтр.НомерСтроки=НомСт;
				ОБщКол=ОбщКол+НовСтр.колво;
				ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
				
				//Количество	=СтрокаТЧ.Количество;
				//Ндс1шт      =Окр(СтрокаТЧ.Цена*СтавкаНДС/(100+СтавкаНДС),2,0);
				//Цена      	=Окр((СтрокаТЧ.Цена-НДС1шт),2,0);      // уже без  ндс
				//ЦенаОбщ     =Ндс1шт+цена;
				//	
				
			Иначе
				Номенклатура = Поиск;
				строкатоваров.Номенклатура=Номенклатура;
				строкатоваров.Заявка = БД.QNT;
				ПриИзмененииНоменклатурыТабЧасти(строкатоваров,ДокОбъект);   //  
				РассчитатьСуммуТабЧасти(строкатоваров,ДокОбъект);
				
				НовСтр.Номенклатура=Поиск;
				Новстр.Название=  "";
				НовСтр.Штрихкод=  БД.CODEPST;
				НовСтр.колво= БД.QNT;
				НовСтр.Цена= БД.Price2;
				Новстр.Найдена=Истина;
				НовСтр.НомерСтроки=НомСт;
				ОБщКол=ОбщКол+НовСтр.колво;
				ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
				
			КонецЕсли;
			
			// добавляем строки в файл для печати и отображения менеджеру.
			
			
		КонецЦикла;
		ДокОбъект.УстановитьНовыйНомер("SSPб-");
		
		СтрокаШапка.КолСтрок=НомСт;
		СтрокаШапка.ОбщКол=ОбщКол;
		СтрокаШапка.ОбщСумма=ОбщСумма;
		
		
		
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); //tlbyfz tdhjgf
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;  
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ НомерЗаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			КонецЕсли;
			//++Данилова Е.В. 30.09.2025 HELP-7048
			//Подразделение = Контрагент.Менеджер.Подразделение;
			Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
			//--Данилова Е.В. 30.09.2025
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				Пока Результат.Следующий() Цикл
					КодПоставщикаКонтрагента=Результат.ссылка;
					возврат;
				КонецЦикла;
				// если ашан то :
				Если контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-2450") ТОгда
					Если Склад=Справочники.Склады.НайтиПоКоду("SNL-84") тОгда
						КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000003");
					Иначе
						КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
				ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
				ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			КонецЕсли;		
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=текущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		
		ДокОбъект.НомерЗаказа=НомерЗаказа;
		ДокОбъект.ДатаЗаказа=ДатаЗаказа;  //Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
		
		//----------------------------------------------------------------	
		СтрокаШапка.ДатаЗаказа=ДатаЗаказа;
		СтрокаШапка.НомерЗаказа=НомерЗаказа;
		СтрокаШапка.Контрагент=Контрагент;
		СтрокаШапка.ПунктДоставки=ПунктДоставки;
		СтрокаШапка.КодМестаДоставки=ПунктДоставки.НомерМагазина;
		//------------------------------------------------------------------
		
		
		//ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);     //+++
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
		Исключение
			
			КритичОшибки.Добавить("Для заказа от <<Юнифарм>> Заказ  №"+ДокОбъект.НомерЗаказа+" документ не записан! "+ОписаниеОшибки() );
			
		КонецПопытки;
		
		//Сообщить(""+ДокОбъект.Номер+"   документ записан");
		ПризКр=ПризКр+1;
		
		//--------------------------------------------------
		
		БД.ЗакрытьФайл();
		
		//----------------------------------------------------
		СообщитьМенеджеру(ТекФайл, ТЗШапка);       //++++
		СообщитьКритОшибки();
		
	КонецЦикла;
	
	
	//---------------------------------------------------------------------------	
	//3. удаляем файл на сервере фтп
	
	Попытка
		// Удалить(<Путь>, <Маска>) - шпаргалка
		
		
		
		//Сервер.Удалить("/Orders","*.*");         //+++
		
		
		
	Исключение
		КритичОшибки.Добавить(""+МассивФайлов.Количество()+" шт. - Файлы заказов не удалены на ФТП! Очистите ФТП! "+ОписаниеОшибки() );
	КонецПопытки;
	
	Сервер=Неопределено;
	
	Сообщить("Загрузка завершена! "+ МассивФайлов.Количество()+ "  файлов загружено.");
	
КонецПроцедуры



Процедура АвтоЗагрузкаРНК2() Экспорт
	
	ПризКр=0;
	МассивЗагруженных=Новый Массив;                                  //+++
	
	ПутьЗак="\\SRVECOD\SFERAConnector2\EDI\Unifarm\Zakaz\";
	ПутьЗакАрхив="\\SRVECOD\SFERAConnector2\EDI\Unifarm\Zakaz\Arhiv";
	//------------------------------------------------------------------------
	//1. проверяем наличие заказов
	//2. загружаем в базу (делаем копию в архив)
	
	Сервер=Неопределено;
	
	//ПолеСписка.Очистить();
	# Если Клиент  Тогда
		Состояние("Подключение к ФТП");
		
	#КонецЕсли 
	
	
	Попытка
		//Сервер=Новый FTPСоединение("ftp.stoletov.ru",,"europa-elit","eur735opa",,истина,25);
		Сервер=Новый FTPСоединение("ftp.unifarma.ru",,"unifarma_EEelite","bvn54-RT",,истина,25); 
	Исключение
		КритичОшибки.Добавить("Не удалось подключиться к фтп серверу! " +ОписаниеОшибки());
		//Сообщить(ОписаниеОшибки());
		//Возврат;
	КонецПопытки;
	
	# Если Клиент Тогда
		Состояние("Получение списка файлов..");
	# КонецЕсли
	
	// работает, не нужно ставить второй флеш, чтобы получить данные по списку файлов
	
	МассивФайлов=Сервер.НайтиФайлы("/Заказ","*.*");         // +++
	Для каждого Файл из  МассивФайлов Цикл
		ТЗШапка.Очистить();
		
		Если Файл.этофайл() тогда
			
			Попытка
				МассивЗагруженных.Добавить(""+ПутьЗак+Файл.Имя);
				Сервер.Получить(Файл.ПолноеИмя, ""+ПутьЗак+Файл.Имя);
			Исключение
				КритичОшибки.Добавить("Не удалось получить файл с фтп сервера! "+Файл.ПолноеИмя+"   - " +ОписаниеОшибки());
				продолжить;
			КонецПопытки;
			
			// копируем файл в архив
			
			ИмяДляЗаписи=""+ПутьЗакАрхив+"\"+Файл.Имя;
			КопироватьФайл(""+ПутьЗак+Файл.Имя,ИмяДляЗаписи);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	//-------------------------------------------------------------------------
	//   формируем документы РНК, отправляем письмо менеджеру
	//загрузка
	
	#Если Клиент Тогда
		Состояние("Формирование РНК ...");
	#КонецЕсли
	
	Для Каждого Файл Из МассивЗагруженных Цикл
		
		//ОбработкаПрерыванияПользователя();
		
		ПризКр=0;
		ИмяФайла1=Файл;
		БД=Новый XBase;
		Попытка
			БД.ОткрытьФайл(ИмяФайла1);
		Исключение
			КритичОшибки.Добавить("Не удалось открыть файл заказа! " + ИмяФайла1 +ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		БД.Кодировка = КодировкаXBase.OEM;
		
		НомерЗаказа=БД.NUMZ;
		
		ДатаЗаказа=БД.DATEZ; 
		
		// очищаем все файлы.
		ТзПечать.Очистить();
		КритичОшибки.Очистить();
		СтрокаШапка=ТЗШапка.Добавить();
		Файлы.Очистить();
		Ошибки.Очистить();
		//----------------------
		
		ТекФайл=ИмяФайла1;
		НомерЗаказа= БД.NUMZ;
		
		
		СтрокаШапка.НомерЗаказа=НомерЗаказа;
		СтрокаШапка.ДатаЗаказа=ДатаЗаказа;
		СтрокаШапка.КодДоставки=БД.Podrcd;
		СтрокаШапка.НазваниеМестаДоставки=БД.Podr;
		
		
		ТекДата=ТекущаяДата();
		Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-4660");
		ПунктДоставки=Справочники.ПунктыДоставки.ПустаяСсылка();
		
		КодПодрДоставки=СокрЛП(БД.PODRCD);	
		
		Запрос= Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПунктыДоставки.Владелец,
		|	ПунктыДоставки.Ссылка,
		|	ПунктыДоставки.НомерМагазина
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	ПунктыДоставки.Владелец = &Контрагент
		|	И ПунктыДоставки.НомерМагазина = &ТекНом";
		
		Запрос.УстановитьПараметр("Контрагент",контрагент);
		Запрос.УстановитьПараметр("ТекНом",КодПодрДоставки);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если рез.Следующий() Тогда
			ПунктДоставки=Рез.ссылка;
		КонецЕсли;
		
		СтрокаШапка.АдресМестаДоставки=ПунктДоставки.ПочтовыйАдрес;
		
		//-----------------------------------------------
		//***********************************************
		//-----------------------------------------------
		
		Склад=Справочники.Склады.НайтиПоКоду("SNL-84");
		ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		
		// первая строка базы данных
		СтрокаТоваров = ДокОбъект.Товары.Добавить();
		Поиск = Справочники.Номенклатура.НайтиПоКоду(БД.CODEPST);
		НовСтр=ТЗПечать.Добавить();
		НомСт=1;
		ОбщКол=0;
		ОбщСумма=0;
		
		Если Поиск.Пустая() Тогда
			
			НовСтр.Номенклатура=Поиск;
			Новстр.Название= БД.Naim;
			НовСтр.Штрихкод=  БД.CODEPST;
			НовСтр.колво= БД.QNT;
			НовСтр.Цена= БД.Price2;
			Новстр.Найдена=Ложь;
			НовСтр.НомерСтроки=НомСт;
			ОБщКол=ОбщКол+НовСтр.колво;
			ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
			
			//Количество	=СтрокаТЧ.Количество;
			//Ндс1шт      =Окр(СтрокаТЧ.Цена*СтавкаНДС/(100+СтавкаНДС),2,0);
			//Цена      	=Окр((СтрокаТЧ.Цена-НДС1шт),2,0);      // уже без  ндс
			//ЦенаОбщ     =Ндс1шт+цена;
			//	
			
		Иначе
			Номенклатура = Поиск;
			строкатоваров.Номенклатура=Номенклатура;
			строкатоваров.Заявка = БД.QNT;
			ПриИзмененииНоменклатурыТабЧасти(строкатоваров,ДокОбъект);   //  
			РассчитатьСуммуТабЧасти(строкатоваров,ДокОбъект);
			
			НовСтр.Номенклатура=Поиск;
			Новстр.Название= БД.Naim;
			НовСтр.Штрихкод=  БД.CODEPST;
			НовСтр.колво= БД.QNT;
			НовСтр.Цена= БД.Price2;
			Новстр.Найдена=Истина;
			НовСтр.НомерСтроки=НомСт;
			ОБщКол=ОбщКол+НовСтр.колво;
			ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
			
		КонецЕсли;
		
		
		// остальные строки базы данных
		
		Пока БД.Следующая()Цикл
			
			НомСт=НомСт+1;
			//ОбработкаПрерыванияПользователя();
			строкатоваров = ДокОбъект.Товары.Добавить();
			НовСтр=ТЗПечать.Добавить();
			
			Поиск=Справочники.Номенклатура.НайтиПоКоду(БД.CODEPST);
			
			Если Поиск.Пустая() Тогда
				
				НовСтр.Номенклатура=Поиск;
				Новстр.Название= БД.Naim;
				НовСтр.Штрихкод=  БД.CODEPST;
				НовСтр.колво= БД.QNT;
				НовСтр.Цена= БД.Price2;
				Новстр.Найдена=Ложь;
				НовСтр.НомерСтроки=НомСт;
				ОБщКол=ОбщКол+НовСтр.колво;
				ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
				
				//Количество	=СтрокаТЧ.Количество;
				//Ндс1шт      =Окр(СтрокаТЧ.Цена*СтавкаНДС/(100+СтавкаНДС),2,0);
				//Цена      	=Окр((СтрокаТЧ.Цена-НДС1шт),2,0);      // уже без  ндс
				//ЦенаОбщ     =Ндс1шт+цена;
				//	
				
			Иначе
				Номенклатура = Поиск;
				строкатоваров.Номенклатура=Номенклатура;
				строкатоваров.Заявка = БД.QNT;
				ПриИзмененииНоменклатурыТабЧасти(строкатоваров,ДокОбъект);   //  
				РассчитатьСуммуТабЧасти(строкатоваров,ДокОбъект);
				
				НовСтр.Номенклатура=Поиск;
				Новстр.Название=  БД.Naim;
				НовСтр.Штрихкод=  БД.CODEPST;
				НовСтр.колво= БД.QNT;
				НовСтр.Цена= БД.Price2;
				Новстр.Найдена=Истина;
				НовСтр.НомерСтроки=НомСт;
				ОБщКол=ОбщКол+НовСтр.колво;
				ОБщСумма=ОбщСумма+Число(Сокрлп(НовСтр.Цена))*Число(СокрЛП(НовСтр.колво));
				
			КонецЕсли;
			
			// добавляем строки в файл для печати и отображения менеджеру.
			
			
		КонецЦикла;
		ДокОбъект.УстановитьНовыйНомер("SSPб-");
		
		СтрокаШапка.КолСтрок=НомСт;
		СтрокаШапка.ОбщКол=ОбщКол;
		СтрокаШапка.ОбщСумма=ОбщСумма;
		
		
		
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			
			Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;  
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ НомерЗаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			КонецЕсли;
			//++Данилова Е.В. 30.09.2025 HELP-7048
			//Подразделение = Контрагент.Менеджер.Подразделение;
			Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
			//--Данилова Е.В. 30.09.2025
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				Пока Результат.Следующий() Цикл
					КодПоставщикаКонтрагента=Результат.ссылка;
					возврат;
				КонецЦикла;
				// если ашан то :
				Если контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-2450") ТОгда
					Если Склад=Справочники.Склады.НайтиПоКоду("SNL-84") тОгда
						КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000003");
					Иначе
						КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
				ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
				ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			КонецЕсли;		
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекДата;
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		
		ДокОбъект.НомерЗаказа=НомерЗаказа;
		ДокОбъект.ДатаЗаказа=ДатаЗаказа;  //Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
		
		//----------------------------------------------------------------	
		СтрокаШапка.ДатаЗаказа=ДатаЗаказа;
		СтрокаШапка.НомерЗаказа=НомерЗаказа;
		СтрокаШапка.Контрагент=Контрагент;
		СтрокаШапка.ПунктДоставки=ПунктДоставки;
		СтрокаШапка.КодМестаДоставки=ПунктДоставки.НомерМагазина;
		//------------------------------------------------------------------
		
		
		//ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);     //+++
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
		Исключение
			
			КритичОшибки.Добавить("Для заказа от <<Столетов>> Заказ  №"+ДокОбъект.НомерЗаказа+" документ не записан! "+ОписаниеОшибки() );
			
		КонецПопытки;
		
		//Сообщить(""+ДокОбъект.Номер+"   документ записан");
		ПризКр=ПризКр+1;
		
		//--------------------------------------------------
		
		БД.ЗакрытьФайл();
		
		//----------------------------------------------------
		СообщитьМенеджеру(ТекФайл, ТЗШапка);       //++++
		СообщитьКритОшибки();
		
	КонецЦикла;
	
	
	//---------------------------------------------------------------------------	
	//3. удаляем файл на сервере фтп
	
	Попытка
		// Удалить(<Путь>, <Маска>) - шпаргалка
		Сервер.Удалить("/Заказ","*.*");         //+++
	Исключение
		КритичОшибки.Добавить(""+МассивФайлов.Количество()+" шт. - Файлы заказов не удалены на ФТП! Очистите ФТП! "+ОписаниеОшибки() );
	КонецПопытки;
	
	Сервер=Неопределено;
	
	//Сообщить("Загрузка завершена! "+ МассивФайлов.Количество()+ "  файлов загружено.");
	
КонецПроцедуры

//************************************************************

Процедура СообщитьМенеджеру(ПутьФайла, Шапка) Экспорт
	
	СтрШапка=Шапка.Получить(0);
	Менеджер=СтрШапка.контрагент.Менеджер;
	
	//---------------------------------------------------------------
	Попытка
		ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	Исключение
		КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	КонецПопытки;
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	
	////---------------------------------------------------------------
	Сообщение.Получатели.Добавить(Менеджер.ЕМэйл);     // +++
	
	// получаем заместителей, для отправки из справочника пользователи.
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПользователиЗаместители.Заместитель,
	|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	|ИЗ                                                                 //+++
	|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	|ГДЕ
	|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	Результат=Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
			Сообщение.Получатели.Добавить(Результат.ЗамЕМэйл);
		Иначе
			КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Заместитель.Наименование+" не определен ЕМэйл. "+Символ(13));
		КонецЕсли;
	КонецЦикла;	
	//-----------------------------------------------
	Сообщение.Получатели.Добавить("ecode@collant.ru"); //+++
	
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Отправитель="ecode@collant.ru";
	
	
	Попытка
		Сообщение.Вложения.Добавить(ПутьФайла);  // ++++
	Исключение
		КритичОшибки.Добавить("Не возможно добавить файл заказа .dbf "+СтрШапка.НомерЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	Попытка
		Сообщение.Вложения.Добавить(ИмяФайлаПечати);  // ++++
	Исключение
		КритичОшибки.Добавить("Не возможно добавить файл печати "+СтрШапка.НомерЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	// и прикрепляем файл;
	//----------------------------------------------------------------
	ПунктДоставки=СтрШапка.ПунктДоставки;
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	//----------------------------------------------------------------
	
	Сообщение.Тема="Автообмен Столетов. Новый заказ № "+СтрШапка.номерЗаказа+" - "+СтрШапка.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Новый заказ от Эркафарм(Доктор Столетова) № "+СтрШапка.НомерЗаказа+"  от компании  "+СтрШапка.контрагент+".");
	
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	
КонецПроцедуры


Процедура СообщитьКритОшибки() 
	
	Если критичОшибки.Количество()>0 Тогда
		возврат;
	КонецЕсли;	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("ecode@collant.ru"); //+++
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Столетов. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры

//-----------------------------------------------------------------------
// запуск автообмена по загрузке РНК.

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт

	//
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));     //+++
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
       
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Загрузка из Столетов. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	
	//+++++
	//для Столетова
	Если Час(ТекущаяДата())<10 И Час(ТекущаяДата())>8 Тогда
		
		// прайс выгружаем только один раз.
		
		АвтоФормированиеПрайс();
		//АвтоЗагрузкаРНК();
		
	КонецЕсли;  
	
	
	//Для ЮниФарма
	//Если Час(ТекущаяДата())<10 И Час(ТекущаяДата())>8 Тогда
		
		// прайс выгружаем только один раз.
		АвтоФормированиеПрайс();
		//АвтоЗагрузкаРНК();
		
	//КонецЕсли;  

	
	
	
    ЗаписатьВЛог("Регламент","Задача: Загрузка из Столетов. Окончание выполнения.","Информация");  
	
КонецПроцедуры	

//----------------------------------------------------------------------
КритичОшибки= Новый массив;
Ошибки=Новый Массив;
Файлы=Новый Массив;
ПризнакЗаписиДокумента=Истина;


ТЗШапка=Новый ТаблицаЗначений;
ТЗШапка.Колонки.Добавить("НомерЗаказа");
ТЗШапка.Колонки.Добавить("ДатаЗаказа");
ТЗШапка.Колонки.Добавить("ДатаДоставки");
ТЗШапка.Колонки.Добавить("ТипЗаказа");
ТЗШапка.Колонки.Добавить("КодВалюты");
ТЗШапка.Колонки.Добавить("НазваниеПокупателя");
ТЗШапка.Колонки.Добавить("КодМестаДоставки");
ТЗШапка.Колонки.Добавить("НазваниеМестаДоставки");
ТЗШапка.Колонки.Добавить("АдресМестаДоставки");
ТЗШапка.Колонки.Добавить("Контрагент");
ТЗШапка.Колонки.Добавить("ПунктДоставки");
ТЗШапка.Колонки.Добавить("Менеджер");
ТЗШапка.Колонки.Добавить("Организация");
ТЗШапка.Колонки.Добавить("КодДоставки");
ТЗШапка.Колонки.Добавить("КолСтрок");
ТЗШапка.Колонки.Добавить("ОбщКол");
ТЗШапка.Колонки.Добавить("ОбщСумма");


ТЗПечать=Новый ТаблицаЗначений;
ТЗПечать.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Найдена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Колво",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТЗПечать.Колонки.Добавить("Единица",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ЦенаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"));


