Процедура ЗакрытьДеньПоАвансам(Режим) Экспорт	
	Форма = ПолучитьФорму("ОбщаяФорма.УстановкаДЗРпоАвансам");	
	Форма.Режим = Режим;
	Форма.ОткрытьМодально();	
КонецПроцедуры //ЗакрытьДеньПоАвансам(Режим) Экспорт
//++метка- 19.06.2026 №0000001219
Функция ЭтоСобытиеСканераНаКлиенте(Событие) Экспорт
	Возврат Найти(ВРег("ПолученШтрихКод,BarCodeValue,MagneticStripeCardValue"),ВРег(Событие))<>0 ;
КонецФункции


Процедура СообщитьПользователю(Знач Данные, Знач КлючДанных = Неопределено, Знач Поле = "",
	Знач ПутьКДанным = "", Отказ = Ложь) Экспорт

	Сообщение		= Новый СообщениеПользователю;

	Сообщение.Текст	= Данные;
	Сообщение.Поле	= Поле;

	ЭтоОбъект		= Ложь;

#Если Не ТонкийКлиент И Не ВебКлиент Тогда
	Если КлючДанных <> Неопределено И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = Найти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли

	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;

	Если Не ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;

	Сообщение.Сообщить();

	Отказ = Истина;

КонецПроцедуры
