#Область ПоискДублей

Функция ПроверкаДублейЧЗ(тзШтрихкодыУпаковок) Экспорт
	
	СтруктураВозврата = Новый Структура("ЕстьДубли, тзДубли", Ложь, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ тзШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	КОЛИЧЕСТВО(тзШтрихкодыУпаковок.ШтрихкодУпаковки) КАК КоличествоДублей
	|ИЗ
	|	тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|
	|СГРУППИРОВАТЬ ПО
	|	тзШтрихкодыУпаковок.ШтрихкодУпаковки
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(тзШтрихкодыУпаковок.ШтрихкодУпаковки) > 1";
	
	УстановитьПривилегированныйРежим(Истина);
	тзДубли = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если тзДубли.Количество() > 0 Тогда
		СтруктураВозврата.Вставить("ЕстьДубли", Истина);
		СтруктураВозврата.Вставить("тзДубли", тзДубли);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

Функция ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ
	|	Документ.РекламационнаяНакладная.ШтрихкодыУпаковок	
	|ГДЕ
	|	Ссылка = &ДокСсылка 
	|";	
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт